export const DATA_SPORT = {
  selfcheckQuestions: [
    {
      id: 0,
      name:
        'ประวัติขณะเกิดเหตุ เช่น กีฬาที่เล่น, ท่าทางขณะเกิดเหตุ, ลักษณะขณะเกิดเหตุ, อาการหลังจากเกิดเหตุ',
    },
    { id: 1, name: 'โรคประจําตัว ยาโรคประจําตัวหรือยาที่ทานประจํา' },
    { id: 2, name: 'การรักษาก่อนมารพ. การปฐมพยาบาลเบื้องต้น เช่น ยา, ทําแผล' },
    { id: 3, name: 'ประวัติผ่าตัดในอดีต เช่น ผ่าตัดใส่เหล็กดามกระดูก' },
    {
      id: 4,
      name:
        'ประวัติตั้งครรภ์,ประจําเดือน วันแรกของประจําเดือนครั้งล่าสุด, การคุมกําเนิด',
    },
    { id: 5, name: 'ประวัติแพ้ยาและอาหาร ชื่อยาที่แพ้, อาการขณะแพ้, การรักษา' },
  ],

  muscleMenu: [
    {
      title: 'กล้ามเนื้อฉีก \n(Muscle strain)​',
      value: 'sports-muscle-strain',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'กล้ามเนื้อระบม \n(Muscle soreness)​',
      value: 'sports-muscle-soreness',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'กล้ามเนื้อฟกช้ำ \n(Muscle contusion)​',
      value: 'sports-muscle-contusion',
      bColor: '#a2a7bb',
      bgColor: '#cdced3',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'ตะคริว (Muscle cramp)',
      value: 'sports-muscle-cramp',
      bColor: '#26a872',
      bgColor: '#88c2aa',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  //** NOTE Muscle injury content */

  muscleStrain: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวด',
          'มีจุดกดเจ็บที่กล้ามเนื้อ',
          'อาจพบรอยห้อเลือดบริเวณที่กล้ามเนื้อฉีกขาด',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: [
          'ภาพเอกซเรย์ เพื่อแยกกับภาวะอื่น ๆ เช่น กระดูกหัก',
          'เอกซเรย์คลื่นแม่เหล็กไฟฟ้า (MRI) กรณีสงสัยว่ามีกล้ามเนื้อฉีกขาดทั้งมัด',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พักการใช้งาน',
          'ประคบเย็น 10-15 นาที เพื่อลดอาการปวด',
          'ใช้ผ้ายืดพันรอบบริเวณบาดเจ็บ',
          'ยกขาสูง',
          'ทานยาแก้ปวด',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'กล้ามเนื้อฉีกขาดทั้งมัด',
          'กล้ามเนื้อฉีกขาดบางส่วน 50% และมีการทำงานของกล้ามเนื้อลดลงอย่างมาก',
        ],
      },
    ],
  },
  muscleSoreness: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวดตึงที่กล้ามเนื้อหลังออกกำลังกายอย่างหนักประมาณ 24-72 ชั่วโมง',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: ['หากอาการไม่รุนแรง อาจไม่จําเป็นต้องตรวจเพิ่มเติม'],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'อาการมักหายได้เองใน 2-3 วัน',
          'หลีกเลี่ยงการออกกําลังกายอย่างหักโหม',
          'พักการใช้งาน',
          'อบอุ่นร่างกายก่อนออกกําลังกาย',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: ['โดยทั่วไปไม่จําเป็นต้องได้รับกลารผ่าตัด'],
      },
    ],
  },
  muscleContusion: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวด บวม ตึง บริเวณที่ถูกกระแทก',
          'มีจุดกดเจ็บที่กล้ามเนื้อ',
          'เคลื่อนไหวได้ลดลง',
          'อาจพบรอยห้อเลือดบริเวณกล้ามเนื้อฟกช้ํา หลังเกิดเหตุประมาณ 24-48 ชั่วโมง',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: ['ภาพเอกซเรย์ เพื่อแยกกับภาวะอื่นๆ เช่น กระดูกหัก'],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พักการใช้งาน',
          'ประคบเย็น 10-15 นาที เพื่อลดอาการปวด',
          'ใช้ผ้ายืดพันรอบ',
          'ยกขาสูง',
          'หลังจากหายอาการปวดและบวม ให้ทํากายบริหาร',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'มีการบาดเจ็บอย่างรุนแรง',
          'มีการขาดของกล้ามเนื้อทั้งมัด',
          'มีก้อนเลือดออกในชั้นกล้ามเนื้อขนาดใหญ่',
        ],
      },
    ],
  },
  muscleCramp: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'กล้ามเนื้อหดเกร็งและมีอาการปวดเกิดขึ้นอย่างรวดเร็ว',
          'อาการหายไปในเวลาไม่นาน',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: ['โดยปกติ ไม่จําเป็นต้องตรวจเพิ่มเติม'],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พยายามนวดและยืดกล้ามเนื้อ',
          'ประคบด้วยความร้อน',
          'อบอุ่นร่างกาย ยืดกล้ามเนื้อก่อนออกกําลังกาย',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: ['ไม่จําเป็นต้องได้รับการผ่าตัด'],
      },
    ],
  },

  shuolderMenu: [
    {
      title: 'ข้อไหล่หลุด \n(Shoulder dislocation)',
      value: 'sports-should-dislocation',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'กระดูกหัก (Fracture)',
      value: 'sports-should-shFracture',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'เอ็นกล้ามเนื้อ Bicep อักเสบ \n(Bicipital tendinitis)',
      value: 'sports-should-shBicipitalTendinitis',
      bColor: '#a2a7bb',
      bgColor: '#cdced3',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'ถุงน้ำที่หัวไหล่อักเสบ \n(Subacromial bursitis)',
      value: 'sports-should-shSubacromialBursitis',
      bColor: '#26a872',
      bgColor: '#88c2aa',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'กระดูกอ่อนลาบรัมฉีกขาด \n(Glenoid labrum tear)',
      value: 'sports-should-shGlenoidLabrumTear',
      bColor: '#9B59B6',
      bgColor: '#D7BDE2',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'เอ็นกล้ามเนื้อหุ้มข้อไหล่ขาด \n(Rotator cuff tear)​',
      value: 'sports-should-shRotatorCuffTear',
      bColor: '#DC7633',
      bgColor: '#F0B27A',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  //** NOTE Muscle shoulder injury content */

  muscleShDislocation: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวด ชาที่ข้อไหล่',
          'ไหล่ดูผิดรูป',
          'ขยับข้อไหล่ไม่ได้',
          'เอื้อมมือไปแตะไหล่ด้านตรงข้ามไม่ได้',
          'มักต้องประคองแขนไว้ด้านข้างลําตัวหรือหน้าอก',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: [
          'ภาพเอกซเรย์',
          'เอกซเรย์คลื่นแม่เหล็กไฟฟ้า (MRI) ในกรณีที่แพทย์เห็นว่าจําเป็นต้องได้รับการผ่าตัด',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'ห้ามเคลื่อนไหวแขน อาจใช้ผ้าหรือหมอนรองระหว่างแขนและลําตัว',
          'ไม่ดันหรือจัดกระดูกเข้าที่ด้วยตนเอง',
          'รีบมาโรงพยาบาลเพื่อตรวจประเมินและดึงไหล่เข้าที่',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'ไหล่หลุดบ่อย 3-4 ครั้งขึ้นไป',
          'ไหล่หลุดครั้งแรกในนักกีฬา',
          'มีกระดูกบริเวณไหล่หักร่วมด้วย',
        ],
      },
    ],
  },
  muscleShFracture: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวด บวมบริเวณกระดูกหัก ปวดมากขึ้นเมื่อขยับ',
          'อาจมีผิดรูปของบริเวณที่กระดูกหัก',
          'อาจมีอาการชา กล้ามเนื้ออ่อนกําลังได้ ทั้งนี้ขึ้นกับบริเวณที่หัก',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: ['ภาพเอกซเรย์ เพื่อยืนยันการวินิจฉัย'],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'ไม่พยายามดึงกระดูกเข้าที่ด้วยตนเอง',
          'พยายามขยับส่วนที่หักให้น้อยที่สุด อาจหาไม้ดามหรือผ้าคล้องแขนไว้',
          'รีบไปพบแพทย์ที่โรงพยาบาล',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'การผ่าตัดมักขึ้นอยู่กับตําแหน่งลักษณะที่หัก',
          'การเชื่อมต่อของกระดูกหลังจากการจัดกระดูก',
          'การบาดเจ็บของเส้นเลือดและเส้นประสาท',
        ],
      },
    ],
  },
  muscleShBicipitalTendinitis: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวดที่ข้อไหล่ด้านหน้า',
          'ปวดมากขึ้นเมื่อยกแขนขณะหงายมือต้านกับแรง',
          'มีจุดกดเจ็บที่เอ็นกล้ามเนื้อ Bicep',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: [
          'ตรวจร่างกายเพิ่มเติมเพื่อยืนยันการวินิจฉัย ทั้งนี้ ไม่จําเป็นต้องตรวจโดยการถ่ายภาพรังสีเพิ่มเติม',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พักการใช้งานแขนข้างที่ปวด',
          'ประคบเย็นที่หัวไหล่เพื่อลดอาการปวด',
          'หลีกเลี่ยงการกดนวดแรงๆ',
          'ทานยาต้านการอักเสบ',
          'ทํากายภาพบําบัดเมื่ออาการปวดบวมลดลง',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: ['เอ็นกล้ามเนื้อ Bicep ขาด'],
      },
    ],
  },
  muscleShSubacromialBursitis: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวดบริเวณหัวไหล่ โดยเฉพาะเมื่อกางแขน งอข้อศอกและหมุนไหล่เข้าด้านใน',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: [
          'ตรวจร่างกายเพิ่มเติมเพื่อยืนยันการวินิจฉัย ทั้งนี้ ไม่จําเป็นต้องตรวจโดยการถ่ายภาพรังสีเพิ่มเติม',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พักการใช้งาน',
          'ประคบเย็นที่ไหล่',
          'ทานยาต้านการอักเสบ',
          'เมื่ออาการปวดดีขึ้น ให้ฝึกกายบริหารเพื่อฝึกกําลังและยืดกล้ามเนื้อไหล่',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: ['เมื่อมีอาการเรื้อรังเกิน 3-4 เดือน'],
      },
    ],
  },
  muscleShGlenoidLabrumTear: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวดข้อไหล่โดยเฉพาะเมื่อยกแขนขึ้นเหนือศีรษะและมีความเร็วในการตบ เขวี้ยง ขว้าง ลดลงขณะเล่นกีฬา',
          'อาจมีสะดุดในข้อไหล่ มีเสียง “ป๊อป” หรือ “คลิก” ในข้อไหล่หรือมีข้อไหล่ติด (locking)',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: ['เอกซเรย์คลื่นแม่เหล็กไฟฟ้า (MRI)'],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'ฝึกการเคลื่อนไหวข้อไหล่และกล้ามเนื้อรอบๆข้อไหล่',
          'ทานยาต้านการอักเสบเพื่อลดอาการปวดบวม',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: ['รักษาเบื้องต้นแล้วอาการไม่ดีขึ้น'],
      },
    ],
  },
  muscleShRotatorCuffTear: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวดข้อไหล่',
          'กล้ามเนื้อรอบข้อไหล่อ่อนกําลังลง ทําให้อาจมีปัญหาในการกางข้อไหล่หรือหมุนข้อไหล่ออกด้านนอก',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: ['ภาพเอกซเรย์', 'เอกซเรย์คลื่นแม่เหล็กไฟฟ้า (MRI)'],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พักการใช้งาน',
          'ออกกําลังเพื่อให้มีพิสัยการเคลื่อนไหวของข้อไหล่',
          'ถ้าอาการปวดดีขึ้น ให้ออกกําลังเพื่อเสริมสร้างกล้ามเนื้อหุ้มข้อไหล่',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'รักษาเบื้องต้นแล้วอาการไม่ดีขึ้น',
          'มีการฉีกขาดของเอ็นกล้ามเนื้อหุ้มข้อไหล่มาก',
        ],
      },
    ],
  },

  kneeMenu: [
    {
      title: 'เอ็นไขว้ข้อเข่าบาดเจ็บ \n(Cruciate ligament injury)',
      value: 'sports-knee-knCruciateLigament',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'หมอนข้อเข่าบาดเจ็บ \n(Meniscal injury)​',
      value: 'sports-knee-knMeniscal',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'ข้อเข่าเคลื่อน \n(Knee dislocation)​',
      value: 'sports-knee-knDislocation',
      bColor: '#a2a7bb',
      bgColor: '#cdced3',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'กระดูกแข้งหัก \n(Tibia or fibula fracture)​',
      value: 'sports-knee-knTibiaOrFibulaFracture',
      bColor: '#26a872',
      bgColor: '#88c2aa',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  //** NOTE Muscle knee injury content */

  muscleKnCruciateLigament: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวดข้อเข่าทันทีหลังเกิดอุบัติเหตุ',
          'อาจปวดมากเมื่อบิดเข่า เหยียดงอเข่า ลงจากที่สูง',
          'ลงน้ําหนักแล้วปวดมาก',
          'บวมที่ข้อเข่าหลังเกิดเหตุ 12-24 ชั่วโมง',
          'อาจมีรอยห้อเลือดที่ข้อเข่า',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: [
          'ภาพเอกซเรย์ เพื่อแยกกับภาวะอื่นๆ เช่น กระดูกหัก',
          'เอกซเรย์คลื่นแม่เหล็กไฟฟ้า (MRI)',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พักการใช้งาน งดการเล่นกีฬาหรือกิจกรรมที่ต้องใช้เข่ามาก',
          'ทานยาต้านอักเสบ',
          'หลังอาการปวดบวมลดลง ให้ฝึกบริหารกล้ามเนื้อรอบเข่าเพื่อเพิ่มความแข็งแรง',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'อายุน้อย ต้องใช้เข่ามาก',
          'นักกีฬา',
          'ข้อเข่าไม่มั่นคง',
          'มีเอ็นหรือหมอนรองข้อเข่าฉีกขาดร่วมด้วย',
        ],
      },
    ],
  },
  muscleKnMeniscal: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวด บวมที่เข่า โดยมักเป็นหลังจากการบิดของเข่า',
          'กดเจ็บที่ข้อเข่า',
          'อาจมีอาการเข่าล็อก เหยียดเข่าไม่ได้ มีเสียง “คลิก” ในเข่าขณะเคลื่อนไหว',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: ['ภาพเอกซเรย์', 'เอกซเรย์คลื่นแม่เหล็กไฟฟ้า (MRI)'],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'ยาต้านอักเสบ เพื่อลดอาการปวด บวม',
          'พักการใช้งาน งดการเล่นกีฬาหรือกิจกรรมที่ต้องใช้เข่ามาก',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: ['โดยส่วนใหญ่จําเป็นต้องได้รับการรักษาด้วยการผ่าตัดส่องกล้อง'],
      },
    ],
  },
  muscleKnDislocation: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ข้อเข่าผิดรูปจากเดิม',
          'ปวด บวมเข่ามาก',
          'เคลื่อนไหวข้อเข่าได้ลดลงหรือไม่ได้',
          'อาจมีอาการจากการบาดเจ็บของเส้นเลือด เส้นประสาท เช่น ซีดลง เย็น ชา',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: [
          'ภาพเอกซเรย์เข่า เพื่อหาภาวะที่อาจเกิดร่วมกัน เช่น กระดูกหัก',
          'เอกซเรย์คลื่นแม่เหล็กไฟฟ้า (MRI)',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'ไม่พยายามดึงหรือจัดกระดูกให้เข้าที่ด้วยตนเอง',
          'ให้ใช้ผ้าพยุงหรือหาไม้ดาม เพื่อให้เข่าเคลื่อนไหวน้อยที่สุด',
          'รีบมาโรงพยาบาลให้เร็วมากที่สุด  เนื่องจากเป็นภาวะฉุกเฉิน',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'ดึงจัดกระดูกไม่สําเร็จ',
          'มีการบาดเจ็บของหลอดเลือดร่วมด้วย',
          'มีกระดูกหักแบบแผลเปิด',
          'ได้รับบาดเจ็บหลายแห่ง',
        ],
      },
    ],
  },
  muscleKnTibiaOrFibulaFracture: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวด บวมบริเวณที่กระดูกหักมาก',
          'อาจไม่สามารถเคลื่อนไหวบริเวณที่หักได้',
          'อาจมีขาผิดรูป โก่งงอ',
          'อาจมีแผลเปิด เห็นกระดูกทิ่มออกมาจากแผล',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: ['ภาพเอกซเรย์ เพื่อยืนยันการวินิจฉัย'],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'ไม่พยายามดึงหรือจัดกระดูกให้เข้าที่ด้วยตนเอง',
          'ให้ใช้ผ้าพยุงหรือหาไม้ดาม เพื่อให้เข่าเคลื่อนไหวน้อยที่สุด',
          'รีบมาโรงพยาบาลให้เร็วมากที่สุด  เนื่องจากเป็นภาวะฉุกเฉิน',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'กระดูกหักแผลเปิด (Open fracture)',
          'ดึงจัดกระดูกไม่สําเร็จ',
          'มีการบาดเจ็บต่อเส้นประสาท เส้นเลือด',
          'ได้รับบาดเจ็บหลายแห่ง',
        ],
      },
    ],
  },

  footMenu: [
    {
      title: 'กระดูกเท้าหัก \n(Fracture)​',
      value: 'sports-foot-ftFracture',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'เอ็นกระดูกเท้าบาดเจ็บ \n(Lisfranc injury)​',
      value: 'sports-foot-ftLisfranc',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  //** NOTE Muscle foot injury content */

  muscleFtFracture: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวด บวม มีจุดกดเจ็บตรงบริเวณที่กระดูกหัก',
          'ปวดมากขึ้นเมื่อขยับหรือลงน้ำหนัก',
          'อาจมีห้อเลือดบริเวณที่หัก',
          'อาจมีเท้าผิดรูป',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: ['ภาพเอกซเรย์เพื่อยืนยันการวินิจฉัย'],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'ไม่พยายามดึงหรือจัดกระดูกให้เข้าที่ด้วยตนเอง',
          'ให้หาไม้ดาม เพื่อให้เคลื่อนไหวน้อยที่สุด',
          'รีบมาโรงพยาบาลหากสงสัยว่ามีกระดูกหัก',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'กระดูกหักเคลื่อนมากหรือไม่มั่นคง',
          'มีกระดูกหักแบบแผลเปิด',
          'มีกระดูกหักหลายแห่ง',
        ],
      },
    ],
  },

  muscleftLisfranc: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวด บวม กดเจ็บบริเวณกลางเท้า',
          'ปวดมากขึ้นเมื่อขยับหรือลงน้ำหนัก',
          'อาจมีรอยช้ำบริเวณหลังเท้าที่มีการบาดเจ็บ',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: [
          'ภาพเอกซเรย์เข่า เพื่อหาภาวะที่อาจเกิดร่วมกัน เช่น กระดูกหัก',
          'เอกซเรย์คลื่นแม่เหล็กไฟฟ้า (MRI)',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พักการใช้งานข้อเท้า',
          'ประคบข้อเท้าด้วยน้ําแข็ง 15-20 นาที 3-5 ครั้งต่อวัน',
          'ใช้ผ้ายืด (elastic bandage) พันข้อเท้า',
          'นอนยกขาสูง เพื่อลดบวม',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'เมื่อมีการฉีกขาดของเอ็นรอบข้อเท้ารุนแรงที่ไม่ตอบสนองต่อการรักษาแบบไม่ผ่าตัด',
          'นักกีฬาอาชีพ',
        ],
      },
    ],
  },

  ankleMenu: [
    {
      title: `ข้อเท้าแพลง \n(Ankle sprain)​`,
      value: 'sports-ankle-anSprain',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'กระดูกข้อเท้าหัก \n(Fracture)​',
      value: 'sports-ankle-anFracture',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],
  //** NOTE Muscle ankel injury content */

  muscleAnSprain: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวด บวมที่ข้อเท้า',
          'มีจุดกดเจ็บที่ปุ่มกระดูกตาตุ่ม',
          'เคลื่อนไหวข้อเท้าได้ลดลง',
          'อาจลงน้ําหนักไม่ได้',
          'อาจมีห้อเลือดบริเวณใกล้เคียงตาตุ่ม',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: [
          'ภาพเอกซเรย์ เพื่อแยกภาวะอื่น  เช่น กระดูกหัก',
          'เอกซเรย์คลื่นแม่เหล็กไฟฟ้า (MRI) กรณีสงสัยว่ามีการฉีกขาดของเอ็น',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'ป้องกันการบาดเจ็บเพิ่มเติม เช่น งดใส่รองเท้าส้นสูง เลี่ยงยืนหรือเดินนาน',
          'พักการใช้งานข้อเท้า',
          'ประคบข้อเท้าด้วยน้ําแข็ง 15-20 นาที 3-5 ครั้งต่อวัน',
          'ใช้ผ้ายืด (elastic bandage) พันข้อเท้า',
          'นอนยกขาสูง เพื่อลดบวม',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'เมื่อมีการฉีกขาดของเอ็นรอบข้อเท้ารุนแรงที่ไม่ตอบสนองต่อการรักษาแบบไม่ผ่าตัด',
          'นักกีฬาอาชีพ',
        ],
      },
    ],
  },

  muscleAnFracture: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวดบวมข้อเท้ามาก',
          'เดินลงน้ำหนักไม่ได้',
          'อาจมีข้อเท้าผิดรูป',
          'อาจมีกดเจ็บบริเวณที่กระดูกหัก โดยมักเป็นบริเวณตาตุ่มด้านนอก',
        ],
      },
      {
        title: 'ตรวจเพิ่มเติม',
        desc: ['ภาพเอกซเรย์ เพื่อยืนยันการวินิจฉัย'],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'ไม่พยายามดึงหรือจัดกระดูกให้เข้าที่ด้วยตนเอง',
          'ให้หาไม้ดาม เพื่อให้ข้อเท้าเคลื่อนไหวน้อยที่สุด',
          'รีบมาโรงพยาบาลหากสงสัยว่ามีกระดูกหัก',
        ],
      },
      {
        title: 'กรณีผ่าตัด',
        desc: [
          'กระดูกหักแบบเคลื่อนหรือไม่เสถียร',
          'กระดูกหักแบบแผลเปิด',
          'ดึงจัดกระดูกไม่สําเร็จ',
          'มีการบาดเจ็บของหลอดเลือดร่วมด้วย',
          'ได้รับบาดเจ็บหลายแห่ง',
        ],
      },
    ],
  },

  runningFaqMenu: [
    {
      title: 'วิ่งแบบไหนหนักพอดี?',
      value: 'sports-running-qa1',
      normal: true,
      expand: false,
      description: [
        'วิ่งด้วยความหนักและความเร็วที่พอดี โดยอาจดูความหนักจากขณะวิ่ง สามารถพูดเป็นประโยคความยาวประมาณ 4-5 คําได้ ซึ่งถือเป็นความหนักในระดับออกกําลังเพื่อสุขภาพ',
      ],
    },
    {
      title: 'บาดเจ็บจากการวิ่งต้องพักนานแค่ไหน?',
      value: 'sports-running-qa2',
      normal: true,
      expand: false,
      description: [
        'ขึ้นอยู่กับการบาดเจ็บ เช่น การบาดเจ็บจากกระดูกหัก อาจต้องพักนานกว่าการบาดเจ็บจากกล้ามเนื้อบาดเจ็บ',
        'ทั้งนี้ แม้ไม่มีการบาดเจ็บ แต่ก็ควรมีช่วงเวลาพัก เพื่อเว้นระยะให้ร่างกายได้ซ่อมแซมส่วนที่บาดเจ็บเล็กน้อยจากการวิ่ง',
      ],
    },
    {
      title: 'มีโรคประจําตัวสามารถวิ่งได้หรือไม่?',
      value: 'sports-running-qa3',
      normal: true,
      expand: false,
      description: [
        'ขึ้นกับโรคประจําตัว ทั้งนี้ ควรปรึกษาแพทย์ที่ดูแลก่อนออกกําลังกาย และหากออกกําลังกายแล้วมีอาการผิดปกติ ควรหยุดออกกําลังกายและปรึกษาแพทย์',
      ],
    },
    {
      title: 'ยี่ห้อรองเท้ามีผลต่อการวิ่งหรือไม่?',
      value: 'sports-running-qa4',
      normal: true,
      expand: false,
      description: [
        'รองเท้าแต่ละลักษณะมีผลต่อแต่ละคนต่างกันไป ทั้งนี้ขึ้นกับการเลือกรองเท้าอย่างเหมาะสมกับลักษณะเท้าและลักษณะการวิ่งของตนเอง',
      ],
    },
    {
      title: 'วิ่งเพื่อเผาผลาญไขมัน ต้องทําอย่างไร?',
      value: 'sports-running-qa5',
      normal: true,
      expand: false,
      description: [
        'วิ่งด้วยความหนักประมาณ 60-70% ของอัตราการเต้นหัวใจสูงสุด (อัตราการเต้นหัวใจสูงสุด = 220 - อายุ) และเหนื่อยในระดับที่ยังสามารถพูดเป็นประโยคได้ปกติ',
        'ควรวิ่งครั้งละ 30-60 นาที สัปดาห์ละ 3-5 วัน',
        'ออกกําลังกายควบคู่ไปกับการควบคุมและเลือกทานอาหารอย่างเหมาะสม',
      ],
    },
    {
      title: 'การดื่มน้ำกับการวิ่ง?',
      value: 'sports-running-qa6',
      normal: true,
      expand: false,
      description: [
        'ควรดื่มน้ำก่อนออกกําลังกายประมาณ 30 นาทีและอาจจิบครั้งละน้อยๆ ทุก 15-20 นาที',
        'หากต้องวิ่งระยะไกลหรือเสียเหงื่อมาก อาจดื่มน้ำเปล่าสลับน้ำเกลือแร่',
      ],
    },
    {
      title: 'อาการที่ควรหยุดวิ่งทันที?',
      value: 'sports-running-qa7',
      normal: true,
      expand: false,
      description: [
        'เจ็บหน้าอก วิงเวียน หน้ามืด หายใจไม่ออก เนื่องจากเป็นอาการที่ทําให้นึกถึงภาวะหัวใจวายได้ โดยหากมีอาการดังนี้ ควรหยุดออกกําลังกายและพบแพทย์เพื่อตรวจประเมินอย่างเหมาะสมต่อไป',
      ],
    },
    {
      title: 'การฝึกกล้ามเนื้อเพื่อป้องกันอาการบาดเจ็บจากการวิ่ง?',
      value: 'sports-running-qa8',
      normal: true,
      expand: false,
      description: [
        'เขย่งปลายเท้า (Heel Raise) โดยเขย่งปลายเท้าขึ้นจนสุดแเล้วค่อยๆวางส้นเท้าลงพื้นดังเดิม ทําซ้ำ 20 ครั้ง วันละ 2-3 ครั้ง',
        'กางขาออกด้านข้างลําตัว (Hip abduction exercise) ยืนตรง ยกขาออกทางด้านข้างลําตัวช้าๆจนสุด จากนั้นหุบขาเข้ามาช้าๆ ทําซ้ำ 20 ครั้ง วันละ 2-3 ครั้ง',
        'เกร็งหน้าท้องและลําตัว (Plank) นอนคว่ำ ตั้งศอกขึ้น ยกลําตัวขึ้นให้ขนานกับพื้น เกร็งค้างไว้นานเท่าที่ทําได้',
        'ท่าสะพาน (Bridge) นอนหงาย ชันเข่าให้ระยะเท่าสะโพก กดเท้าไว้กับพื้นแล้วยกสะโพกขึ้นช้าๆแล้วลดลง ทําซ้ำ 20 ครั้ง วันละ 2-3 ครั้ง',
        'ก้าวย่อทีละข้าง (Lunges) โดยก้าวขาไปข้างหน้าหนึ่งข้าง จากนั้นย่อเข่าลงให้เข่าของขาข้างหลังแตะพื้น ค้างไว้แล้วทําซ้ำ 20 ครั้ง วันละ 2-3 ครั้ง',
      ],
    },
    {
      title: 'การบาดเจ็บที่พบได้บ่อย?',
      value: 'sports-running-qa9',
      option: true,
      expand: false,
      description: [
        {
          title:
            'โรคข้อเข่านักวิ่ง \n(Runner’s knee or Patellofemoral pain syndrome)',
          content: [
            'ปวดเข่าบริเวณด้านหน้า รอบๆสะบ้า ปวดมากขึ้นเมื่อนั่งยอง นั่งนานๆ วิ่ง',
            'หลีกเลี่ยงท่าทางหรือกิจกรรมที่ทําให้มีอาการปวดร่วมกับอาจประคบเย็นเพื่อลดอาการปวดและทานยาต้านอักเสบและทํากายภาพบําบัดเมื่ออาการปวดดีขึ้น',
          ],
        },
        {
          title: 'เอ็นต้นขาด้านข้างอักเสบ \n(Iliotibial band syndrome)',
          content: [
            'ปวดบริเวณเข่าด้านนอก เป็นมากขณะวิ่งหรือขณะเข่าตึง',
            'พักการใช้งาน ประคบเย็น 10-15 นาทีเพื่อลดอาการปวดร่วมกับทานยาต้านอักเสบละทํากายภาพบําบัดเมื่ออาการปวดดีขึ้น',
          ],
        },
        {
          title: 'กล้ามเนื้อแฮมสตริงบาดเจ็บ \n(Hamstring injury)',
          content: [
            'ปวดใต้ข้อพับเข่าหรือต้นขาด้านหลังอย่างรวดเร็วขณะวิ่ง',
            'พักการใช้งาน ประคบเย็น 10-15 นาทีเพื่อลดอาการปวดร่วมกับทานยาต้านอักเสบละทํากายภาพบําบัดเมื่ออาการปวดดีขึ้น',
          ],
        },
        {
          title: 'โรครองช้ำ \n(Plantar fasciitis)',
          content: [
            'ปวดแปล๊บๆส้นเท้าเวลาลงน้ําหนัก โดยมักปวดในก้าวแรกของวันหรือตอนยืนนานๆ',
            'ลดการใช้งาน ประคบเย็นและทานยาต้านการอักเสบ ร่วมกับบริหารยืดพังผืดใต้เท้าและกล้ามเนื้อน่อง',
          ],
        },
        {
          title: 'ข้อเท้าแพลง \n(Ankle sprain)',
          content: [
            'ปวด บวมที่ข้อเท้า มีจุดกดเจ็บที่ปุ่มกระดูกตาตุ่ม เคลื่อนไหวข้อเท้าได้ลดลง อาจลงน้ําหนักไม่ได้และอาจมีห้อเลือดบริเวณใกล้เคียงตาตุ่ม',
            'ป้องกันการบาดเจ็บเพิ่มเติม เช่น งดใส่รองเท้าส้นสูง เลี่ยงยืนหรือเดินนาน พักการใช้งานข้อเท้า ประคบข้อเท้าด้วยน้ําแข็ง 15-20 นาที 3-5 ครั้งต่อวันหรือใช้ผ้ายืด(elastic bandage) พันข้อเท้าและนอนยกขาสูง เพื่อลดบวม',
          ],
        },
        {
          title: 'ตะคริว \n(Muscle cramping)',
          content: [
            'กล้ามเนื้อหดเกร็งและมีอาการปวดเกิดขึ้นอย่างรวดเร็วอาการหายไปในเวลาไม่นาน',
            'พยายามนวดและยืดกล้ามเนื้อ ประคบด้วยความร้อน อบอุ่นร่างกาย ยืดกล้ามเนื้อก่อนออกกําลังกาย',
          ],
        },
      ],
    },
  ],
};
