export const DATA_CHILD_ORTHO = {
  selfcheckQuestions: [
    { id: 0, name: 'ประวัติแรกคลอด/โรคประจําตัว' },
    { id: 1, name: 'ประวัติการเจ็บป่วยหรืออุบัติเหตุ' },
    {
      id: 2,
      name:
        'อาการร่วมต่างๆ เช่น ไข้ ปวดบริเวณกระดูกหรือข้อ ลักษณะและระยะเวลาของอาการนั้นๆ',
    },
    { id: 3, name: 'ผลกระทบต่อการใช้ชีวิตประจําวัน' },
    { id: 4, name: 'การรักษาก่อนหน้านี้ด้วยวิธีหรือยาต่างๆ' },
  ],

  mainMenuChild: [
    {
      title: 'คำถามก่อนมาพบแพทย์',
      value: 'childs-question',
      bColor: '#DC7633',
      bgColor: '#F0B27A',
      fColor: '#000000',
    },
    {
      title: 'สาเหตุที่พบบ่อย',
      value: 'childs-cause',
      bColor: '#27AE60',
      bgColor: '#ABEBC6',
      fColor: '#000000',
    },
  ],

  subMenuChild: [
    {
      title: 'การติดเชื้อ',
      value: 'childs-infected',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
    },
    {
      title: 'ความผิดรูป',
      value: 'childs-deformed',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  infectedMenu: [
    {
      title: 'โรคกระดูกอักเสบติดเชื้อ \n(Osteomyelitis)',
      value: 'childs-infected-inflam',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'โรคติดเชื้อในข้อ \n(Septic arthritis)',
      value: 'childs-infected-joint',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  infectedInflam: [
    {
      title: 'คืออะไร?',
      value: 'childs-infected-inflam-qa1',
      normal: true,
      expand: false,
      description: [
        'การติดเชื้อของกระดูกและไขกระดูกโดยเชื้อโรค ก่อให้เกิดการอักเสบและการทําลายกระดูกอย่างต่อเนื่อง อาจนําไปสู่ภาวะกระดูกขาดเลือดและการสร้างกระดูกใหม่',
      ],
    },
    {
      title: 'พยาธิกําเนิด',
      value: 'childs-infected-inflam-qa2',
      normal: true,
      expand: false,
      description: [
        'เนื่องจากกระดูกมีความต้านทานการติดเชื้อได้สูง ดังนั้นการติดเชื้อจึงเกิดจากการที่กระดูก สัมผัสกับแบคทีเรียปริมาณมาก หรือมีการบาดเจ็บของกระดูก หรือจากการมีสิ่งแปลกปลอมอยู่ด้วย โดยเชื้อก่อโรคที่พบมากที่สุดคือ Staphylococcus aureus ที่ซึ่งสามารถสร้างโปรตีนเพื่อยึดติดกระดูกและสารเมือก เพื่อเป็นถุงหุ้มให้เชื้อหลบหลีกจากระบบภูมิคุ้มกันและยาฆ่าเชื้อ โดยกระดูกอักเสบติดเชื้อในเด็กมักเกิดขึ้น ตามหลังสภาวะการติดเชื้อในกระแสเลือด จึงทําให้พบการติดเชื้อบริเวณ metaphysis ของกระดูก long bone ที่ซึ่งเป็นบริเวณที่มีเลือดมาเลี้ยงมากและเป็นบริเวณที่มีการวกกลับของหลอดเลือดฝอย',
      ],
    },
    {
      title: 'อาการแสดง',
      value: 'childs-infected-inflam-qa3',
      normal: true,
      expand: false,
      description: [
        'ไข้สูง หนาวสั่น ปวดเมื่อยตามตัว และปวดบวมในตําแหน่งที่มีการติดเชื้อ เจ็บกระดูกส่วน เมแทไฟซิส (metaphysis)',
      ],
    },
    {
      title: 'การวินิจฉัย',
      value: 'childs-infected-inflam-qa4',
      normal: true,
      expand: false,
      description: [
        'การพบเชื้อเป็นการวินิจฉัยที่ดีและมีความจําเพาะเจาะจงที่สุด โดยอาจได้จากการตัดชิ้นเนื้อ หรือนําสิ่งคัดหลั่งที่ได้จากการเจาะดูดไปเพาะเชื้อและหาความไวต่อยา นอกจากนี้ยังสามารถร่วมวินิจฉัยจาก การวิเคราะห์ผลเลือดทางห้องปฏิบัติการ โดยการตรวจเลือด (CBC) พบว่า มีเม็ดเลือดขาวสูงกว่าปกติ อัตรา เม็ดเลือดแดงนอนก้น (ESR) เพิ่มขึ้นผิดปกติ ยกเว้นในทารกจะไม่พบสิ่งเหล่านี้ การตรวจโปรตีนของเลือด  (CRP) สูง และการเพาะเชื้อจากเลือด แต่ส่วนใหญ่ไม่พบเชื้อโรค โดยเฉพาะในกลุ่มกระดูกอักเสบติดเชื้อทาง เลือดแบบเฉียบพลัน (acute hemotogenous osteomyelitis) กลุ่มนี้หากดูภาพรังสีจะปกติ ถ้ากระดูกมีการ สร้างกระดูกใหม่ที่เรียกว่า อินโวลูครัม (involucrum) จะจัดเป็นกลุ่มเรื้อรัง (chronic osteomyelitis) ซึ่งกลุ่ม นี้พบมีการตายของกระดูกที่เรียกว่า ซีเควสตรัม (sequestrum) ส่วนอีกกลุ่มหนึ่งเรียกว่า กระดูกอักเสบติดเชื้อ ทางเลือดต่ํากว่าเฉียบพลัน (subacute haemotogenous osteomyelitis) อาการจะน้อยกว่า และเมื่อ วินิจฉัยด้วยภาพรังสีพบว่า เกิดโพรงหนองที่กระดูก',
      ],
    },
    {
      title: 'การรักษา',
      value: 'childs-infected-inflam-qa5',
      normal: true,
      expand: false,
      description: [
        'การให้ยาฆ่าเชื้อโรค (antibiotics) ทางหลอดเลือดดําและตามด้วยยาฆ่าเชื้อโรคแบบ รับประทานได้ โดยไม่จําเป็นต้องผ่าตัด แต่ถ้าการดําเนินโรครุนแรงและเร็ว ให้ยาแล้วแต่ไม่ได้ผลใน ๑ วัน หรือ เจาะพบหนอง การรักษาจําเป็นต้องทําการผ่าตัด เปิดให้หนองระบายออกจากกระดูก ร่วมกับให้ยาฆ่าเชื้อโรค ทางหลอดเลือดดํา และตามด้วยยาฆ่าเชื้อโรคแบบรับประทาน',
      ],
    },
  ],

  infectedJoint: [
    {
      title: 'การวินิจฉัย',
      value: 'childs-infected-joint-qa1',
      normal: true,
      expand: false,
      description: [
        'จากการซักประวัติและตรวจร่างกาย การเจาะข้อเพื่อตรวจหาหนองเป็นสิ่งจําเป็นมาก การ ส่งย้อมเชื้อ เพาะเชื้อ อาจพบเชื้อได้ประมาณร้อยละ ๕๐',
      ],
    },
    {
      title: 'การรักษา',
      value: 'childs-infected-joint-qa2',
      normal: true,
      expand: false,
      description: [
        'ต้องทําการผ่าตัดระบายหนองออกมาจากข้อ ร่วมกับการให้ยาฆ่าเชื้อโรคทางหลอดเลือดดํา การเข้าเฝือกเพื่อพักข้อที่อักเสบ และการรักษาในภายหลังถ้ามีปัญหาเพิ่มเติม',
      ],
    },
  ],

  menuDeformed: [
    {
      title: 'คอ (ในเด็ก)',
      value: 'childs-deformed-neck',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'หลัง (ในเด็ก)',
      value: 'childs-deformed-back',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'ศอก (ในเด็ก)',
      value: 'childs-deformed-elbow',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'สะโพก (ในเด็ก)',
      value: 'childs-deformed-hip',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'เข่า (ในเด็ก)',
      value: 'childs-deformed-knee',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'เท้า (ในเด็ก)',
      value: 'childs-deformed-foot',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'นิ้ว (ในเด็ก)',
      value: 'childs-deformed-finger',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  /** NOTE คอ */

  childsTorticollis: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'เกิดขึ้นจากการที่กล้ามเนื้อสเตอร์โนไคลโดมาสตอยด์(sternocleidomastoid) ที่คอตึงตัว อาจเกิดเป็นเนื้อเยื่อแผลเป็นตั้งแต่เด็กทารก กล้ามเนื้อนี้อยู่ ๒ ข้างของลําคอ ถ้าด้านซ้ายตึง คอจะเอียงลง ทางด้านซ้าย หน้าจะหันไปทางขวา เห็นกล้ามเนื้อตึงเป็นลําชัดเจน ควรตรวจแยกโรคกระดูกคอเอียงที่เกิดจาก สาเหตุอื่น เช่น กระดูกคอที่ ๑ และที่ ๒ เคลื่อน ซึ่งการหมุนคอจะติดขัดและหมุนไปมาไม่ได้โดยที่กล้ามเนื้อไม่ตึง หรือตรวจสายตาที่อาจจะเอียงหรือเหล่ทําให้คอเอียง',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-neck.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          'ในเด็กเล็กควรแนะนําการดัด เพื่อให้ศีรษะหันไปด้านตรงข้ามและหันหน้าให้มาด้านเดียวกับ ด้านที่เป็น เมื่ออายุมากขึ้น เช่น อายุ ๑-๔ ปีขึ้นไป ควรผ่าตัดเอาเอ็นคอที่ตึงออก',
        ],
      },
    ],
  },

  /** NOTE หลัง */

  menuDeformedBack: [
    {
      title: 'โรคหลังคด (Scoliosis)',
      value: 'childs-deformed-back-scoliosis',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'โรคหลังค่อม (Kyphosis)',
      value: 'childs-deformed-back-kyphosis',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'โรคหลังแอ่น (Lordosis)',
      value: 'childs-deformed-elbow-lordosis',
      bColor: '#a2a7bb',
      bgColor: '#cdced3',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  childsScoliosis: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'โดยการตรวจร่างกาย พบว่าเมื่อก้มจะเห็นหลังนูนไม่เท่ากัน และด้วยการใช้ภาพรังสีแผ่นยาวของกระดูกสันหลังทั้งหมดด้านหน้า ซึ่งโดยปกติการจะเรียกว่ามีกระดูกสันหลังคดนั้นต้องวัดจากมุมที่กระดูก สันหลังที่เรียกว่า มุมคอบบ์(Cobb angle) จะได้มากกว่า ๑๐ องศา เป็นโรคกระดูกสันหลังคดที่พบบ่อยที่สุด แบ่งออกเป็น ๓ กลุ่ม คือ',
          '๑) เกิดในช่วง ๓ ปีแรก (congenital scoliosis)',
          '๒) เกิดในช่วง ๓-๑๐ ปี (early onset scoliosis)',
          '๓) เกิดในช่วงหลังอายุ ๑๐-๒๐ ปี(adolescent idiopathic scoliosis) ซึ่งเป็นกลุ่มที่พบบ่อยที่สุดโดยพบในเพศหญิงมากกว่าเพศชาย',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-back-1.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          '๑. อนุรักษ์นิยม คือ การรักษาโดยวิธีไม่ต้องผ่าตัด โดยมากจะใช้วิธีนี้ในกรณีที่คดไม่มากและผู้ป่วยยังเด็กอยู่ วิธีที่พิสูจน์แล้วว่าได้ผลคือ การใส่อุปกรณ์ประคองกระดูกสันหลัง (brace หรือ spinal orthosis) ส่วนวิธีอื่นๆ เช่น การจัดกระดูก การออกกําลังกาย กายบริหารท่าต่างๆ การใช้กระแสไฟฟ้าหรือเครื่องมืออื่นๆ กระตุ้น กล้ามเนื้อ ส่วนการนวดยังไม่มีการศึกษาใดที่บ่งบอกว่ามีประสิทธิภาพในการรักษาความผิดรูปของกระดูกสันหลัง',
          '๒. การรักษาโดยการผ่าตัด มักทําการผ่าตัดในกรณีที่กระดูกสันหลังคดมาก ซึ่งโดยทั่วไปจะมากกว่า ๔๐-๔๕ องศา การผ่าตัดสามารถผ่าได้ทั้งข้างหน้าและข้างหลัง ปัจจุบันมักผ่าตัดโดยการใส่เหล็กยึดตรึงกระดูกแก้ไขทางด้านหลัง',
        ],
      },
    ],
  },

  childsKyphosis: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'การซักประวัติตรวจร่างกายและภาพรังสีแยกโรค พบว่า เกิดจากหลายสาเหตุ เช่น จาก บุคลิกท่าทางการยืนการนั่ง จากกระดูกสันหลังผิดรูปแต่กําเนิด จากโรคของกล้ามเนื้อและระบบประสาท เช่น โรคโปลิโอ โรคสมองพิการ โรคกล้ามเนื้อเสื่อมสภาพ โรคกระดูกนิ่ม (osteogenesis imperfecta) โรคกระดูก ติดเชื้อ ได้แก่ วัณโรคกระดูกสันหลัง โรคเนื้องอกในกระดูก โรคเนื้อเยื่อเกี่ยวพัน และโรคชอยเออร์มันน์ (Scheuermann’s disease)',
        ],
      },
      {
        title: 'การรักษา',
        desc: [
          'การรักษาแบ่งออกเป็นวิธีไม่ผ่าตัด และผ่าตัดตามสาเหตุที่วิเคราะห์ได้ บางสาเหตุเป็นการ รักษาแบบประคับประคอง เช่น จากโรคสมองพิการ โรคกล้ามเนื้อเสื่อมสภาพ โรคกระดูกนิ่ม บางสาเหตุ สามารถรักษาให้หายได้ เช่น โรคกระดูกติดเชื้อ',
        ],
      },
    ],
  },

  childsLordosis: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'การซักประวัติและการตรวจร่างกายและภาพรังสีแยกโรค พบว่า เกิดได้จากหลายสาเหตุ เช่น จากบุคลิกท่าทางและความแข็งแรงของกล้ามเนื้อหน้าท้อง การมีภาวะน้ําหนักเกิน การได้รับบาดเจ็บหรือการ ผ่าตัด รวมถึงจากโรคในระบบกล้ามเนื้อและประสาท',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-back-2.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          'การรักษาแบ่งออกเป็นวิธีไม่ผ่าตัด และผ่าตัดตามสาเหตุที่วิเคราะห์ได้ บางสาเหตุเป็นการ รักษาแบบประคับประคอง',
        ],
      },
    ],
  },

  /** NOTE ศอก */

  childsCubitusVarusAndVulgus: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'การวินิจฉัยโรคนี้จะทําได้ก็ต่อเมื่อมีการเชื่อมติดกันของกระดูกต้นแขนที่แตกหักแล้ว เนื่องจากการตรวจวินิจฉัยทําเมื่อแขนสามารถยืดได้เต็มที่ โดยโรคแขนคอกจะตรวจพบว่า แขนยืดได้มุมมากกว่าปกติหรือแขนส่วนปลายมีการหมุนเข้าด้านใน ในขณะที่โรคข้อศอกชี้ออกด้านนอก อาจพบว่าแขนไม่สามารถยืดได้เป็นมุมตรง หรือแขนส่วนปลายมีการหมุนออกด้านนอก',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs_elbow.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          'โดยมากการรักษาทําเพื่อความสวยงามมากกว่าแก้ไขการทํางาน แต่ทั้งนี้มุมที่ผิดปกติสามารถ ส่งผลให้เกิดข้อจํากัดในการเคลื่อนไหวได้การรักษาโดยการสังเกตการณ์อาจทําได้ในผู้ป่วยที่อายุน้อยที่กระดูก ยังสามารถปรับคืนได้เอง หรือพิจารณาการรักษาโดยการผ่าตัดเพื่อปรับแก้มุมให้ใกล้เคียงปกติ',
        ],
      },
    ],
  },

  /** NOTE สะโพก */

  menuDeformedHip: [
    {
      title: 'โรคสะโพกหลุดหรือหลวม \n(Developmental dysplasia of the hip)',
      value: 'childs-deformed-hip-dysplasia',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'โรคหัวกระดูกสะโพกเคลื่อน \n(Slipped capital femoral epiphysis)',
      value: 'childs-deformed-hip-epiphysis',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  childsDevelopmentalHip: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'ในทารกแรกเกิดจนถึงอายุประมาณ ๖ เดือน ควรใช้วิธีการตรวจร่างกายที่เป็นมาตรฐาน คือ ใช้วิธีตรวจ โดยการดันสะโพกไปด้านหลังว่าหลุดหรือไม่ หรือกางขาว่าสะโพกที่หลุดเข้าที่หรือไม่อาจพบมีรอย ย่นของผิวหนังที่ขอบใน ของต้นขา ไม่เท่ากัน (asymmetric inguinal or thigh skin folds) ในรายที่ข้อ สะโพกหลุดข้างเดียว ข้างที่หลุด ข้อสะโพกจะกางได้น้อยลง ทําให้ใส่ผ้าอ้อมลําบาก อาจสังเกตเห็นขายาวไม่ เท่ากัน ซึ่งอาจใช้วิธีตรวจง่ายๆ คือ ในขณะที่เด็กนอนหงาย จับงอข้อสะโพกและชันเข่าขึ้น ๒ ข้างพร้อมๆ กัน ถ้าเข่าด้านใดด้านหนึ่งต่ำกว่า ให้สงสัยว่า อาจมีข้อสะโพกเคลื่อนหลุดได้เมื่ออายุเกิน ๖ เดือน หากดูจาก ภาพรังสีก็จะเห็นหัวกระดูกสะโพกได้ชัดเจน และเห็นได้ว่าหลุด ในเด็กโตที่กําลังหัดเดินหรือเดินได้แล้ว จะ พบว่าเดินกะเผลก ซึ่งในกรณีนี้ต้องแยกกับภาวะที่มีขายาวไม่เท่ากัน',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-hip-1.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          'หลักสําคัญในการรักษา คือ เมื่อวินิจฉัยได้จะเริ่มทําการรักษาทันทีเพื่อให้ข้อสะโพกกลับมา ใกล้เคียงภาวะปกติมากที่สุด ในเด็กเล็กที่อายุน้อยกว่า ๖ เดือน สามารถรักษาโดยการใส่อุปกรณ์ประคองข้อ สะโพก (Pavlik harness) พบว่า ได้ผลดีประมาณร้อยละ ๘๕-๙๕ ส่วนในเด็กที่อายุมากขึ้น วิธีการรักษาจะ ยากขึ้น คือ การดึงให้เข้าที่และเข้าเฝือก เช่น หากอายุเกิน ๒ ปี ใช้วิธีผ่าตัดให้สะโพกเข้าที่และใส่เฝือก การเติบโตของสะโพกสิ้นสุดที่อายุ ๘ ปีในเด็กโตที่มีอายุเกินกว่า ๑๐ ปีไม่สามารถรักษาให้เป็นปกติได้',
        ],
      },
    ],
  },

  childsSlippedEpiphysis: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'เมื่อดูจากภาพรังสีสะโพกด้านหน้าและด้านข้างสามารถวินิจฉัยได้สาเหตุเกิดจากปัจจัยร่วมกันของเด็กที่มีน้ำหนักตัวมาก และอยู่ในช่วงวัยรุ่นที่มีการเติบโตเร็ว แผ่นการสร้างกระดูกจะกว้างขึ้น หาก มีการเล่นกีฬาหรือออกกําลังมากในช่วงหน้าร้อน มักทําให้เกิดปัญหานี้ได้ในเด็กวัยรุ่นเมื่อมีอาการปวดบริเวณ สะโพกหรือเข่า และเท้าบิดออกเล็กน้อย ควรนึกถึงโรคนี้บางคนอาจมีโรคของต่อมไร้ท่อ เช่น ไทรอยด์ต่ำร่วม ด้วย',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-hip-2.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          'ควรรับไว้รักษาในโรงพยาบาลและใส่สกรู(screw) ที่มีเกลียวยึดหัวกระดูกที่เคลื่อนเอาไว้ เพียง ๑ ตัว และไม่ต้องเอาออกบางรายเป็นทั้ง ๒ ข้างและรู้สึกปวด ภายหลังต้องตรวจและเฝ้าติดตามอย่างใกล้ชิด',
        ],
      },
    ],
  },

  /** NOTE เข่า */

  menuDeformedKnee: [
    {
      title:
        'โรคขาโก่งและขาเกตามธรรมชาติ (Physiologic Bowed legs and knocked knee)',
      value: 'childs-deformed-knee-physiologicBowed',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
    },
    {
      title:
        'โรคกระดูกแข้งส่วนต้นโก่งทิเบียวารา (Tibia vara) หรือโรคเบลาต์ (Blount’s disease)',
      value: 'childs-deformed-knee-tibiaVara',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'โรคขาโก่งเกจากโรคต่างๆ',
      value: 'childs-deformed-knee-physiologicBowedOther',
      bColor: '#a2a7bb',
      bgColor: '#cdced3',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'โรคกระดูกแข้งโก่งแต่กําเนิด \n(Congenital bowing of tibia)',
      value: 'childs-deformed-knee-congenitalBowing',
      bColor: '#26a872',
      bgColor: '#88c2aa',
      fColor: '#000000',
    },
  ],

  childsBowedLegs: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'หมายถึง ขาโก่งและขาเกโดยเป็นปกติไม่มีโรคใช้วิธีการตรวจร่างกายในการวินิจฉัย ยกเว้นหากมีข้อสงสัย จึงส่งตรวจภาพรังสีเพิ่มเติม มักเป็นปัญหาที่พบบ่อยในเด็กแรกเกิดถึง ๗ ปี จากการศึกษาของซาลิเนียส (Salenius) เรื่องมุมของต้นขากับแข้ง ของเด็กปกติในเด็กที่อายุต่างกัน พบว่า เด็กแรกเกิด จะมีขาโก่ง (bowlegs) โดยเมื่อวัดจากมุมระหว่างกระดูก ต้นขาและแข้งได้ประมาณ ๑๕ องศา หลังจากนั้นจะค่อยๆ ตรงขึ้น จนมุมเป็นแนวตรง (neutral) เมื่ออายุ ประมาณ ๒ ปี ส่วนนี้เรียกว่า ขาโก่งตามธรรมชาติ ต่อจากนั้นขาจะค่อยๆ เกออกหลังจากอายุ ๒ ปีจนมากที่สุดในช่วงอายุ ๓ ปี โดยอยู่ที่ประมาณ ๑๒ องศา แล้วค่อยๆ ลดลงเหลือประมาณ ๗ องศา เท่ากับผู้ใหญ่ เมื่อ อายุประมาณ ๗ ปีส่วนนี้เรียกว่า ขาเกตามธรรมชาติ',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-knee-1.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          'เนื่องจากภาวะนี้ไม่ได้เป็นโรค ดังนั้น จึงไม่ต้องรักษา บางคนเกิดจากพันธุกรรมขาโก่งหรือเก มากเกินไป ทําให้ไม่สวยงาม เรียกว่า โรคขาโก่งเกตามธรรมชาติที่ยังเหลืออยู่ (persistent physiologic bowed leg or knocked knee) อาจพิจารณาแก้ไขได้ในบางราย',
        ],
      },
    ],
  },

  childsTibiaVara: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'การส่งตรวจภาพรังสีมีความจําเป็นในกรณีเด็กที่มีอายุ ๒ ปีแล่วแต่ขายังโก่ง เมื่อดูจาก ภาพรังสีมีการเปลี่ยนแปลง ๖ ระยะ ของแลงเกนสกิโอลด์(Langenskiold) เนื่องจากเป็นภาวะขาโก่งที่เกิด จากการเจริญเติบโตที่น้อยลงของแผ่นการสร้างกระดูก บริเวณด้านในของกระดูกแข้งส่วนต้น (proximal medial tibial physis) เกิดจากเด็กอ้วน และน้ําหนักกด จนการเติบโต ของกระดูกแข้งส่วนต้นด้านในน้อยลง ทําให้มีขาโก่งมากขึ้นแม้อายุจะมากกว่า ๒ ปีโดยพบว่าเป็นทั้ง ๒ ข้างถึงร้อยละ ๕๐-๘๐ ประเทศไทยพบมาก ขึ้น เนื่องจากเด็กไทยอ้วนขึ้นมากกว่าแต่ก่อน',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-knee-2.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          'ในระยะต้น มีเป้าหมายเพื่อให้แผ่นการสร้างกระดูกทางด้านในของกระดูกแข้งส่วนต้นมีการเจริญเติบโตกลับมาเป็นปกติ แพทย์อาจใช้อุปกรณ์เสริมช่วยประคองข้อเข่า (Knee-Ankle-Foot orthosis) เพื่อไม่ให้ขาโก่งเพิ่มขึ้น แต่ถ้าเด็กอายุมากกว่า ๓ ปี และเป็นในระยะที่ ๓ ของแลงเกนสกิโอลด์ หรือเด็กใส่ อุปกรณ์เสริมแล้วไม่ได้ผลดี อาจจําเป็นต้องรักษาโดยการผ่าตัด ตรงกระดูกแข้งส่วนต้น เพื่อแก้ไขแนวของกระดูกขาให้เกออก และให้แผ่นการสร้างกระดูกเจริญเติบโตได้ต่อไปตามปกติ ในผู้ป่วยบางรายที่มารักษาช้า เกินไป จะมีการเชื่อมปิด (arrest) ของแผ่นการสร้างกระดูกทางด้านในของเข่า ทําให้เกิดการเป็นซ้ํา อาจต้อง ผ่าตัดหลายครั้ง เด็กอ้วนที่ขาโก่งและอายุเกิน ๒ ปี ควรส่งตรวจภาพรังสีเพื่อหาโรคนี้',
        ],
      },
    ],
  },

  childsBowedLegsOther: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'พบน้อยกว่าโรคเบลาต์มาก ในโรคกระดูกอ่อน ที่พบบ่อยที่สุดคือ โรคกระดูกอ่อนจากฟอสเฟตต่ำ (hypophosphatemic rickets) ต่างจากโรคเบลาต์เมื่อเจาะเลือดแล้วมีฟอสเฟตต่ำ ส่วนในโรคกระดูกพันธุกรรมอาจพบโรคอะคอนโดรเพลเซีย',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-knee-3.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          'โรคกระดูกอ่อนจากฟอสเฟตต่ำ กุมารแพทย์ทางต่อมไร้ท่อจะให้การรักษาด้วยการให้ แคลเซียม วิตามินดีและฟอสเฟต จนฟอสเฟตกลับมาเป็นปกติหากขาโก่งเกเกินกว่า ๒๐ องศา ควรผ่าตัด แก้ไข',
        ],
      },
    ],
  },

  childsBowingOfTibia: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'แบ่งออกเป็น การโก่งด้านหน้าออกนอก (congenital anterolateral bowing) และการโก่งด้านหลังเข้าใน (congenital posteromedial bowing) การส่งตรวจภาพรังสีเห็นการโก่งของกระดูกแข้งและดูทิศทางการโก่ง',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-knee-4.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          'ถ้าเป็นโรคกระดูกแข้งโก่งด้านหน้าออกนอก การรักษาจะยากกว่ามาก อาจพบร่วมกับโรคท้าวแสนปม (neurofibromatosis) ที่มีปานแดงขอบเรียบ และถ่ายทอดทางพันธุกรรม ภายหลังเนื้อเยื่อจะแทรกในกระดูกทําให้เกิดภาวะกระดูกแข็งไม่ติดแต่กําเนิด ต้องผ่าตัดแก้ไขให้กระดูกติดและยืดขาให้ยาวเท่ากัน ส่วนกระดูกแข้งโก่งด้านหลังเข้าในจะมีปัญหาน้อย โดยเฉลี่ยกระดูกแข้งสั้น เพียง ๓ เซนติเมตร การรักษาโดย การยืดกระดูกแข้งให้ขายาวเท่ากันก็พอ',
        ],
      },
    ],
  },

  /** NOTE เท้า */

  menuDeformedFoot: [
    {
      title: 'โรคเท้าปุก (Club foot)',
      value: 'childs-deformed-foot-clubfoot',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'โรคเท้าแบน (Flat foot)',
      value: 'childs-deformed-foot-flatfoot',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  childsClubFoot: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'ใช้การตรวจร่างกาย เป็นความผิดปกติแต่กําเนิด โดยเท้ามีการผิดรูป เท้าส่วนกลางและส่วนปลาย มีลักษณะบิดเข้าด้านในและพลิกหงายข้อเท้าและเท้าส่วนหลังมีลักษณะจิกลงด้านล่าง (equinus) จากการที่มีเอ็นร้อยหวาย หดสั้นลง มักพบมีภาวะอุ้งเท้ายกสูงกว่าปกติ(cavus) ร่วมด้วยในรายที่เป็นมาก พบอุบัติการณ์ของเท้าปุกแตกต่างกัน ในเด็กแรกเกิดประมาณ ๑ ต่อ ๑,๐๐๐ ราย สามารถจําแนก ได้เป็น ๓ ประเภท คือ',
          '๑. เท้าปุกเทียม (postural clubfoot) เกิดจากท่าผิดปกติของเท้าทารกขณะที่อยู่ในครรภ์มารดา มี ลักษณะเท้าบิดเข้าด้านใน สังเกตว่า ไม่มีรอยลึกของผิวหนังที่ด้านในของฝ่าเท้าและด้านหลังของ ข้อเท้า ในกลุ่มนี้สามารถดัดให้เท้าอยู่ในลักษณะ เหมือนเท้าปกติได้ง่าย ซึ่งสามารถรักษาให้หาย ได้โดยการดัดเท้าและ/หรือใส่เฝือกเพียงไม่กี่ครั้ง ไม่จําเป็นต้องผ่าตัด',
          '๒. เท้าปุกแท้ (congenital clubfoot) กลุ่มนี้เป็นกลุ่มที่ไม่สามารถดัดให้ความผิดรูปหายไปได้ซึ่ง จากการตรวจครั้งแรก พบว่า เท้าบิดเข้าด้านในและมีรอยลึกของผิวหนังที่ด้านในของฝ่าเท้าและ ด้านหลังของข้อเท้า ขนาดของเท้ามักเล็กกว่าเท้าข้างที่ปกติในกลุ่มนี้ไม่ทราบสาเหตุในการเกิดโรค',
          '๓. เท้าปุกชนิดที่เกิดร่วมกับโรคอื่น (syndromic หรือ teratologic clubfoot) เช่น โรคถุงน้ำในไขสันหลัง (myelomeningocele) โรคกล้ามเนื้อยึดติดแข็ง (arthrogryposis multiplex  congenita) กลุ่มนี้เท้าปุกมักแข็งและดัดแก้ไขได้ยาก ใส่เฝือกดัดไม่ค่อยได้ผล และพบว่ากลับเป็นซ้ำได้บ่อย',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-foot-1.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          'จุดมุ่งหมายในการรักษาของแพทย์คือ ให้เท้าสามารถใช้งานได้ใกล้เคียงกับเท่าปกติมากที่สุด เท้าราบกับพื้นไม่ตะแคงเรียกว่า ท่าเดินเต็มเท้า (plantigrade) คือ ไม่เขย่ง ฝ่าเท้าตรง วิธีการรักษามีทั้งผ่าตัด และไม่ผ่าตัด ขึ้นอยู่กับอายุของเด็กที่มาพบแพทย์โดยในช่วงอายุ ๖ เดือนแรกหลังคลอด สามารถรักษาโดย การดัดเท้าและใส่เฝือกซึ่งจะได้ผลดีโดยแพทย์จะนัดมาดัดเท้า และเปลี่ยนเฝือกให้ใหม่ทุก ๑-๒ สัปดาห์ จนกว่าเท้าจะกลับมาอยู่ในภาวะปกติในกลุ่มที่ไม่หายจากการดัดและเข้าเฝือก แพทย์อาจต้องเสริมการผ่าตัดเล็ก คือ เจาะบริเวณเอ็นร้อยหวายที่ด้านหลังของข้อเท้า (percutaneous lengthening of Achilles tendon) เพื่อแก้ไขภาวะจิกลงด้านล่างของกระดูกส้นเท้าผู้ป่วยบางรายอาจต้องเจาะเอ็นร้อยหวายมากกว่า ๑ ครั้ง ขึ้นอยู่กับความแข็งของเท้าที่ผิดรูป หรือผ่าตัดใหญ่ยืดเอ็นที่ตึงทั้งหมด หลังการรักษาจนเท้าตรงแล้ว ควร ใส่รองเท้าประคองเท้าต่อ เพื่อป้องกันการกลับเป็นซ้ํา ปัจจุบันการรักษาดังกล่าวเรียกว่า เทคนิคของพอนเซติ (Ponseti technique) ได้รับความนิยมมาก เพราะไม่ต้องผ่าตัดใหญ่ ได้ผลการรักษาดี',
        ],
      },
    ],
  },

  childsFlatFoot: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'ใช้การตรวจร่างกาย ตรวจพบว่าความสูงของอุ้งฝ่าเท้าด้านในลดลง (เมื่อใช้เท้ายืนรับน้ำหนัก) ทําให้อุ้งฝ่าเท้าแบนราบลงกับพื้น มักพบร่วมกับการมีส้นเท้าบิดออกด้านนอก และปลายเท้าจะเฉออกด้านนอก ขณะยืนลงน้ำหนัก ในเด็กเล็กวัยหัดเดิน จะพบภาวะนี้ได้เกือบทุกราย จึงไม่ถือว่าเป็นโรค หรือเป็นความผิดปกติซึ่งความสูงของอุ้งฝ่าเท้าด้านในจะค่อยๆ เพิ่มขึ้นตามอายุจนมีลักษณะใกล้เคียงกับผู้ใหญ่เมื่ออายุ ๘- ๑๐ ปี แม้ในผู้ใหญ่ก็ยังพบมีภาวะเท้าแบนได้ประมาณร้อยละ ๑๕-๓๐ โดยพบว่า มีความเกี่ยวข้องทางพันธุกรรมร่วมด้วยได้',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-foot-2.jpg'),
      },
      {
        title: 'การรักษา',
        desc: [
          'ส่วนใหญ่ไม่มีปัญหาจนต้องผ่าตัดการรักษาด้วยการผ่าตัด พบน่อยกว่าร้อยละ ๑ ของเท้าแบนทั้งหมด การผ่าตัดมีหลายวิธีเช่น การยืดเอ็นร้อยหวาย การย้ายกระดูกส้นเท้าให้เท้าหายแบน ต้องมีข้อบ่งชี้เช่น เจ็บเท้ามาก การรักษาเริ่มจากให้คําแนะนํา เพื่อให้เกิดความสบายใจว่า ไม่ได้เป็นปัญหาใหญ่ ไม่จําเป็นต้องตัดรองเท้า ภายหลังก็จะดีขึ้นเอง การรักษาด้วยรองเท้า ไม่ได้เปลี่ยนแปลงธรรมชาติของเท้าแบนให้ ดีขึ้น และควรทราบว่าการตัดรองเท้านั้น เมื่อใส่รองเท้า แม้ว่าขณะใส่เท้าจะหายแบน แต่เมื่อถอดรองเท้า เท้าก็จะแบนลงมาอีก นอกจากนี้คนไทยไม่ใส่รองเท้าขึ้นบนบ้านหรือเข้าในบ้าน แต่ละวัน จะใส่รองเท้าน้อยกว่าการไม่ใส่ การตัดรองเท้าจะมีประโยชน์บ้างในกรณีกลุ่มผู้ป่วยที่มีเอ็นร้อยหวายสั้น บางคนดีขึ้น เมื่อได้ใส่รองเท้าที่เสริมส้นเท้าและรองที่อุ้งเท้า ทําให้เดินได้นานขึ้น ไม่ปวดเมื่อยง่าย',
        ],
      },
    ],
  },

  /** NOTE นิ้ว */

  menuDeformedFinger: [
    {
      title: 'โรคนิ้วเกิน (Polydactyly)',
      value: 'childs-deformed-finger-polydactyly',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'โรคนิ้วติด (Syndactyly)',
      value: 'childs-deformed-finger-syndactyly',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  childsPolydactyly: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'โดยการตรวจร่างกายสามารถพบได้ทุกนิ้ว แต่ส่วนใหญ่มักพบนิ้วหัวแม่มือ หรือนิ้วก้อย และ พบได้ที่เท้าด้วย',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-fings-1.jpg'),
      },
      {
        title: 'การรักษา',
        desc: ['โดยการตัดเอานิ้วส่วนเกินออก'],
      },
    ],
  },

  childsSyndactyly: {
    content: [
      {
        title: 'การวินิจฉัย',
        desc: [
          'โดยการตรวจร่างกายพบว่านิ้วติดกัน อาจติดกัน ๒ นิ้ว หรือทุกนิ้วก็ได้แต่ที่พบบ่อยคือ นิ้วติดกันระหว่างนิ้วนางกับนิ้วกลาง เป็นได้ทั้งมือและเท้า',
        ],
      },
      {
        title: 'ภาพประกอบ',
        image: require('../images/childs-fings-2.jpg'),
      },
      {
        title: 'การรักษา',
        desc: ['การผ่าตัดแยกนิ้วออก'],
      },
    ],
  },
};
