export const DATA_BACK_ACHE = {
  mainMenu: [
    {
      title: 'สาเหตุ​',
      value: 'backache-cause',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'อาการที่ควรมา รพ.​',
      value: 'backache-bringhospital',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'ทางเลือกในการรักษา​',
      value: 'backache-wayTreat',
      bColor: '#26a872',
      bgColor: '#88c2aa',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'ปัจจัยเสี่ยง',
      value: 'backache-risk',
      bColor: '#a2a7bb',
      bgColor: '#cdced3',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'โรคที่เกี่ยวข้อง\nกับอาการปวดหลัง',
      value: 'backache-withcase',
      bColor: '#9B59B6',
      bgColor: '#D7BDE2',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  backacheRisk: {
    content: [
      {
        title: 'อายุ',
        desc: [
          'ผู้ที่อายุมากขึ้นจะมีความเสื่อมเกิดขึ้น โดยกระดูกสันหลังจะมีความเสื่อมเกิดขึ้นในส่วนของหมอนรองกระดูกและข้อต่อของกระดูกสันหลัง',
        ],
      },
      {
        title: 'การขาดการออกกําลังกาย',
        desc: [
          'คนที่ไม่ได้ออกกําลังกายหลังเป็นประจําจะมีกล้ามเนื้อข้างกระดูกสันหลังไม่แข็งแรงพอที่จะรองรับกระดูกสันหลังได้',
        ],
      },
      {
        title: 'อ้วน',
        desc: [
          'น้ำหนักตัวที่มากเกินไป จะทําให้กระดูกสันหลังต้องรับน้ำหนักมาก เกิดความเสื่อมตามมาได้นอกจากนี้ไขมันบริเวณหน้าท้องอาจทําให้สมดุลของร่างกายเสียและเพิ่มความเสี่ยงต่อการบาดเจ็บหรือเกิดอุบัติเหตุได้',
        ],
      },
      {
        title: 'การทํางาน',
        desc: [
          'ผู้ที่ต้องยกของหนัก ใช้แรงผลักหรือดึง จะทําให้กระดูกสันหลังบิดรวมถึงผู้ที่ทํางานนั่งโต๊ะเป็นเวลานานโดยอิริยาบถไม่ถูกต้องก็อาจปวดหลังได้',
        ],
      },
      {
        title: 'โรคบางชนิด',
        desc: [
          'เช่น ข้ออักเสบ, การติดเชื้อที่กระดูกสันหลัง , เนื้องอกบางชนิด , มะเร็งระยะแพร่กระจาย',
        ],
      },
    ],
  },

  backacheCause: [
    {
      title: 'สาเหตุเบื้องต้น',
      value: 'backache-cause-qa1',
      normal: true,
      expand: false,
      description: [
        'โรคอื่นๆ ที่ทําให้เกิดอาการปวดร้าวมาที่หลังได้: เช่น โรคไต(กรวยไตอักเสบ) โรคเกี่ยวกับรังไข่และมดลูก โรคหลอดเลือดโป่งพองในช่องท้อง',
      ],
    },
    {
      title: 'ภาวะของกระดูกสันหลังผิดปกติ',
      value: 'backache-cause-qa2',
      imageScript: true,
      expand: false,
      description: [
        {
          title: 'กระดูกสันหลังเสื่อม',
          desc:
            'เกิดจากความเปลี่ยนแปลงส่วนใหญ่เกิดในอายุที่เพิ่มขึ้น ทําให้หมอนรองกระดูกและข้อต่อกระดูกสันหลังเสื่อม',
        },
        {
          title: 'หมอนรองกระดูกสันหลังเคลื่อนทับเส้นประสาท',
        },
        {
          title: 'โพรงกระดูกสันหลังตีบแคบ',
          desc:
            'จากการเสื่อมสภาพของกระดูกหรือเส้นเอ็น ทําให้กระดูกหรือเส้นเอ็นหนาตัวขึ้น เกิดการบีบรัดเส้นประสาทที่วิ่งอยู่ในโพรงกระดูก',
        },
        {
          title: 'กระดูกสันหลังเคลื่อน',
          desc:
            'จากกระดูกสันหลังเสื่อมและเสียความมั่นคง ทําให้กระดูกสันหลังเคลื่อนจากการขยับได้ อาจมีการปวดร้าวลงขาหากมีการกดทับเส้นประสาท',
        },
        {
          title: 'ความผิดปกติของกระดูกสันหลังแต่กําเนิด',
          desc: 'เช่น โพรงกระดูกสันหลังตีบแต่กําเนิด กระดูกสันหลังคด',
          image: require('../images/backache-1.jpg'),
        },
        {
          title: 'กระดูกสันหลังหักจากอุบัติเหตุ',
          desc:
            'เช่น อุบัติเหตุทางรถยนต์ การตกจากที่สูง หรือ การล้มในผู้สูงอายุ',
        },
        {
          title: 'โรคอื่นๆ ของกระดูกสันหลัง',
          desc:
            'ได้แก่ การติดเชื้อของกระดูกสันหลัง ,มะเร็งแพร่กระจายมาที่กระดูกสันหลัง',
        },
      ],
    },
    {
      title: 'ภาวะของกระดูกสันหลังผิดปกติ',
      value: 'backache-cause-qa3',
      imageScript: true,
      expand: false,
      description: [
        {
          title:
            'ท่าทางอิริยาบถการเคลื่อนไหวและการใช้งานหลังที่ไม่ถูกต้องเป็นเวลานาน',
          desc: 'โดยเฉพาะผู้ที่ทํางานั่งโต๊ะเป็นเวลานาน',
          image: require('../images/backache-2.jpg'),
        },
        {
          title: 'การยกของหนัก',
          desc:
            'การก้มหลังยกของทําให้น้ําหนักจะผ่านไปที่กล้ามเนื้อหลังและกระดูกสันหลังส่วนที่กําลังโค้งมากที่สุด',
          image: require('../images/backache-3.jpg'),
        },
        {
          title: 'การบาดเจ็บบริเวณหลังจากอุบัติเหตุหรือการเล่นกีฬา',
          desc:
            'เช่น การเล่นกีฬาประทะ หรือ กีฬาที่ต้องมีการบิดตัวเร็วๆ หรือกีฬาที่ต้องออกแรง',
        },
      ],
    },
  ],

  choiceHeal: [
    {
      title: 'การรักษาโดยไม่ต้องผ่าตัด',
      value: 'backache-heal1',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'การรักษาโดยการผ่าตัด​',
      value: 'backache-heal2',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  backacheHeal1: {
    content: [
      {
        title: 'การรักษาแบบประคับประคอง',
        desc: [
          'ได้แก่ การรับประทานยา การทํากายภาพบําบัดและการนอนพักมักเป็นวิธีที่ใช้เริ่มต้นในการรักษา ยกเว้นกรณีที่ผู้ป่วยมีข้อบ่งชี้ชัดเจนว่าต้องได้รับการรักษาโดยวิธีอื่น',
        ],
      },
      {
        title: 'การฉีดยาสเตียรอยด์เข้าโพรงกระดูกสันหลัง',
        desc: [
          'ใช้ในกรณีที่ผู้ป่วยมีอาการปวดหลังร้าวลงขาและได้รับการรักษาแบบประคับประคองแล้วแต่อาการไม่ดีขึ้นการฉีดยาเข้าโพรงกระดูกสันหลังจะช่วยลดความปวดจากการอักเสบ',
        ],
        inlineImg: require('../images/backache-14.jpg'),
      },
    ],
  },

  backacheHeal2: {
    content: [
      {
        title: 'การรักษาโดยการผ่าตัด',
        desc: [
          'จะใช้วิธีการรักษานี้เมื่อผู้ป่วยมีข้อบ่งชี้ เช่น ควบคุมการขับถ่ายไม่ได้, ขาอ่อนแรงเดินไม่ได้, หรือเมื่อทําการรักษาโดยวิธีอื่นแล้วไม่ได้ผล ซึ่งวิธีการผ่าตัดมีหลายวิธีขึ้นกับภาวะของผู้ป่วยหรือข้อบ่งชี้ในการผ่าตัด',
        ],
      },
    ],
  },

  backacheSymp: {
    content: [
      {
        title: 'อาการที่ควรมารพ.\nท่านมีอาการใดอาการหนึ่งดังต่อไปนี้ร่วมด้วย',
        desc: [
          'มีประวัติบาดเจ็บต่อกระดูกสันหลังนำมาก่อน',
          'มีปวดร้าวลงสะโพก, ขา หรือเท้า',
          'ปวดเฉียบพลันจนเคลื่อนไหวไม่ได้',
          'อ่อนแรงหรือชาแขนขาร่วมด้วย',
          'มีปัญหาในการควบคุมปัสสาวะ, อุจจาระ',
          'มีความเสี่ยงในการติดเชื้อ เช่น รับประทานยากดภูมิคุ้มกัน, มีประวัติติดเชื้อในกระแสเลือด, ประวัติการฉีดยาเข้าไขสันหลัง',
          'ประวัติโรคประจ าตัวเป็นโรคมะเร็งหรือเคยเป็น',
          'น้ำหนักลดไม่ทราบสาเหตุ',
          'มีอาการอื่นๆร่วม เช่น ไข้, คลื่นไส้อาเจียน',
          'มีอาการนาน 4 สัปดาห์ขึ้นไป ไม่มีช่วงที่ดีขึ้น หรือรักษาแล้วอาการไม่ดีขึ้น',
        ],
      },
    ],
  },

  mayBeSymp: {
    title: 'อาการที่รักษาเบื้องต้นได้เอง',
    desc:
      'ยังไม่มีข้อบ่งชี้ในการตรวจเพิ่มเติมทางรังสีเช่นเอ็กซเรย์หรือข้อบ่งชี้ในการผ่าตัด สามารถรักษาเบื้อง ต้นแบบประคับประคองได้; อาการจะค่อยๆดีขึ้นใน 1-2 สัปดาห์',
    content: [
      {
        title: 'โรคที่อาจเป็นได้',
        desc: [
          '\tหมอนรองกระดูกทับเส้นประสาท มีปวดหลัง ปวดสะโพกร้าว ลงขา อ่อนแรงหรือชาได้',
          '\tโรคโพรงกระดูกสันหลังตีบแคบ มีอาการปวดขาเวลายืนหรือ เดินติดต่อกันเป็นเวลานาน นั่งหรือโน้มตัวมาด้านหน้าแล้วดีขึ้น',
          '\tกล้ามเนื้อหลังหรือเอ็นอักเสบ จากการใช้ท่าทางการเคลื่อนไหวของเอ็นและกล้ามเนื้อที่ไม่ถูกต้องเป็นเวลานาน',
          '\t กระดูกสันหลังคด ไหล่ 2ข้างไม่เท่ากัน สะโพก 2ข้างไม่เท่ากัน',
        ],
      },
      {
        title: 'การรักษาเบื้องต้นด้วยตนเอง',
        desc: [
          {
            label: 'การปรับพฤติกรรม',
            image: require('../images/backache-4.jpg'),
          },
          {
            label: 'กายบริหาร',
            image: require('../images/backache-5.jpg'),
          },
          {
            label: 'ประคบ',
            image: require('../images/backache-6.jpg'),
          },
          {
            label: 'การใช้ยา',
            image: require('../images/backache-7.jpg'),
          },
          {
            label: 'ลองรักษาเบื้องต้นครบทุกวิธี อาการยังไม่ดีขึ้น ควรพบแพทย์',
          },
        ],
        image: true,
      },
    ],
  },

  dontSym: {
    content: [
      {
        title: 'ควรพบแพทย์\nโรคที่อาจเป็นได้จึงจำเป็นต้องมีการตรวจเพิ่มเติม',
        desc: [
          'กลุ่มอาการกดทับรากประสาท ทำให้มีอาการอ่อนแรง ชา หรือ ไม่สามารถถ่ายหรือกลั้นอุจจาระปัสสาวะได้',
          'ฝีในโพรงกระดูกสันหลัง มีอาการไข้ครั่นเนื้อครั่นตัวร่วม มักมีทำหัตถการบริเวณไขสันหลัง ประวัติมีภาวะภูมิคุ้มกันต่ำ',
          'มะเร็งแพร่กระจายไปกระดูกสันหลัง มักมีประวัติเคยหรือกำลังเป็นมะเร็งร่วม',
        ],
      },
    ],
  },

  backacheSubMenu: [
    {
      title: 'โรคกระดูกสันหลังคด',
      value: 'backache-withcase-1',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'กระดูกสันหลังหัก',
      value: 'backache-withcase-2',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'หมอนรองกระดูกสันหลัง\nกดทับเส้นประสาท',
      value: 'backache-withcase-3',
      bColor: '#a2a7bb',
      bgColor: '#cdced3',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  backacheSub3: [
    {
      title: 'คืออะไร',
      value: 'backache-withcase-1-qa1',
      imageScript: true,
      expand: false,
      description: [
        {
          desc:
            '\tกระดูกสันหลังประกอบด้วยกระดูกหลายชิ้นและเชื่อมต่อกันด้วยหมอนรองกระดูกและข้อต่อกระดูก โดยที่ตัวกระดูกสันหลังทําหน้าที่ปกป้องไขสันหลังส่วนหมอนรองกระดูกเป็นตัวทําให้เกิดความยืดหยุ่นยืดหยุ่นและรับแรงกระแทกของน้ําหนักตัวจากการเคลื่อนไหว',
        },
        {
          desc:
            '\tการทํากิจวัตรประจําวันหรืออายุที่เพิ่มขึ้น ก็เป็นสาเหตุที่ทําให้หมอนรองกระดูกเสื่อมสภาพได้ ทําให้ความสูงของหมอนรองกระดูกลดลงและมีการฉีกขาดของเนื้อเยื่อหมอนรอง แกนหมอนรองกระดูกยื่นมากดทับเส้นประสาทไขสันหลัง โดยหมอนรองกระดูกที่พบว่ามีปัญหาบ่อยที่สุดคือหมอนรองกระดูกสันหลังระดับเอวข้อที่ 4-5 เนื่องจากเป็นข้อต่อระดับที่มีการเคลื่อนไหวและรับน้ําหนักมากในร่างกาย',
          image: require('../images/backache-8.jpg'),
        },
      ],
    },
    {
      title: 'อาการ',
      value: 'backache-withcase-1-qa2',
      normal: true,
      expand: false,
      description: [
        'ปวดหลังร้าวลงสะโพกและขาข้างใดข้างหนึ่งหรือทั้งสอง ปวดมากขึ้นเวลาไอหรือจาม',
        'กล้ามเนื้ออ่อนแรง ทําให้เดินลําบาก',
        'ชาบริเวณขาหรือเท้า',
        'ในบางรายที่มีอาการรุนแรงมากๆจะมีความผิดปกติของระบบขับถ่ายร่วมด้วย เช่น ไม่สามารถควบคุมการอุจจาระหรือปัสสาวะได้ ซึ่งจําเป็นต้องผ่าตัดรักษาอย่างเร่งด่วนมิฉะนั้นระบบขับถ่ายอาจไม่สามารถฟื้นคืนได้',
      ],
    },
    {
      title: 'พบมากในวัยใด',
      value: 'backache-withcase-1-qa3',
      normal: true,
      expand: false,
      description: [
        'กลุ่มผู้ที่มีอายุ40 ปีขึ้นไป ซึ่งเริ่มมีความเสื่อมของกระดูกสันหลังหรือหมอนรองกระดูกสันหลังเสื่อมอยู่เมื่อออกแรงหรือใช้แรงเบ่งมากๆ อาจทําให้หมอนรองกระดูกสันหลังปลิ้นออกมากดทับเส้นประสาทได้ในทันที',
        'กลุ่มวัยหนุ่มสาว โดยเฉพาะในรายที่ชอบออกกาลังกายหนักๆ, เคยมีอุบัติเหตุ หรือใช้งานกระดูกสันหลังไม่ถูกต้อง เช่น ท่านั่งท่าก้มที่ผิดอิริยาบถ หมอนรองกระดูกสันหลังก็เสื่อมได้เช่นกัน',
      ],
    },
    {
      title: 'การรักษา',
      value: 'backache-withcase-1-qa4',
      option: true,
      expand: false,
      description: [
        {
          title: 'การลดน้ําหนัก',
          content: [
            'รักษาโดยการลดน้ําหนักและหลีกเลี่ยงปัจจัยเสี่ยงที่ทําให้เกิดอาการเพิ่มขึ้น ปัจจัยเสี่ยงที่ทําให้เกิดอาการเพิ่มขึ้น ได้แก่ การยกของหนัก, การนั่งรถยนต์นานๆ',
          ],
          inlineImg: require('../images/backache-9.jpg'),
        },
        {
          title: 'หลีกเลี่ยงอาการท้องผูก',
          content: [
            'หลีกเลี่ยงอาการท้องผูกหรือเบ่งถ่ายอุจจาระแรงๆ เนื่องจากทําให้เกิดแรงดันในหมอนรองกระดูกสูงขึ้น อาจทําให้เกิดการแตกของหมอนรองกระดูกและกดทับเส้นประสาทตามได้',
          ],
        },
        {
          title: 'การทํากายภาพบาบัด',
          content: [
            'การทํากายภาพบาบัดและใช้เสื้อพยุงหลัง ช่วยลดอาการปวดและ ทําให้ผู้ป่วยสามารถกลับไปใช้ชีวิตประจําวันได้ปกติเร็วขึ้น',
          ],
          inlineImg: require('../images/backache-10.jpg'),
        },
        {
          title: 'การผ่าตัดข้อบ่งชี้ในการ\nผ่าตัดมีดังนี้',
          content: [
            'ยาบรรเทาอาการอักเสบที่ไม่ใช่สเตียรอยด์ (NSAIDs)',
            'ยาคลายกล้ามเนื้อ',
          ],
        },
        {
          title: 'การผ่าตัดข้อบ่งชี้ในการ\nผ่าตัดมีดังนี้',
          content: [
            'ผู้ป่วยที่มีอาการปวดมากจนทนไม่ได้แม้จะรักษาโดยรับประทานยา การพักและกายภาพบําบัดเต็มที่แล้วก็ยังไม่สามารถทํางานหรือใช้ชีวิตได้ตามปกติ',
            'มีอาการชาอ่อนแรงหรือกล้ามเนื้อขาลีบอย่างชัดเจน',
            'มีปัญหาระบบขับถ่ายผิดปกติชัดเจน เช่น กลั้นอุจจาระหรือปัสสาวะไม่ได้',
          ],
        },
      ],
    },
  ],

  backacheSub1: [
    {
      title: 'คืออะไร',
      value: 'backache-withcase-2-qa1',
      imageScript: true,
      expand: false,
      description: [
        {
          desc:
            'ส่วนใหญ่มักเกิดขึ้นโดยไม่ทราบสาเหตุ มีส่วนน้อยที่อาจเกิดขึ้นจากโรคบางอย่าง เช่นโรคสมองพิการ(cerebral palsy), โรคกล้ามเนื้อเสื่อม (muscular dystrophy), การบาดเจ็บหรือการติดเชื้อในกระดูกสันหลังผู้ป่วยส่วนมากมีอาการเพียงเล็กน้อย ในเด็กบางรายกระดูกสันหลังอาจผิดรูปมากขึ้นเมื่อโตสู่วัยรุ่น',
        },
        {
          desc:
            'โดยทั่วไปแล้วกระดูกสันหลังของคนเราจะตรง แต่ผู้ที่มีกระดูกสันหลังคดจะมีแนวกระดูกที่โค้งช่วงเดียวหรือสองช่วง โดยจะคดไปทางด้านซ้ายหรือด้านขวาก็ได้ โดยจะนับว่ามีการคดของกระดูกสันหลังเมื่อวัดความคดได้มากกว่า 10 องศา',
          image: require('../images/backache-11.jpg'),
        },
      ],
    },
    {
      title: 'สาเหตุ',
      value: 'backache-withcase-2-qa2',
      imageScript: true,
      expand: false,
      description: [
        {
          desc:
            'สาเหตุของโรคกระดูกสันหลังคดโรคกระดูกสันหลังคดส่วนใหญ่เกิดขึ้นโดยไม่ทราบสาเหตุ ผู้ป่วยบางคนอาจมีพันธุกรรมเข้ามาเกี่ยวข้องสามารถแบ่งออกได้เป็นหลายประเภทตามช่วงอายุที่มีอาการเกิดขึ้น',
        },
        {
          title: 'โรคกระดูกสันหลังคดไม่ทราบสาเหตุใน',
          desc:
            'วัยทารก: ก่อนอายุ 3 ปี\nวัยเด็ก: อายุระหว่าง 4 –10 ปี\nวัยรุ่น: อายุระหว่าง 10 –18 ปี : ซึ่งเป็นกลุ่มที่พบโรคกระดูกสันหลังคดได้มากที่สุด',
        },
        {
          title: 'โรคกระดูกสันหลังคดแต่กําเนิด',
          desc: 'โดยอาจเกิดได้จากความบกพร่องในการสร้างของกระดูกไขสันหลัง',
        },
        {
          title: 'โรคกระดูกสันหลังคดจากท่าทางที่ผิด',
          desc:
            'อาจเกิดจากความผิดปกติบริเวณอื่นของร่างกายเช่นการบาดเจ็บ, ขาสั้นยาวไม่เท่ากัน, กล้ามเนื้อหดเกร็งการทํากิจกรรมที่ทําให้ร่างกายไม่สมดุลซ้ําๆกันเป็นเวลาหลายปี',
        },
        {
          title: 'โรคกระดูกสันหลังคดจากโรคประสาทกล้ามเนื้อ',
          desc:
            'พบในเด็กที่มีความผิดปกติของไขสันหลัง สมองและระบบกล้ามเนื้อ ทําให้กล้ามเนื้อและเส้นประสาทไม่สามารถรักษาสมดุลของลําตัวและกระดูกสันหลังได้ มักรุนแรงมากขึ้นเมื่อเด็กโตเป็นผู้ใหญ่',
        },
        {
          title: 'โรคกระดูกสันหลังคดจากความเสื่อม',
          desc:
            'เกิดในผู้สูงอายุเกิดจากการใช้งานหนักติดต่อกันเป็นเวลานานทําให้เกิดการเปลี่ยนแปลงของกระดูกสันหลัง',
        },
      ],
    },
    {
      title: 'ความเสี่ยง',
      value: 'backache-withcase-2-qa3',
      normal: true,
      expand: false,
      description: [
        'ความเสี่ยงในการเกิดโรคกระดูกสันหลังคดแบบไม่ทราบสาเหตุโดยเฉพาะช่วงวัยรุ่นกลุ่มกระดูกคดแบบไม่ทราบสาเหตุช่วงวัยรุ่น เป็น กลุ่มที่พบมากที่สุดของการเกิดกระดูกสันหลังคด โดยไม่มีสาเหตุที่ชัดเจน แต่พบว่าโรคจะมีความรุนแรง หรือมีการคดมากขึ้น จากปัจจัยดังนี้',
        'อายุ: อาการของโรคเกิดขึ้นในช่วงก่อนเข้าวัยรุ่น',
        'เพศ: เพศหญิงมีความเสี่ยงที่จะคดได้มากกว่าเพศชาย',
        'การมีประจําเดือนครั้งแรก : ผู้หญิงที่มีประจําเดือนช้าจะมีโอกาสคดได้มากกว่าผู้ที่มีประจําเดือนเร็ว',
        'ความคดของกระดูกสันหลังเริ่มต้นที่มาพบแพทย์ : ถ้าครั้งแรกที่พบกระดูกสันหลังคดมาก มีโอกาสเกิดกระดูกสันหลังคดมากขึ้น',
        'ประวัติครอบครัวโรคกระดูกสันหลังคด: เนื่องจากบางรายอาจเกิดจากพันธุกรรมได้ แต่ส่วนใหญ่ในรายที่เป็นโรคกระดูกสันหลังคดมักไม่มีประวัติคนในครอบครัวเป็น',
      ],
    },
    {
      title: 'อาการ',
      value: 'backache-withcase-2-qa4',
      option: true,
      expand: false,
      description: [
        {
          title: 'อาการทั่วไป',
          content: [
            'ไหล่ไม่เท่ากัน',
            'กระดูกสะบักนูนไม่เท่ากัน',
            'เอวไม่เสมอกัน',
            'สะโพกสองข้างสูงต่ำไม่เท่ากัน',
          ],
        },
        {
          title: 'อาการแทรกซ้อน',
          content: [
            'ผู้ป่วยส่วนใหญ่แม้มีอาการไม่มากแต่อาจมีอาการแทรกซ้อนจากโรคกระดูกสันหลังคดได้ เช่น',
            'ปอดและหัวใจทํางานได้ไม่เต็มที่: ในผู้รายที่มีกระดูกสันหลังคดรุนแรงเนื่องจากกระดูกซี่โครงอาจผิดรูปตามไปด้วยทําให้ปอดและหัวใจทํางานได้ไม่เต็มที่ เหนื่อยง่ายกว่าปกติ',
            'ปัญหาเกี่ยวกับหลัง: ผู้ที่มีปัญหากระดูกสันหลังคดตั้งแต่เด็กมีแนวโน้มว่าจะมีอาการปวดหลังเรื้อรังมากกว่าคนปกติทั่วไป เมื่ออายุมากขึ้น',
            'ปัญหาเกี่ยวกับรูปลักษณ์: เมื่ออาการของโรคแย่ลงสามารถสังเกตเห็นได้ชัดเจนยิ่งขึ้นว่าไหล่และสะโพกไม่เท่ากัน ซี่โครงยื่นออกมาผิดปกติ เอวและลําตัวเบี้ยว อาจให้ผู้ป่วยกังวลเกี่ยวกับรูปลักษณ์ของตนเอง',
          ],
        },
      ],
    },
    {
      title: 'วิธีการรักษา',
      value: 'backache-withcase-2-qa5',
      option: true,
      expand: false,
      description: [
        {
          title: 'การเฝ้าติดตาม',
          content: [
            'เหมาะสมกับผู้ที่กระดูกสันหลังยังคงมีการเจริญเติบโต แต่ความคดไม่มากอยู่ระหว่าง 10-25 องศา',
          ],
        },
        {
          title: 'การใส่เสื้อหลังเกราะพยุง',
          content: [
            'เหมาะสมกับผู้ที่กระดูกสันหลังยังคงมีการเจริญเติบโต เพื่อป้องกันไม่ให้กระดูดคดงอยิ่งขึ้น โดยอาจให้ผู้ป่วยใส่ตลอดเวลา ยกเว้นเวลาออกกําลังหรืออาบน้ํา มักใช้กับผู้ป่วยเด็กที่มีความคดอยู่ระหว่าง 25 –40 องศา',
            'ในบางกรณี เช่น ผู้ที่มีกระดูกสันหลังคดโดยไม่พบสาเหตุ กระดูกสันหลังอาจคดเพิ่มขึ้นถึง45 –50 องศา แม้จะใส่เสื้อหลังแล้วก็ตาม ในกรณีนี้แพทย์อาจแนะนําให้ผ่าตัด',
          ],
          inlineImg: require('../images/backache-12.jpg'),
        },
        {
          title: 'การผ่าตัด',
          content: [
            'แพทย์จะแนะนําหากการรักษาด้วยวิธีการอื่นไม่ได้ช่วยชะลอความรุนแรงของโรคหรือผู้ป่วยมาพบแพทย์เมื่อมีกระดูกสันหลังคดอย่างรุนแรงตั้งแต่แรกและผู้ป่วยมีอาการปวดอย่างรุนแรงหรือโรคกระดูกสันหลังคดมีผลกระทบต่อระบบประสาท',
          ],
        },
      ],
    },
  ],

  backacheSub2: [
    {
      title: 'สาเหตุ',
      value: 'backache-withcase-3-qa1',
      normal: true,
      expand: false,
      description: [
        'การบาดเจ็บของกระดูกสันหลัง เกิดได้จากหลายสาเหตุ เช่น อุบัติเหตุทางการจราจร, ตกจากที่สูง, บาดเจ็บจากการเล่นกีฬา,พฤติกรรมความรุนแรงและสาเหตุอื่นๆ นอกจากนี้ภาวะกระดูกพรุน การติดเชื้อของกระดูกสันหลังและเนื้องอกของกระดูกสันหลัง ก็เป็นสาเหตุร่วมที่ทําให้เกิดกระดูกสันหลังหักได้',
      ],
    },
    {
      title: 'อาการ',
      value: 'backache-withcase-3-qa2',
      normal: true,
      expand: false,
      description: [
        'อาการขึ้นอยู่กับความรุนแรงและตําแหน่งที่ได้รับบาดเจ็บอาจพบอาการปวดคอร่วม, เหน็บชา,กล้ามเนื้ออ่อนแรงหรือสูญเสียการควบคุมการขับถ่ายไป จนถึงอัมพาตซึ่งบ่งบอกถึงการบาดเจ็บของระบบประสาทและไขสันหลัง',
      ],
    },
    {
      title: 'การวินิจฉัย',
      value: 'backache-withcase-3-qa3',
      normal: true,
      expand: false,
      description: [
        'ก่อนที่จะทําการตรวจร่างกายโดยละเอียดเพื่อการวินิจฉัย ในรายที่มีอุบัติเหตุนําและมีอาการดังกล่าว จะได้รับการป้องกันการบาดเจ็บเพิ่มเติมโดยการใส่อุปกรณ์พยุงกระดูกสันหลังและระวังการเคลื่อนย้าย หลังจากนั้นจะมีการตรวจร่างกายที่หลังและตรวจระบบประสาทโดยละเอียดและอาจมีการส่งถ่ายภาพรังสีเพิ่มเติมเพื่อการวินิจฉัยที่เหมาะสมต่อไปเช่น เอกซเรย์, เอกซเรย์คอมพิวเตอร์ (CT scan) หรือการตรวจคลื่นแม่เหล็กไฟฟ้า (MRI)',
      ],
    },
    {
      title: 'แนวทางการรักษา',
      value: 'backache-withcase-3-qa4',
      option: true,
      expand: false,
      description: [
        {
          title: 'การรักษาแบบประคับประคอง',
          content: [
            'การใช้ยา : ลดอาการปวด',
            'การนอนพักในช่วงแรก เมื่ออาการปวดลดลงสามารถปรับกิจกรรมให้ค่อยๆกลับไปมีกิจกรรมที่มากขึ้น',
            'การใส่อุปกรณ์พยุง: เพื่อป้องกันการบาดเจ็บเพิ่มเติม โดยอาจเป็นการใส่อุปกรณ์ประคองกระดูกสันหลังหรือดามคอ เพื่อประคับประคองกระดูกสันหลังส่วนที่บาดเจ็บ และลดการเคลื่อนไหวของกระดูกสันหลัง ลดอาการปวดจากการขยับของกระดูกโดยจะได้รับการใส่อุปกรณ์เป็นระยะเวลา8-12 สัปดาห์จนกระดูกติดร่วมกับการทํากายภาพบาบัด',
          ],
        },
        {
          title: 'การผ่าตัดยึดหรือเชื่อมกระดูกสันหลัง',
          content: [
            'ในกรณีที่กระดูกสันหลังหักและเกิดความไม่มั่นคงเคลื่อนโดยจะทําการยึดตรึงกระดูกสันหลัง จัดเรียงกระดูกให้เข้าที่รวมถึงอาจต้องเชื่อมข้อต่อกระดูกสันหลัง และส่วนใหญ่จะทําการยึดดามด้วยเหล็กเพื่อเสริมความแข็งแรงร่วมด้วย',
          ],
        },
        {
          title: 'ในกระดูกสันหลังทรุดตัวหรือหักที่เกิดจากภาวะกระดูกพรุน',
          content: [
            'การฉีดซีเมนต์เพื่อเสริมโครงกระดูกสันหลัง ในกรณีที่ในการรักษาแบบประคับประคองไม่ได้ผล การรักษาวิธีนี้สามารถช่วยลดอาการปวดหลังได้',
          ],
          inlineImg: require('../images/backache-13.jpg'),
        },
      ],
    },
  ],
};
