const text = `ข้อตกลงและเงื่อนไขการใช้บริการเว็บไซต์
ธนาคารสงวนสิทธิ์ในการจัดให้มีเว็บไซต์นี้เพื่ออำนวยความสะดวกในการติดต่อสื่อสารระหว่างท่านกับธนาคารที่ต้องการทราบข้อมูลข่าวสาร ความเคลื่อนไหวต่างๆ ในการดำเนินธุรกิจของธนาคาร ทั้งนี้ ข้อมูลและสาระสำคัญที่ปรากฏในหน้าจอต่างๆ ตลอดจนข้อกำหนด เงื่อนไข และรายละเอียดต่างๆ ความถูกต้องครบถ้วนสมบูรณ์ ความเป็นปัจจุบัน และความต่อเนื่องของข้อมูลในเว็บไซต์นั้น อาจเปลี่ยนแปลงได้ตามดุลยพินิจของธนาคาร ธนาคารขอสงวนสิทธิ์ในการคัดเลือกผู้ประสงค์ใช้บริการ การระงับหรือจำกัดขอบเขต รวมถึงการปฏิเสธสิทธิในการใช้บริการทางเว็บไซต์ทั้งหมดหรือบางส่วนแก่ผู้ใดก็ได้ตามเกณฑ์ของธนาคาร โดยไม่ต้องทำการแจ้งให้ท่านทราบแต่อย่างใด และไม่ถือว่าเป็นการกระทำให้ท่านหรือบุคคลใดเกิดความเสียหายใดๆ ไม่ว่าทางตรงหรือทางอ้อม และจะไม่ยกเว้นเงื่อนไขการให้บริการข้อมูลนี้ไม่ว่าส่วนใดให้แก่ผู้ใดทั้งสิ้น เว้นแต่จะทำเป็นลายลักษณ์อักษร และลงนามโดยผู้มีอำนาจลงนามของธนาคาร ทั้งนี้ หากท่านไม่สามารถดำเนินการได้ตามข้อตกลงและเงื่อนไขการใช้บริการ กรุณาหยุดการเข้าเว็บไซต์โดยทันที

 

การใช้ข้อมูลและส่วนประกอบต่างๆ 

ข้อมูลและส่วนประกอบต่างๆ ที่ปรากฏอยู่ในเว็บไซต์นี้ อาจมีการเปลี่ยนแปลงได้ โดยไม่ต้องแจ้งให้ท่านทราบล่วงหน้า และมิได้มีวัตถุประสงค์เพื่อให้คำแนะนำอย่างผู้เชี่ยวชาญ


ธนาคารเป็นผู้ดูแลจัดการเว็บไซต์นี้ในประเทศไทย และมิได้ให้คำรับรองว่าข้อมูลที่จัดให้มีในหรือผ่านเว็บไซต์นี้เหมาะสมสำหรับหรือใช้ได้ในประเทศอื่นๆ หากท่านใช้เว็บไซต์นี้จากประเทศอื่นๆ ท่านมีความรับผิดชอบในการปฏิบัติตามกฎหมายที่ใช้บังคับในประเทศนั้นๆ

 

เนื้อหาในส่วนใดส่วนหนึ่งหรือหน้าใดหน้าหนึ่งของเว็บไซต์นี้ อาจระบุข้อตกลงและเงื่อนไขการใช้บริการอื่นที่แยกออกไปต่างหาก ในกรณีที่ข้อตกลงและเงื่อนไขการใช้บริการอื่นและข้อตกลงและเงื่อนไขการใช้บริการนี้มีความขัดแย้งกันให้ใช้ข้อตกลงและเงื่อนไขในการใช้บริการที่แยกออกไปนั้น ธนาคาร ขอแนะนำให้ท่านอ่านข้อตกลงและเงื่อนไขการใช้บริการอื่นนั้นก่อนใช้ข้อมูลในหน้านั้นๆ 

 

ไม่มีการรับประกัน 

ธนาคารนำเสนอข้อมูลและส่วนประกอบต่างๆ ที่มีอยู่ในเว็บไซต์นี้เพื่อให้ข้อมูลตามที่ปรากฏอยู่หรือที่มีอยู่เท่านั้น ถึงแม้ธนาคารจะได้ใช้ความพยายามทุกวิถีทางเพื่อทำให้ข้อมูลและส่วนประกอบนั้นมีความถูกต้องมากที่สุด ธนาคารก็ไม่สามารถรับประกันว่าข้อมูลและส่วนประกอบดังกล่าวมีความถูกต้อง สมบูรณ์เพียงพอ ทันกาลทันเวลา เหมาะสมกับวัตถุประสงค์ใดโดยเฉพาะ และปราศจากไวรัส ทั้งนี้ ธนาคารจะไม่รับผิดสำหรับความผิดพลาดหรือการละเว้นใดๆ ในข้อมูลและส่วนประกอบนั้น 

 

ข้อยกเว้น / ข้อจำกัดการใช้บริการ

ธนาคารเป็นเจ้าของลิขสิทธิ์/ได้รับสิทธิในข้อมูลที่แสดง รูปภาพ และรูปแบบการแสดงผลตามที่ปรากฏในเว็บไซต์ทั้งหมด ยกเว้นจะมีการระบุอย่างชัดเจนเป็นอื่น ห้ามมิให้ผู้ใดทำการคัดลอก ทำซ้ำ มีสำเนา สำรองไว้ ทำเลียนแบบ ทำเหมือน ดัดแปลงและ/หรือทำเพิ่มเพื่อนำไปเผยแพร่ หรือใช้ด้วยวัตถุประสงค์อื่นใด โดยปราศจากความยินยอมเป็นลายลักษณ์อักษรจากธนาคาร ทั้งนี้ เว้นแต่จะได้มีการระบุกำหนดไว้ในข้อกำหนดและเงื่อนไขในเว็บไซต์

 

ข้อมูลในเว็บไซต์ อาจมีการแสดงความเห็น ข้อแนะนำ หรือบทความจากหลายแหล่ง กรณีเช่นนี้ ธนาคารไม่ยืนยันความถูกต้องแน่นอน ความน่าเชื่อถือของข้อมูลดังกล่าว ท่านจึงพึงพิจารณาด้วยวิจารณญาณของท่านเอง ธนาคารไม่มีส่วนเกี่ยวข้องและไม่ต้องรับผิดต่อท่านหรือบุคคลใดๆ ที่เกิดความเสียหายทั้งทางตรง ทางอ้อม ความเสียหายพิเศษ ความเสียหายโดยบังเอิญ ความสูญหาย หรือค่าใช้จ่ายใดๆ ที่เกิดขึ้นอันเกี่ยวเนื่องกับการไม่สามารถดำเนินการ ข้อผิดพลาด การงดเว้นการกระทำ การสอดแทรก ความบกพร่อง หรือความล่าช้าในการดำเนินการ หรือการถ่ายโอนข้อมูล ไวรัสคอมพิวเตอร์ การไม่ทำงานของเครือข่ายหรือระบบหรือเว็บไซต์ ทั้งนี้ ถึงแม้ว่าธนาคาร หรือตัวแทนของธนาคารจะได้รับแจ้งถึงความเป็นไปได้ในการเกิดความเสียหาย ความสูญหาย หรือค่าใช้จ่ายต่างๆ ดังกล่าวแล้วก็ตาม 

 

การสมัครใช้บริการผ่านเว็บไซต์ของธนาคาร หรือการใช้บริการเว็บไซต์ของธนาคาร หรือการให้ข้อมูลต่างๆ ของท่านต่อธนาคาร โดยผ่านทางเว็บไซต์และ/หรือทางอีเมล์ ธนาคาร หรือช่องทางอื่นตามที่ธนาคารกำหนด จะถือว่าท่านได้อ่านและตกลงตามข้อกำหนดและเงื่อนไขตามที่ธนาคารกำหนด  การลงทะเบียนกับธนาคาร ท่านจะเป็นผู้มีสิทธิในการที่จะได้รับทราบข้อมูลอันเป็นประโยชน์เกี่ยวกับผลิตภัณฑ์และบริการจากธนาคาร ซึ่งการให้ข้อมูลของท่าน ถือเป็นการตกลงยินยอมให้ธนาคารสามารถนำข้อมูลดังกล่าวไปใช้ประโยชน์ในทางอื่นได้ตามวัตถุประสงค์ที่ธนาคาร เห็นว่าเป็นการเหมาะสม และเป็นประโยชน์ต่อทั้งธนาคาร และท่าน แต่ทั้งนี้จะต้องไม่ขัดกับนโยบายข้อมูลส่วนบุคคล (Data Privacy) ตามที่ปรากฏอยู่ในเว็บไซต์นี้ 

 

การเชื่อมโยงกับเว็บไซต์ของบุคคลที่สามผ่านเว็บไซต์ของธนาคาร เป็นสิ่งที่อยู่ภายใต้ความเสี่ยงของท่านเอง เนื้อหาสาระ ความถูกต้อง การแสดงความคิดเห็น และการเชื่อมต่ออื่นใด ที่จัดสรรขึ้นภายใต้เว็บไซต์นี้ เป็นเพียงการให้บริการเพื่อความสะดวกเท่านั้น ดังนั้น ธนาคารจึงไม่มีอำนาจควบคุม รับรอง ยืนยันความถูกต้องหรือความครบถ้วน หรือความสมบูรณ์ หรือความต่อเนื่อง หรือความเป็นปัจจุบัน ความน่าเชื่อถือ หรือรับผิดชอบในเนื้อหาข้อมูลของเว็บไซต์ของบุคคลที่สาม นอกจากนี้ ข้อมูลดังกล่าวอาจมีข้อจำกัดในการที่ท่านจะนำไปเผยแพร่อีกต่อหนึ่งตามกฎหมายลิขสิทธิ์ ดังนั้น ท่านจะต้องติดต่อขออนุญาตใช้ลิขสิทธิ์ในข้อมูลดังกล่าวจากเจ้าของข้อมูลโดยตรง ทั้งนี้ เงื่อนไขข้อตกลงการใช้บริการ การใช้งานระหว่างประเทศ การตีความ และการบังคับใช้ให้เป็นไปตามกฎหมายของประเทศไทย

รายละเอียดข้อตกลงอื่นๆ

ข้อตกลงและเงื่อนไขเกี่ยวกับบัญชีเงินฝากและบริการด้านการเงินผ่านช่องทางอิเล็กทรอนิกส์`;

export default text;
