export const DATA_KNEE_PAIN = {
  mainMenu: [
    {
      title: 'โรคที่พบบ่อย',
      value: 'kneepain-cause',
      bColor: '#DC7633',
      bgColor: '#F0B27A',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'คำถามที่ต้องเตรียมก่อนมาพบแพทย์',
      value: 'kneepain-questions',
      bColor: '#9B59B6',
      bgColor: '#D7BDE2',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  kneePainQuestion: [
    { id: 0, name: 'ปวดมานานเท่าไหร่ วัน/สัปดาห์/เดือน/ปี' },
    {
      id: 1,
      name:
        'ปวดเข่ากี่ข้าง กรณีปวดข้างเดียวมีอาการปวดตำแหน่งใด ด้านหน้า ด้านใน ด้านนอก ด้านหลัง รอบเข่า',
    },
    { id: 2, name: 'ความรุนแรงของอาการปวด เล็กน้อย/ปานกลาง/รุนแรง' },
    {
      id: 3,
      name:
        'เมื่อคุณเคลื่อนไหว ส่งผลต่ออาการ ปวดอย่างไร เบาลง/มากขึ้น/เท่าเดิม',
    },
    {
      id: 4,
      name:
        'คุณมีอาการอื่นร่วมด้วยหรือไม่ ถ้ามี มีอาการต่อไปนี้หรือไม่ มีไข้ร่วมด้วย มีอาการบวมที่เข่า ร่วมด้วย รู้สึกเข่าอุ่นกว่าปกติ มีอาการแดง บริเวณเข่า',
    },
    {
      id: 5,
      name: 'คุณเคยมีอาการปวดแบบนี้มาก่อน หรือไม่ ถ้ามี เคยรักษามาก่อนหรือไม่',
    },
    {
      id: 6,
      name:
        'มีประวัติบาดเจ็บหรือได้รับอุบัติเหตุ บริเวณเข่า/ขา ในช่วงที่ผ่านมาหรือไม่',
    },
    {
      id: 7,
      name:
        'คุณไม่สามารถลงน้ำหนักได้ เพราะรู้สึกปวดเวลายืน หรือ เดิน ใช่หรือไม่',
    },
    {
      id: 8,
      name: 'มีอาการข้อเข่าติดหรือรู้สึก ลำบากเวลางอหรือยืดเข่าหรือไม่',
    },
    {
      id: 9,
      name:
        'อาการปวดมีการเปลี่ยนแปลงจาก ช่วงแรกที่เป็นอย่างไร เบาลง/มากขึ้น/เท่าเดิม',
    },
  ],

  subCauseMenu: [
    {
      title: 'วัยเด็กวัยผู้ใหญ่',
      value: 'kneepain-cause-adult',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'วัยรุ่น',
      value: 'kneepain-cause-teen',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  adultMenu: [
    {
      title: 'ปวดเข่าด้านหน้า',
      value: 'kneepain-cause-adult-1',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'ปวดเข่าด้านใน​',
      value: 'kneepain-cause-adult-2',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'ปวดเข่าด้านนอก​',
      value: 'kneepain-cause-adult-3',
      bColor: '#a2a7bb',
      bgColor: '#cdced3',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'ปวดเข่าทั่วๆ​',
      value: 'kneepain-cause-adult-4',
      bColor: '#26a872',
      bgColor: '#88c2aa',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  adultMenu1: {
    content: [
      {
        title: 'ความรู้ทั่วไปเกี่ยวกับโรค',
        desc: ['พบได้บ่อยในผู้หญิง', 'วัยกลางคน 25 -40 ปี'],
      },
      {
        title: 'สาเหตุ',
        desc: [
          'มีการใช้งานหัวเข่ามากกว่าปกติ',
          'กล้ามเนื้อรอบเข่าไม่แข็งแรง ไม่กระชับ',
          'อุบัติเหตุ มีการบาดเจ็บที่ผิวสะบ้า',
        ],
      },
      {
        title: 'อาการ',
        desc: [
          'อาการปวดตรงบริเวณด้านหน้าของหัวเข่า ข้างใต้หรือ ขอบๆของลูกสะบ้าหัวเข่า (patella หรือ knee cap)',
          'อาการปวดมักจะเป็นมากหลังจากการเดินขึ้นบันได การนั่งคุกเข่า พับเพียบ',
          'อาการปวดจะมากขึ้น ในท่าที่งอเข่า',
          'มีเสียงดังในเข่า',
          'อาการปวดไม่รุนแรง เป็นๆหายๆ',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'Rest: พักการใช้งาน',
          'Ice: ประคบเย็น ครั้งละประมาณ 20 นาที สามารถทำได้หลายครั้งต่อวัน',
          'Compression: พันรอบเข่าด้วยผ้ายางยืดเพื่อป้องกันการบวม และระวังไม่รัดแน่นจนเกินไปทำให้อาการปวดมากขึ้น',
          'Elevation: นอนยกขาสูง ให้สูงกว่าระดับหัวใจ ทำมากเท่าที่ทำได้',
          'การออกกำลังกายเสริมสร้างความแข็งแรงของกล้ามเนื้อรอบเข่า',
          'เลือกอุปกรณ์กีฬา เช่นรองเท้าวิ่งให้เหมาะสม',
        ],
      },
      {
        title: 'เมื่อไหร่ควรมาพบแพทย์',
        desc: [
          'มีอาการปวดข้อรุนแรงหรืออาการปวดไม่ทุเลาลงหลังจากพยายามรักษาเบื้องต้นแล้ว',
          'บริเวณข้อมีอาการบวม แดง ร้อนมาก',
          'มีอาการอื่นร่วมด้วย ได้แก่ ไข้สูง เบื่ออาหาร น้ำหนักลด',
        ],
      },
    ],
  },

  adultMenu2: {
    content: [
      {
        title: 'ความรู้ทั่วไปเกี่ยวกับโรค',
        desc: [
          'ถุงน้ำทำหน้าที่ช่วยรองรับแรงกระแทก และลดแรงเสียดทานขณะเคลื่อนไหว',
        ],
      },
      {
        title: 'สาเหตุ',
        desc: [
          'การใช้งานเข่าอย่างหนักและต่อเนื่อง',
          'อุบัติเหตุบริเวณข้อเข่าด้านใน',
          'ขาดการยืดกล้ามเนื้ออย่างเหมาะสมก่อนออกกำลังกาย',
          'มีภาวะข้อเข่าเสื่อมหรือเข่าบิดเข้าด้านใน',
        ],
      },
      {
        title: 'อาการ',
        desc: [
          'ปวดมากขึ้นเมื่อขึ้น-ลงบันได',
          'กดเจ็บบริเวณด้านในของหัวเข่า ต่ำกว่าระดับข้อเข่า ประมาณ 5-6 เซนติเมตร',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'Rest: พักการใช้งาน',
          'Ice: ประคบเย็น ครั้งละประมาณ 20 นาที สามารถทำได้หลายครั้งต่อวัน',
          'Compression: พันรอบเข่าด้วยผ้ายางยืดเพื่อป้องกันการบวม และระวังไม่รัดแน่นจนเกินไปทำให้อาการปวดมากขึ้น',
          'Elevation: นอนยกขาสูง ให้สูงกว่าระดับหัวใจ ทำมากเท่าที่ทำได้',
          'การออกกำลังกายเสริมสร้างความแข็งแรงของกล้ามเนื้อรอบเข่า',
          'เลือกอุปกรณ์กีฬา เช่นรองเท้าวิ่งให้เหมาะสม',
        ],
      },
      {
        title: 'เมื่อไหร่ควรมาพบแพทย์',
        desc: [
          'มีอาการปวดข้อรุนแรงหรืออาการปวดไม่ทุเลาลงหลังจากพยายามรักษาเบื้องต้นแล้ว',
          'บริเวณข้อมีอาการบวม แดง ร้อนมาก',
          'มีอาการอื่นร่วมด้วย ได้แก่ ไข้สูง เบื่ออาหาร น้ำหนักลด',
        ],
      },
    ],
  },

  adultMenu3: {
    content: [
      {
        title: 'ความรู้ทั่วไปเกี่ยวกับโรค',
        desc: [
          'เส้นเอ็นที่อยู่บริเวณต้นขาด้านนอก (IT band) เชื่อมกล้ามเนื้อ บริเวณด้านข้างและกล้ามเนื้อก้นด้านข้างยาวลงมาผ่านเข่า และมาเกาะบริเวณด้านข้างของกระดูกหน้าแข้ง',
          'ทุกก้าวที่วิ่ง เส้นเอ็นจะมีการ หด และ ยืด',
        ],
      },
      {
        title: 'สาเหตุ',
        desc: [
          'การใช้งานหนักมากเกินไป การวิ่งเป็นเวลานาน',
          'กล้ามเนื้อสะโพกและกล้ามเนื้อต้นขาขาดความแข็งแรง',
          'การยืดเหยียดกล้ามเนื้อไม่เพียงพอ',
          'ท่าทางการวิ่งไม่ถูกต้อง',
        ],
      },
      {
        title: 'อาการ',
        desc: [
          'ปวดสะโพก มายังต้นขาด้านนอก และบริเวณรอบๆข้างของหัว เข่า',
          'อาการปวดจะมากขึ้นหลังจากเดินลงจากพื้นผิวที่มีลักษณะเป็นทางลาดชัน',
          'อาการปวดจะไม่เกิดขึ้นเมื่องอหัวเข่า',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'Rest: พักการใช้งาน',
          'Ice: ประคบเย็น ครั้งละประมาณ 20 นาที สามารถทำได้หลายครั้งต่อวัน',
          'Compression: พันรอบเข่าด้วยผ้ายางยืดเพื่อป้องกันการบวม และระวังไม่รัดแน่นจนเกินไปทำให้อาการปวดมากขึ้น',
          'Elevation: นอนยกขาสูง ให้สูงกว่าระดับหัวใจ ทำมากเท่าที่ทำได้',
          'การออกกำลังกายเสริมสร้างความแข็งแรงของกล้ามเนื้อรอบเข่า',
          'เลือกอุปกรณ์กีฬา เช่นรองเท้าวิ่งให้เหมาะสม',
        ],
      },
      {
        title: 'เมื่อไหร่ควรมาพบแพทย์',
        desc: [
          'มีอาการปวดข้อรุนแรงหรืออาการปวดไม่ทุเลาลงหลังจากพยายามรักษาเบื้องต้นแล้ว',
          'บริเวณข้อมีอาการบวม แดง ร้อนมาก',
          'มีอาการอื่นร่วมด้วย ได้แก่ ไข้สูง เบื่ออาหาร น้ำหนักลด',
        ],
      },
    ],
  },

  adultMenu4: {
    content: [
      {
        title: 'ความรู้ทั่วไปเกี่ยวกับโรค',
        desc: [
          'ภาวะที่ข้อเข่าเกิดการเสื่อมสภาพลง',
          'ปัจจัยเสี่ยง ได้แก่ อายุมาก, น้ำหนักเยอะ, กรรมพันธ์,การบาดเจ็บของ เข่า, ขาดความแข็งแรงของกล้ามเนื้อรอบเข่า,การใช้งานที่มีแรงกดกับ ข้อเข่ามากๆ เช่น การนั่งยองๆ นั่งสมาธิ นั่งพับเพียบ',
        ],
      },
      {
        title: 'สาเหตุ',
        desc: [
          'เกิดจากกระดูกอ่อนผิวข้อ (Articular cartilage) เกิดการสึกกร่อนอย่าง ต่อเนื่องตามเวลาที่ผ่านไป หรือขอบกระดูกในข้อ (Subchondral bone) เกิดการหนาตัวขึ้น รวมถึงน้ำในไขข้อ (Synovial fluid) ที่เป็นตัวช่วยใน การหล่อลื่นข้อนั้นลดลง',
        ],
      },
      {
        title: 'อาการ',
        desc: [
          'อาการปวด (Pain) อาการปวดแบบตื้อๆ ทั่วเข่า มักเป็นเรื้อรังและมากขึ้น เมื่อมีการใช้งาน อาการทุเลาลงเมื่อมีการนั่งพักหรือหยุดใช้งาน หากการดำเนินโรครุนแรงขึ้นอาจทำให้ปวดตลอดเวลาแม้กลางคืนหรือขณะพัก',
          'ข้อฝืด (Stiffness) มักเป็นตอนเช้าหลังตื่นนอน หรือหลังจากพักการใช้ งาน แต่มักมีอาการไม่เกิน 30 นาที',
          'ข้อบวม ผิดรูป (Swelling/deformity) และอาจพบขาโก่งร่วมด้วย',
          'มีเสียงดังกรอบแกรบ (Crepitus) ในข้อเข่า ขณะเคลื่อนไหว',
          'สูญเสีย การเคลื่อนไหวและการทำงาน ผู้ป่วยมีอาการเดินไม่สะดวก',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พักการใช้งาน',
          'ปรับเปลี่ยนพฤติกรรม หลีกเลี่ยงการนั่งขัดสมาธิ',
          'ลดน้ำหนัก อย่างน้อยร้อยละ 5-10 ของน้ำหนักขณะที่มีอาการปวดข้อ',
          'ออกกำลังกายเพิ่มความแข็งแรงของกล้ามเนื้อบริเวณเข่า โดยเฉพาะ กล้ามเนื้อต้นข',
        ],
      },
      {
        title: 'เมื่อไหร่ควรมาพบแพทย์',
        desc: [
          'มีอาการปวดข้อรุนแรงหรืออาการปวดไม่ทุเลาลงหลังจากพยายามรักษาเบื้องต้นแล้ว',
          'บริเวณข้อมีอาการบวม แดง ร้อนมาก',
          'มีอาการอื่นร่วมด้วย ได้แก่ ไข้สูง เบื่ออาหาร น้ำหนักลด',
        ],
      },
    ],
  },

  teenMenu: [
    {
      title: 'โรคกระดูกสะบ้าเคลื่อน (Patella subluxation)',
      value: 'kneepain-cause-teen-1',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'โรคปวดหน้าแข้ง (Osgood-Schlatters syndrome)',
      value: 'kneepain-cause-teen-2',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'โรคเอ็นสะบ้าอักเสบ (Jumper’s knee)',
      value: 'kneepain-cause-teen-3',
      bColor: '#a2a7bb',
      bgColor: '#cdced3',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  teenMenu1: {
    content: [
      {
        title: 'ความรู้ทั่วไปเกี่ยวกับโรค',
        desc: [
          'อาการของกระดูกสะบ้าเคลื่อนออกจากตำแหน่งปกติ เกิดจากเอ็นรอบข้อหลวมจนเกินไป',
          'พบบ่อยในเด็กและวัยรุ่น โดยเฉพาะเพศหญิง',
        ],
      },
      {
        title: 'สาเหตุ',
        desc: ['ขาดความแข็งแรงของเอ็นและกล้ามเนื้อรอบเข่า'],
      },
      {
        title: 'อาการ',
        desc: [
          'ปวดอย่างรุนแรงบริเวณด้านหน้าของหัวเข่า',
          'ความรู้สึกเจ็บปวดมักเกิดขึ้นทันที',
          'อาจแย่ลงเมื่อมีคนพยายามขยับเข่า',
          'ในรายที่มีอาการรุนแรง อาจมีอาการบวมของเข่าร่วมกับมีน้ำในข้อเป็นสีเลือดซึ่งบอกถึงกระดูกสะบ้าหลุดร่วมกับ มีการ แตกของกระดูกและเลือดออกในข้อ',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พักการใช้งานหัวเข่า 2-3 สัปดาห์',
          'ประคบเย็น ครั้งละประมาณ 20นาที สามารถทำได้หลายครั้งต่อวัน',
          'การออกกำลังกายเสริมสร้างความแข็งแรงของกล้ามเนื้อรอบเข่าหลังจากอาการปวดทุเลาลง',
        ],
      },
      {
        title: 'เมื่อไหร่ควรมาพบแพทย์',
        desc: [
          'อาการปวดขอ้รุนแรงจนไม่สามารถขยับข้อได้หรือไม่สามารถเดินได้ปกติ',
          'อาการปวดเป็นเรื้อรังจนไม่สามารถใช้ชีวิตประจำวันได้ปกติหรือ ออกกำลังกายได้ปกติ',
          'บริเวณข้อมีอาการบวม แดง ร้อนมาก',
          'มีอาการอื่นร่วมด้วย ได้แก่ ไข้สูง เหงื่อออกมากตอนกลางคืน มีผื่นแดงตามตัว กินไม่ค่อยได้ เบื่ออาหาร น้ำหนักลด',
        ],
      },
    ],
  },

  teenMenu2: {
    content: [
      {
        title: 'ความรู้ทั่วไปเกี่ยวกับโรค',
        desc: [
          'มีก้อนปวดบวมใต้เข่าที่ปุ่มกระดูกหน้าแข้ง',
          'พบบ่อยในเด็กชายวัยกำลังเจริญเติบโต 10-15 ปี (Growth spurt) ที่เล่นกีฬาเป็นประจำ',
          'อาการไม่ร้ายแรง',
        ],
      },
      {
        title: 'สาเหตุ',
        desc: [
          'มีการใช้งานที่มากเกินไปทำให้จุดเกาะเส้นเอ็นบริเวณปุ่มกระดูกหน้าแข้งมีการอักเสบเรื้อรัง',
        ],
      },
      {
        title: 'อาการ',
        desc: [
          'อาการปวดเกิดขึ้นระหว่างกิจกรรม เช่น การวิ่ง การคุกเข่า กระโดด นั่งยอง ๆ และการขึ้นบันได',
          'กดเจ็บที่บริเวณกระดูกใต้หัวเข่า (Tibia tubercle)',
          'อาการอาจคงอยู่นานประมาณ 12-18 เดือน',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พักการใช้งานหัวเข่า 2-3 สัปดาห์',
          'ประคบเย็น ครั้งละประมาณ 20นาที สามารถทำได้หลายครั้งต่อวัน',
          'การออกกำลังกายเสริมสร้างความแข็งแรงของกล้ามเนื้อรอบเข่าหลังจากอาการปวดทุเลาลง',
        ],
      },
      {
        title: 'เมื่อไหร่ควรมาพบแพทย์',
        desc: [
          'อาการปวดขอ้รุนแรงจนไม่สามารถขยับข้อได้หรือไม่สามารถเดินได้ปกติ',
          'อาการปวดเป็นเรื้อรังจนไม่สามารถใช้ชีวิตประจำวันได้ปกติหรือ ออกกำลังกายได้ปกติ',
          'บริเวณข้อมีอาการบวม แดง ร้อนมาก',
          'มีอาการอื่นร่วมด้วย ได้แก่ ไข้สูง เหงื่อออกมากตอนกลางคืน มีผื่นแดงตามตัว กินไม่ค่อยได้ เบื่ออาหาร น้ำหนักลด',
        ],
      },
    ],
  },

  teenMenu3: {
    content: [
      {
        title: 'ความรู้ทั่วไปเกี่ยวกับโรค',
        desc: [
          'เส้นเอ็นสะบ้าเกาะใต้กระดูกสะบ้า ทำหน้าที่ช่วยเหยียดข้อเข่า',
          'มักพบในเพศชาย ในนักกีฬาประเภทที่ต้องกระโดดบ่อย เช่น  กระโดดค้ำถ่อ กระโดดไกล วอลเล่ย์บอล บาสเกตบอล',
        ],
      },
      {
        title: 'สาเหตุ',
        desc: [
          'มีการใช้งานที่มากเกินไปทำให้จุดเกาะเส้นเอ็นบริเวณปุ่มกระดูกหน้าแข้งมีการอักเสบเรื้อรัง',
        ],
      },
      {
        title: 'อาการ',
        desc: [
          'กดเจ็บบริเวณจุดต่ำที่สุดของกระดูกลูกสะบ้า',
          'มักมีอาการปวดมากขึ้นระหว่างการทำกิจกรรม เช่น การวิ่ง การกระโดด',
          'อาการอาจปวดได้นานเป็นเดือน',
        ],
      },
      {
        title: 'การรักษาเบื้องต้น',
        desc: [
          'พักการใช้งานหัวเข่า 2-3 สัปดาห์',
          'ประคบเย็น ครั้งละประมาณ 20นาที สามารถทำได้หลายครั้งต่อวัน',
          'การออกกำลังกายเสริมสร้างความแข็งแรงของกล้ามเนื้อรอบเข่าหลังจากอาการปวดทุเลาลง',
        ],
      },
      {
        title: 'เมื่อไหร่ควรมาพบแพทย์',
        desc: [
          'อาการปวดขอ้รุนแรงจนไม่สามารถขยับข้อได้หรือไม่สามารถเดินได้ปกติ',
          'อาการปวดเป็นเรื้อรังจนไม่สามารถใช้ชีวิตประจำวันได้ปกติหรือ ออกกำลังกายได้ปกติ',
          'บริเวณข้อมีอาการบวม แดง ร้อนมาก',
          'มีอาการอื่นร่วมด้วย ได้แก่ ไข้สูง เหงื่อออกมากตอนกลางคืน มีผื่นแดงตามตัว กินไม่ค่อยได้ เบื่ออาหาร น้ำหนักลด',
        ],
      },
    ],
  },
};
