export const DATA_ONCOLOGY = {
  mainMenu: [
    {
      title: 'คำถามสำคัญก่อนมาพบแพทย์',
      value: 'oncology-question',
      bColor: '#DC7633',
      bgColor: '#F0B27A',
      fColor: '#000000',
    },
    {
      title: 'โรคที่พบได้บ่อย',
      value: 'oncology-cause',
      bColor: '#27AE60',
      bgColor: '#ABEBC6',
      fColor: '#000000',
    },
    {
      title: 'แพทย์เฉพาะทางด้านเนื้องอก\nระบบกระดูกและเนื้อเยื่อเกี่ยวพัน',
      value: 'tumor_doctors',
      bColor: '#E74C3C',
      bgColor: '#F1948A',
      fColor: '#000000',
    },
  ],

  oncologyCause: [
    { id: 0, name: 'อายุ 0-10 ปี' },
    { id: 1, name: 'อายุ 10-20 ปี' },
    { id: 2, name: 'อายุ 10-30 ปี' },
    { id: 3, name: 'อายุ 20-40 ปี' },
    { id: 4, name: 'อายุ 30-40 ปี' },
    { id: 5, name: 'อายุ 30-60 ปี' },
    { id: 6, name: 'อายุ 40 ปีขึ้นไป' },
  ],

  oncologyQuestionleMenu: [
    {
      title: 'คลำได้ก้อน',
      value: 'oncology-question-1',
      normal: true,
      expand: false,
      description: [
        'ก้อนมีอาการกดเจ็บ มีอาการบวม แดง ร้อน บริเวณก้อนหรือไม่',
        'เริ่มคลําเจอก้อนตั้งแต่เมื่อใด',
        'ช่วงที่ผ่านมาก้อนมีขนาดโตขึ้นหรือไม่',
        'อยู่บริเวณใดของร่างกาย',
        'อุบัติเหตุนำมาก่อนบริเวณที่มีก้อนหรือไม่',
      ],
    },
    {
      title: 'คลำได้ก้อน',
      value: 'oncology-question-2',
      imageScript: true,
      expand: false,
      description: [
        {
          title: 'อุบัติเหตุนํามาก่อนบริเวณที่มีอาการปวดหรือไม่',
        },
        {
          title: 'ช่วงเวลาที่อาการปวดเป็นมาก',
          desc:
            '\tเช้าหลังตื่นนอน\tระหว่างวัน (อยู่เฉยๆก็ปวด, ปวดมากเมื่อใช้งาน)\tกลางคืน (ปวดมากจนไม่สามารถนอนหลับได้หรือไม่)\tเท่าเดิมตลอดทั้งวัน',
        },
        {
          title: 'ปวดมานานเท่าใด',
          desc:
            'น้อยกว่า 1 วัน\n1 วัน - 1 สัปดาห์\n1 สัปดาห์ - 1 เดือน\n1 เดือน - 1 ปี\nมากกว่า 1 ปี',
        },
        {
          title: 'ความรุนแรงของอาการปวด\n(10 คะแนน คือ ปวดที่สุดในชีวิต)',
          desc:
            '1 - 3 คะแนน ปวดเล็กน้อย\n4 - 6 คะแนน ปวดปานกลาง\n7 - 10 คะแนน ปวดมาก',
        },
        {
          title: 'สามารถบอกจุดที่ปวดได้ชัดเจนหรือไม่ และปวดบริเวณใดของร่างกาย',
        },
        {
          title:
            'เคยมีอาการปวดแบบนี้มาก่อนหรือเคยได้รับการรักษามาก่อนหน้านี้หรือไม่',
          desc: 'เคยมีอาการปวดแบบนี้มาก่อนหรือไม่',
        },
        {
          title: 'ความรุนแรงของอาการปวดในระยะเวลาที่ผ่านมา',
          desc: 'อาการเพิ่มขึ้น คงที่ หรือลดลง',
        },
      ],
    },
    {
      title: 'ร่างกายผิดรูปทรงไปจากปกติ',
      value: 'oncology-question-3',
      normal: true,
      expand: false,
      description: ['มีประวัติกระดูกหักง่ายผิดปกติหรือไม่'],
    },
    {
      title: 'คลำได้ก้อน',
      value: 'oncology-question-4',
      imageScript: true,
      expand: false,
      description: [
        {
          title: 'อาการผิดปกติอื่นๆ',
          desc:
            'มีชา แขนขาอ่อนแรงหรือไม่\nมีไอเรื้อรัง ไอเป็นเลือด น้ำหนักลดลงประวัติใกล้ชิด ผู้ป่วยวัณโรคหรือไม่\nมีไข้สูง หนาวสั่นหรือไม่\nมีเบื่ออาหารน้ำหนักลดลงไม่ทราบสาเหตุหรือไม่',
        },
        {
          title:
            'มีประวัติโรคประจําตัว เช่น โรคกระดูกบาง/พรุน โรคต่อมพาราไทรอยด์ทํางานผิดปกติ โรคไตวายเรื้อรัง โรคตับ โรคกระดูกหักง่ายแต่กําเนิดหรือไม่',
        },
        {
          title: 'มีประวัติโรคมะเร็งภายในครอบครัวหรือไม่',
          desc:
            'ถ้ามี บุคคลนั้นมีฐานะเป็นอะไรกับผู้ป่วยและเป็นมะเร็งที่อวัยวะใด',
        },
        {
          title: 'มีประวัติมะเร็งก่อนหน้านี้หรือไม่',
          desc:
            'ถ้ามีเคยได้รับการรักษาหรือไม่และรักษาด้วยวิธีใด เช่น ฝังแร่ ยาเคมีบำบัด ฉายแสง ผ่าตัด',
        },
        {
          title: 'มีประวัติแพ้ยาแพ้อาหารหรือไม่',
        },
        {
          title: 'ประวัติยาที่ใช้ในปัจจุบัน',
          desc: 'ถ้ามีเป็นยาที่แพทย์สั่งหรือซื้อใช้เอง',
        },
      ],
    },
  ],
};
