export const FEET_AND_ANKLES = {
  mainMenu: [
    {
      title: 'สอบถามอาการเบื้องต้น',
      value: 'feet-question',
      bColor: '#DC7633',
      bgColor: '#F0B27A',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'โรคเกี่ยวกับเท้าและข้อเท้า',
      value: 'feet-cause',
      bColor: '#9B59B6',
      bgColor: '#D7BDE2',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'การดูแลสุขภาพเท้า',
      value: 'feet-selfcares',
      bColor: '#27AE60',
      bgColor: '#ABEBC6',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'แนะนำแพทย์ประจำ\nเท้าและข้อเท้า',
      value: 'foot_doctors',
      bColor: '#E74C3C',
      bgColor: '#F1948A',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  selfcheckQuestions: [
    {
      id: 0,
      name:
        'ประวัติขณะเกิดเหตุ เช่น กีฬาที่เล่น, ท่าทางขณะเกิดเหตุ, ลักษณะขณะเกิดเหตุ, อาการหลังจากเกิดเหตุ',
    },
    { id: 1, name: 'โรคประจําตัว ยาโรคประจําตัวหรือยาที่ทานประจํา' },
    { id: 2, name: 'การรักษาก่อนมารพ. การปฐมพยาบาลเบื้องต้น เช่น ยา, ทําแผล' },
    { id: 3, name: 'ประวัติผ่าตัดในอดีต เช่น ผ่าตัดใส่เหล็กดามกระดูก' },
    {
      id: 4,
      name:
        'ประวัติตั้งครรภ์,ประจําเดือน วันแรกของประจําเดือนครั้งล่าสุด, การคุมกําเนิด',
    },
    { id: 5, name: 'ประวัติแพ้ยาและอาหาร ชื่อยาที่แพ้, อาการขณะแพ้, การรักษา' },
  ],

  feetquestion: [
    {
      title: 'ปวด',
      value: 'feet-ans1',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'บวม',
      value: 'feet-ans2',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'ชา',
      value: 'feet-ans3',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'ผิดรูป',
      value: 'feet-ans4',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'คัน',
      value: 'feet-ans5-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  /** NOTE  ปวด */

  feetquestion_1: [
    {
      title: 'ปวดฉับพลัน\nโดยไม่ทราบสาเหตุ',
      value: 'feet-ans1-1-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'มีไข้',
      value: 'feet-ans1-2',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'ปวดหลังร้าวลงขา',
      value: 'feet-ans1-3-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'ใส่เฝือกอยู่',
      value: 'feet-ans1-4-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'จากอุบัติเหตุ/กีฬา',
      value: 'feet-ans1-5-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  feetquestion_1_2: [
    {
      title: 'มีปวด แดง ร้อน',
      value: 'feet-ans1-2-1',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'ไข้สูง ซึม',
      value: 'feet-ans1-2-2-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  feetquestion_1_2_1: [
    {
      title: 'ที่ขา, น่อง',
      value: 'feet-ans1-2-1-1-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'เฉพาะที่ข้อเท้า',
      value: 'feet-ans1-2-1-2-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  /** NOTE  บวม */

  feetquestion_2: [
    {
      title: '1 ข้าง',
      value: 'feet-ans2-1',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: '2 ข้าง',
      value: 'feet-ans2-2',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  feetquestion_2_1: [
    {
      title: 'มีปวด แดง ร้อน',
      value: 'feet-ans2-1-1',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'จากอุบัติเหตุ/กีฬา',
      value: 'feet-ans2-1-2-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'ใส่เฝือกอยู่',
      value: 'feet-ans2-1-3-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  feetquestion_2_2: [
    {
      title: 'ตั้งครรภ์อยู่',
      value: 'feet-ans2-2-1-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'มีหอบเหนื่อย แน่นหน้าอก',
      value: 'feet-ans2-2-2-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'จากอุบัติเหตุ/กีฬา',
      value: 'feet-ans2-2-3-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  feetquestion_2_1_1: [
    {
      title: 'ที่ขา, น่อง',
      value: 'feet-ans2-1-1-1-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'เฉพาะที่ข้อเท้า',
      value: 'feet-ans2-1-1-2-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  /** NOTE  ชา */

  feetquestion_3: [
    {
      title: '1 ข้าง',
      value: 'feet-ans3-1',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: '2 ข้าง',
      value: 'feet-ans3-2',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  feetquestion_3_1: [
    {
      title: 'ชา, อ่อนแรงแขนขาซีกเดียว/หน้าเบี้ยวพูดไม่ชัด',
      value: 'feet-ans3-1-1-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'ใส่เฝือกอยู่',
      value: 'feet-ans3-1-2-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'มีประวัติใช้ยา\nเคมีบำบัด/ฉายรังสี',
      value: 'feet-ans3-1-3-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  feetquestion_3_2: [
    {
      title: 'ชาปลายนิ้วเท้าทั่วๆ',
      value: 'feet-ans3-2-1-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
    {
      title: 'ชาร้าวลงขา',
      value: 'feet-ans3-2-2-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
      txtStyle: { textAlign: 'center' },
    },
  ],

  /** NOTE  ผิดรูป */

  feetquestion_4: [
    {
      title: 'จากอุบัติเหตุ / กีฬา',
      value: 'feet-ans4-1-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'นิ้วเท้าเบี้ยว',
      value: 'feet-ans4-2',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  feetquestion_4_2: [
    {
      title: 'นิ้วเท้าโก่งงอ',
      value: 'feet-ans4-2-1-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'มีปวดนิ้วเท้า',
      value: 'feet-ans4-2-2-finish',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  /** NOTE โรคเกี่ยวกับเท้าและข้อเท้า */

  feetCauseMenu: [
    {
      title: 'โรครองช้ำ',
      value: 'feet-cause-1',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'นิ้วหัวแม่เท้าเอียง',
      value: 'feet-cause-2',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'ตาปลาที่เท้า',
      value: 'feet-cause-3',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'โรคเก๊าท์',
      value: 'feet-cause-4',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'ข้อเท้าแพลง',
      value: 'feet-cause-5',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'เท้าแบน​',
      value: 'feet-cause-6',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
    {
      title: 'เอ็นร้อยหวายอักเสบ',
      value: 'feet-cause-7',
      bColor: '#edb62d',
      bgColor: '#F8E0A0',
      fColor: '#000000',
    },
  ],

  feetCause_1: [
    {
      title: 'อาการ',
      value: 'feet-cuase1-qa1',
      normal: true,
      expand: false,
      description: [
        'รู้สึกปวดบริเวณส้นเท้าและลามไปที่ฝ่าเท้าได้ ลักษณะจะเป็นปวดจี๊ดๆ หรือบางคนอาจมีอาการแสบร้อนฝ่าเท้า ช่วงแรกมักมีอาการก้าวแรกหลังตื่นนอนตอนเช้าหรือลุกขึ้นเดินหลังจากนั่งเป็นเวลานานๆ อาการจะทุเลาลงเมื่อเดินไปได้สักพัก และกลับมาปวดใหม่เมื่อยืนหรือเดินนานๆ ในช่วงบ่ายของวัน เมื่อมีอาการมากขึ้น อาจมีอาการเจ็บปวดฝ่าเท้าตลอดเวลา หรือเมื่อมีการเคลื่อนไหวได้',
      ],
    },
    {
      title: 'สาเหตุ',
      value: 'feet-cuase1-qa2',
      normal: true,
      expand: false,
      description: [
        'การรับน้ำหนักเป็นเวลานานทําให้เอ็นที่ฝ่าเท้ารับน้ําหนักมาก',
        'น้ําหนักตัวมาก',
        'สวมใส่รองเท้าที่ไม่เหมาะสม เช่น รองเท้าที่ไม่มีพื้นบุรองส้นเท้า',
        'ลักษณะการทํากิจกรรมที่เปลี่ยนไปจากเดิม เช่น เพิ่มระยะทางการวิ่งออกกําลังกาย , การเดิน/วิ่งบนพื้นผิวที่ต่างไปจากเดิมหรือบนพื้นผิวแข็ง (เช่น พื้นซีเมนต์หรือคอนกรีต)',
        'การออกกําลังกายบางชนิดที่ต้องมีการกระโดดหรือกระแทกลงเท้าตลอดเวลา เช่น วิ่ง แบดมินตัน เป็นต้น',
        'เอ็นร้อยหวายยึด ทําให้ส้นเท้าไม่สามารถเคลื่อนไหวได้ตามปกติ',
        'โรคข้ออักเสบรูมาตอยด์',
        'ปัจจัยทางโครงสร้างร่างกาย เช่น เท้าแบนเกินไป อุ้งเท้าโก่งมากเกินไป หรือเส้นเอ็นยึดบริเวณน่อง ทําให้ไม่สามารถเคลื่อนไหวข้อเท้าได้ตามปกติ',
        'โรคประจําตัว เช่น โรคข้อสันหลังอักเสบ หรือข้ออักเสบรูมาตอยด์ อาจมีโอกาสเกิดการอักเสบบริเวณจุดเกาะเส้นเอ็นกับกระดูกได้ง่ายกว่าคนปกติ',
      ],
    },
    {
      title: 'การดูแลตนเองเบื้องต้น',
      value: 'feet-cuase1-qa3',
      option: true,
      expand: false,
      description: [
        {
          title: 'ระยะปวดเฉียบพลัน',
          content: [
            '1. พักการใช้งานเท้า โดยลดกิจกรรมการเดิน หรือใช้ไม้เท้าช่วยพยุง',
            '2. ประคบเย็นฝ่าเท้าบริเวณที่มีอาการปวดหรือบวมประมาณ 10-15 นาที 3-4 ครั้งต่อวัน หรือหลังจากยืนเดินเป็นเวลานานๆ',
            '3. หากมีอาการปวดมาก แพทย์อาจพิจารณารับประทานยาลดปวดต้านการอักเสบกลุ่มที่ไม่ใช่สเตรียรอยด์ (NSAIDs)',
            '4. ทํากายภาพบําบัด โดยใช้เครื่องมือทางกายภาพเพื่อลดปวดและการอักเสบของพังผืดใต้ฝ่าเท้า',
            '5. หากอาการไม่ดีขึ้น ควรพบแพทย์ อาจทําการรักษาโดยการฉีดยาลดการอักเสบบริเวณพังผืดใต้เท้าโดยตรง',
          ],
        },
        {
          title: 'ระยะปวดเรื้อรัง',
          content: [
            `1. บริหารยึดพังผืดใต้ฝ่าเท้าในท่านั่ง\n- ใช้มือข้างจับบริเวณนิ้วเท้าโดยดันนิ้วโป้งเท้ากระดกขึ้น จนฝ่าเท้ามีลักษณะอุ้งเท้าแอ่นและตึง จากนั้นใช้นิ้วหัวแม่มือนวดคลึงบริเวณที่ปวดฝ่าเท้าจนถึงส้นเท้าเบาๆ นาน 15 วินาทีต่อครั้ง 3-5 ครั้งก่อนลุกขึ้นยืนเดิน\n- แช่เท้าในน้ําอุ่นพร้อมทั้งนวดคลึงฝ่าเท้าไปด้วย จะยิ่งทําให้ประสิทธิภาพดีขึ้น\n- อาจประยุกต์ใช้ขวดน้ําใส่น้ําอุ่น วางแนวนอนบนพื้น แล้วใช้ฝ่าเท้ากลิ้งขวดน้ําไปมาก็ได้เช่นกัน`,
            `2. การบริหารยึดเอ็นร้อยหวายหรือกล้ามเนื้อน่อง\n- ในท่านั่ง : หลังตั้งฉากกับพื้น เหยียดขาข้างที่ต้องการจะยืดไปข้างหน้า ใช้ผ้าขนหนูหรือผ้าขาวม้า คล้องใต้ฝ่าเท้า ใช้มือทั้งสองข้างค่อยๆ ดึงชายผ้าเข้าหาตัว ในลักษณะข้อเท้ากระดกขึ้นและไม่งอเข่า จนรู้สึกตึงบริเวณกล้ามเนื้อน่อง ครั้งละ 15-20 วินาทีต่อครั้ง 5 ครั้งต่อเซต 3 เซตต่อวัน\n- ในท่ายืน : ยืนหันหน้าเข้ากําแพง ห่างประมาณ 1 ช่วงแขน โดยเอาฝ่ามือเท้าทั้ง 2 ข้างยันกําแพงไว้ แล้วถอยเท้าข้างที่ต้องการยึดกล้ามเนื้อน่องไปข้างหลัง ย่อขาข้างหน้าลงช้าๆ โดยไม่งอเข่าของขาหลัง ปลายเท้าชี้ตรงไปด้านหน้า ไม่เปิ ดส้น จนรู้สึกตึงบริ เวณกล้ามเนื้อน่องของขาด้านหลัง ทําครั้งละ 15-20 วินาทีต่อครั้ง 5 ครั้งต่อเซต 3 เซตต่อวัน`,
            `3. การบริหารเสริมสร้างความแข็งแรงของกล้ามเนื้อเท้า\n- ใช้นิ้วเท้า ขยุ้มผ้าขนหนูผืนเล็กบนพื้น 8-10 ครั้งต่อเซต, 1-2 เซตต่อวัน`,
            `4. การใส่อุปกรณ์พยุงส้นหรืออุ้งเท้า โดยใช้แผ่นเสริมรองเท้าที่อ่อนนุ่ม หรือสวมรองเท้าที่เหมาะสมกับรูปเท้าตนเอง โดยแพทย์จะพิจารณาจากภาวะผิดปกติของรูปเท้าหรือผู้ที่มีความจําเป็น มีอาชีพที่ไม่สามารถหลีกเลี่ยงการยืนหรือเดินนานๆได้`,
            '5. โดยส่วนใหญ่ โรครองช้ําสามารถรักษาได้โดยไม่จําเป็นต้องผ่าตัด เนื่องจากเสี่ยงต่อภาวะแทรกซ้อน เช่น การติดเชื้อ การเจ็บปวดต่อเนื่อง หรืออาจเกิดความเสียหายต่อประสาทรับความรู้สึกบริเวณใต้ฝ่าเท้า ทําให้มีอาการชาหรือแสบร้อนบริเวณฝ่าเท้าได้',
          ],
        },
        {
          title: 'สําหรับนักวิ่ง',
          content: [
            `สําหรับนักวิ่งที่เป็นโรครองช้ําแล้วต้องการกลับไปออกกําลังกายโดยการวิ่งอีกครั้ง ขึ้นอยู่กับความรุนแรงของตัวโรค และการฟื้นตัวหลังการอักเสบในแต่ละบุคคล นักวิ่งบางคนสามารถเริ่มกลับไปวิ่งแม้ว่าจะยังหลงเหลืออาการปวดตึงบริเวณฝ่าเท้าอยู่เล็กน้อยได้ โดย`,
            `1. ค่อยๆ ไต่ระดับความเร็วและระยะเวลาในการวิ่งที่ไม่ทําให้อาการเจ็บเป็นมากขึ้น`,
            `2. พื้นผิวที่วิ่ง เริ่มจากพื้นหญ้า ลู่วิ่งสายพาน แล้วค่อยเป็นพื้นผิวที่แข็งขึ้น เช่น พื้นปูนหรือซีเมนต์`,
            `3. ทํากายภาพบําบัด และการบริหารร่างกายเพื่อเพิ่มความยืดหยุ่นและความแข็งแรงของกล้ามเนื้อขาและเท้า`,
            `4. ใส่รองเท้าสําหรับวิ่งที่เหมาะสม`,
            `5. อย่าเริ่มวิ่งหลังอาการทุเลาเร็วเกินไป หนักเกินไป และความเร็วในการวิ่งมากเกินไป ต้องรู้ลิมิตของตัวเอง ควรค่อยๆ เริ่มวิ่งทีละน้อย และไม่ฝืนวิ่งต่อหากมีอาการเจ็บฝ่าเท้ามากขึ้น`,
          ],
        },
      ],
    },
    {
      title: 'การป้องกัน',
      value: 'feet-cuase1-qa4',
      normal: true,
      expand: false,
      description: [
        'ปรับเปลี่ยนลักษณะงานหรือหลีกเลี่ยงกิจกรรมที่ต้องยืนหรือเดินเป็นเวลานานๆ',
        'บริหารร่างกายโดยการยึดกล้ามเนื้อน่องและพังผืดใต้ฝ่าเท้าอย่างสม่ําเสมอ',
        'ใส่รองเท้าที่กระชับพอดี  ไม่บีบรัดเท้าหรือหลวมเกินไป ส้นไม่สูงจนเกินไป และมีแผ่นรองเท้าที่พยุงฝ่าเท้าอย่างเหมาะสม',
      ],
    },
  ],

  feetCause_2: [
    {
      title: 'อาการ',
      value: 'feet-cuase2-qa1',
      normal: true,
      expand: false,
      description: [
        'โคนนิ้วหัวแม่เท้าด้านนอกปูดเป็นปุ่ม',
        'โคนนิ้วหัวแม่เท้าบวม แดง หรือปวด',
        'รู้สึกปวดเท้าเป็นพักๆ หรือปวดไม่ยอมหาย',
        'หนังบริเวณโคนนิ้วหัวแม่เท้าหนาขึ้น',
        'ขยับนิ้วหัวแม่เท้าได้เล็กน้อย ทําให้เดินได้ลําบาก',
      ],
    },
    {
      title: 'สาเหตุ',
      value: 'feet-cuase2-qa2',
      normal: true,
      expand: false,
      description: [
        'โครงสร้างเท้าที่ผิดปกติซึ่งมักเป็นพันธุกรรม เช่น เท้าแบน หรือกระดูกนิ้วหัวแม่เท้ามีการเอียงออกเอง',
        'การสวมรองเท้าส้นสูงหรือรองเท้าที่มีหัวรองเท้าแคบ ไม่ได้เป็นสาเหตุที่ทําให้เกิดภาวะนิ้วหัวแม่เท้าเอียง แต่เป็นเพียงปัจจัยที่ทําให้อาการแย่ลงเท่านั้น',
      ],
    },
    {
      title: 'การวินิจฉัย',
      value: 'feet-cuase2-qa3',
      normal: true,
      expand: false,
      description: [
        'วินิจฉัยการตรวจดูลักษณะของเท้าภายนอก',
        'ยืนยันผลการวินิจฉัยด้วยการเอกซเรย์เพิ่มเติม',
      ],
    },
    {
      title: 'การรักษา',
      value: 'feet-cuase2-qa4',
      normal: true,
      expand: false,
      description: [
        'การรักษาภาวะนิ้วหัวแม่เท้าเอียงขึ้นอยู่กับความรุนแรงของอาการปวด และแรงกดที่หัวแม่เท้า',
        'เปลี่ยนรูปทรงรองเท้าที่สวม',
        'ใช้แผ่นพยุงเท้าช่วยประคองบริเวณที่มีอาการ',
        'รับประทานยาระงับปวด',
        'หลีกเลี่ยงกิจกรรมที่ทําให้อาการแย่ลง',
        'ใช้น้ำแข็งประคบบรรเทาอาการปวดและอักเสบ หากใช้วิธีต่างๆ ดังกล่าวแล้วอาการยังไม่ดีขึ้น ยังมีอาการปวดอยู่ หรือส่งผลให้ไม่สามารถใช้ชีวิตได้ตามปกติ ควรมาพบแพทย์',
      ],
    },
    {
      title: 'ภาวะแทรกซ้อน',
      value: 'feet-cuase2-qa5',
      normal: true,
      expand: false,
      description: [
        'ถุงน้ำป้องกันการเสียดสีอักเสบ (bursitis)',
        'นิ้วเท้าหงิกงอผิดปกติ (hammer toe) โดยมีสาเหตุจากข้อต่อตรงกลางนิ้วโค้งงอผิดปกติ ทําให้ปวดได้',
        'อาการปวดและการอักเสบที่ฝ่าเท้า',
      ],
    },
    {
      title: 'การป้องกัน',
      value: 'feet-cuase2-qa6',
      normal: true,
      expand: false,
      description: ['เลือกสวมรองเท้าที่หัวกว้างหรือไม่บีบรัดจนเกินไป'],
    },
  ],

  feetCause_3: [
    {
      title: 'อาการ',
      value: 'feet-cuase3-qa1',
      normal: true,
      expand: false,
      description: [
        'มีตุ่มหนา แข็ง หรือหยาบที่ผิวหนัง แห้งเป็นขุยหรือมีผิวคล้ายกับขี้ผึ้งอาจมีวงสีเหลืองอยู่รอบ ๆ ตรงกลางที่มึความแข็งและเป็นสีเทา',
        'กดแล้วเจ็บ',
        'ตาปลาที่ยังนิ่มจะมีลักษณะคล้ายกับแผล',
        'โดยส่วนใหญ่แล้วถ้าอยู่เฉย ๆ แล้วตาปลาจะไม่ทําให้เกิดความเจ็บปวด แต่จะเกิดความเจ็บปวดขึ้นเมื่อกด เช่น เวลาที่ต้องเดินหรือเวลาที่สวมใส่รองเท้า นอกจากนั้นอาจจะท าให้ใส่รองเท้าให้พอดีได้ลําบาก',
        'ตาปลามักเกิดขึ้นบริเวณด้านบนเท้าและด้านข้างนิ้วเท้า หรืออยู่ระหว่างนิ้วเท้า',
      ],
    },
    {
      title: 'สาเหตุ',
      value: 'feet-cuase3-qa2',
      normal: true,
      expand: false,
      description: [
        'สวมใส่รองเท้าที่ไม่พอดีหรือหลวมเกินไปทําให้เท้าเลื่อนถูไปมาจนเกิดการเสียดสี',
        'สวมใส่รองเท้าประเภทที่มีการบีบรัดเท้าจนเกินไป เช่น รองเท้าส้นสูงที่บีบหน้าเท้า',
        'ยืนเป็นเวลานาน ๆ',
        'สวมใส่รองเท้าโดยไม่ได้ใส่ถุงเท้า ทําให้เกิดการเสียดสีที่เท้า หรือการใส่ถุงเท้าที่ไม่พอดี',
        'ผิวแห้ง ไม่ใส่รองเท้า',
        'ผู้ที่ต้องถือของหนักเป็นประจํา',
        'การเล่นกีฬาที่เพิ่มแรงกดดันหรือการเสียดสีที่เท้า',
        'ผู้สูงอายุที่มีชั้นไขมันที่ผิวหนังน้อย',
      ],
    },
    {
      title: 'การวินิจฉัย',
      value: 'feet-cuase3-qa3',
      normal: true,
      expand: false,
      description: [
        'ประเมินดูตาปลาและถามประวัติเกี่ยวกับอาชีพ งานอดิเรก หรือรองเท้าที่ชอบใส่เป็นประจํา',
        'การตรวจร่างกาย เพื่อแยกโรค หูดและซีสต์ เพื่อการรักษาที่ถูกต้อง',
        'การเอกซเรย์ (X-ray) แพทย์อาจแนะนําให้ทําการเอกซเรย์เพื่อหาความผิดปกติทางกายภาพที่ทําให้เกิดตาปลา เช่น ผู้ที่มีปัญหาเกี่ยวกับกระดูก กระดูกผิดรูป',
      ],
    },
    {
      title: 'การรักษา',
      value: 'feet-cuase3-qa4',
      normal: true,
      expand: false,
      description: [
        'หลีกเลี่ยงพฤติกรรมซ้ำ ๆ ที่ทําให้เกิดแรงกดหรือการเสียดสี ซึ่งเป็นสาเหตุของตาปลาตามที่กล่าวไว้ข้างต้น',
        'สวมใส่รองเท้าให้มีความพอดี ใช้แผ่นป้องกันการเสียดสี การสวมใส่ถุงมือหรือถุงเท้าเพื่อปกป้องผิวหนัง ลดการเสียดสี',
        'ผลิตภัณฑ์ที่ใช้รักษาตามเคาน์เตอร์ทั่วไป เช่น แผ่นปิดตาปลา แต่จะไม่สามารถรักษาที่ต้นเหตุของตาปลาและอาจส่งผลกระทบต่อผิวหนังที่ปกติรอบๆ ตาปลาได้',
        'หากพยายามดูแลรักษาด้วยตัวเองแล้วอาการยังไม่ดีขึ้น หรือมีความเจ็บปวดมากขึ้น ควรมาพบแพทย์',
      ],
    },
    {
      title: 'ภาวะแทรกซ้อน',
      value: 'feet-cuase3-qa5',
      normal: true,
      expand: false,
      description: [
        'กลับมาเป็นใหม่ หรือเป็นตาปลาที่ขนาดใหญ่ขึ้น',
        'ตาปลาเป็นแผลติดเชื้อ หรือเป็นแผลหลังตาปลาหาย',
      ],
    },
    {
      title: 'การป้องกัน',
      value: 'feet-cuase3-qa6',
      normal: true,
      expand: false,
      description: [
        'เลือกรองเท้าที่พอดี ไม่คับหรือหลวมจนเกินไป มีพื้นที่สําหรับให้นิ้วเท้าขยับได้ในช่วงของหน้ารองเท้ากับนิ้วเท้าที่ยาวที่สุด',
        'เลือกซื้อรองเท้าในช่วงเวลาบ่าย เพราะเท้ากําลังขยายตัวเต็มที่ ซึ่งรองเท้าที่เลือกซื้อแล้วใส่ได้อย่างพอดีในช่วงเวลานี้จะทกให้ใส่ได้สบายที่สุด',
        'หลีกเลี่ยงการใส่รองเท้าส้นสูงเพราะจะเพิ่มแรงกดบริเวณที่ด้านหน้าเท้า',
        'ใช้ครีมบํารุงสําหรับเท้าโดยเฉพาะ หลังจากที่อาบน้ําเสร็จหรือหลังล้างเท้า',
        'หากมีอาการปวดเท้า ควรไปหาผู้เชี่ยวชาญด้านเท้าหรือแพทย์โดยตรง',
      ],
    },
  ],

  feetCause_4: [
    {
      title: 'คืออะไร?',
      value: 'feet-cuase4-qa1',
      normal: true,
      expand: false,
      description: [
        ' เป็นหนึ่งในโรคข้ออักเสบที่เกิดจากการสะสมของผลึกกรดยูริกตามข้อต่างๆ ทําให้มีอาการปวดแสบร้อน บวม แดงตามข้อต่ออย่างเฉียบพลันเป็นระยะๆ ซึ่งอาจเกิดขึ้นกับข้อต่อเดียวหรือหลายข้อต่อพร้อมกันก็ได้',
      ],
    },
    {
      title: 'อาการ',
      value: 'feet-cuase4-qa2',
      normal: true,
      expand: false,
      description: [
        'อาการที่พบได้บ่อยที่สุดคือ ปวดอย่างรุนแรงตามข้อต่อ โดยเฉพาะนิ้วหัวแม่เท้า แต่ก็สามารถเกิดกับข้อต่อหลายส่วนตามร่างกายได้ เช่น ข้อเท้า ข้อศอก หัวเข่า ข้อต่อกระดูกมือ หรือข้อมือ โดยจะปวดรุนแรงในช่วง 4-12 ชั่วโมงแรก จากนั้นจะเริ่มปวดน้อยลงและมีอาการดีขึ้นภายใน 7-10 วัน บางรายอาจมีอาการปวดได้นานหลายวันจนถึงหลายสัปดาห์',
        'บวมแดง แสบร้อน ตามข้อต่างๆ',
        'เคลื่อนไหวร่างกายไม่สะดวก',
      ],
    },
    {
      title: 'สาเหตุ',
      value: 'feet-cuase4-qa3',
      normal: true,
      expand: false,
      description: [
        'เป็นผลมาจากภาวะกรดยูริกในเลือดสูง (Hyperuricemia) ซึ่งเป็นภาวะของร่างกายที่มีการสะสมของกรดยูริกในปริมาณที่มากเกินไป ทําให้เกิดการตกผลึกตามข้อต่างๆ จนเกิดอาการปวดบวมตามข้ออย่างรุนแรงและอาการอื่นๆ ของโรคตามมา',
      ],
    },
    {
      title: 'ปัจจัยเสี่ยงในการเกิดโรค',
      value: 'feet-cuase4-qa4',
      normal: true,
      expand: false,
      description: [
        'การดื่มแอลกอฮอล์อย่างหนัก',
        'การรับประทานอาหารทีมีสารพิวรีนมากเกินไป เช่น สัตว์ปีก เครื่องในสัตว์ ยอดผัก กุ้งเคยหรือกะปิ  ปลาซาร์ดีน หอยแมลงภู่ สารสกัดจากยีสต์',
        'ได้รับวิตามินซีไม่เพียงพอ',
        'การดื่มน้ําอัดลมมากเกินไป',
        'อาการเจ็บป่วยที่มีผลต่อการเปลี่ยนแปลงเซลล์ในร่างกายอย่างรวดเร็ว เช่น โรคสะเก็ดเงินขั้นรุนแรง หรือความผิดปกติทางเลือดบางอย่าง',
        'ยาบางประเภทที่ส่งผลต่อระดับกรดยูริกในร่างกาย เช่น ยาขับปัสสาวะ  ยาเคมีบําบัดบางชนิด ยาแอสไพริน และยาลดความดันโลหิตบางชนิด',
        'โรคประจําตัวหรือสภาวะของร่างกายบางอย่าง เช่น ภาวะอ้วน โรคความดันโลหิตสูง ไขมันในเลือดผิดปกติ ไตทํางานผิดปกติ โรคเบาหวาน โรคพร่องเอนไซม์ ความผิดปกติของไขกระดูก โรคหลอดเลือดผิดปกติ',
      ],
    },
    {
      title: 'การดูแลตนเองเบื้องต้น',
      value: 'feet-cuase4-qa5',
      normal: true,
      expand: false,
      description: [
        'ดื่มน้ํามากๆ เพื่อช่วยให้ร่างกายขับกรดยูริกออกทางปัสสาวะ และไม่ทําให้เกิดการตกตะกอนในระบบทางเดินปัสสาวะที่นําไปสู่การเกิดนิ่วในไต',
        'หลีกเลี่ยงเครื่องดื่มแอลกอฮอล์',
        'หลีกเลี่ยงการดื่มนํา้อัดลมหรือเครื่องดื่มที่มีความหวานมาก โดยเฉพาะเครื่องดื่มที่มีส่วนผสมของน้ําตาลฟรุกโตส',
        'หลีกเลี่ยงการรับประทานอาหารที่มีกรดยูริกสูง เช่น เครื่องในสัตว์ อาหารทะเล สัตว์ปีก ถั่วบางชนิด สารสกัดจากยีสต์ แต่อาจทดแทนด้วยโปรตีนที่ได้จากผลิตภัณฑ์นมที่มีไขมันต่ํา',
        'ผู้ที่มีภาวะอ้วนควรลดน้ําหนักให้อยู่ในเกณฑ์มาตรฐาน แต่ไม่ควรอดอาหารหรือลดน้ําหนักรวดเร็วจนเกินไป',
        'มีประวัติบุคคลในครอบครัวเป็นโรคเก๊าท์ โดยพบว่า 1 ใน 5 ของผู้ป่วยโรคเก๊าจะมีบุคคลในครอบครัวเป็นโรคนี้',
      ],
    },
  ],

  feetCause_5: [
    {
      title: 'การดูแลเบื้องต้นก่อนพบแพทย์',
      value: 'feet-cause-5-selfcare',
      bColor: '#5BC2C3',
      bgColor: '#79e0e0',
      fColor: '#000000',
    },
  ],

  feetCause_5_self: {
    content: [
      {
        title: 'หยุดใช้งานส่วนของร่างกาย',
        desc: [
          'หยุดใช้งานส่วนของร่างกายที่ได้รับบาดเจ็บทันที โดยเฉพาะช่วง 6 ชั่วโมงแรกของการบาดเจ็บ จนถึง 48 ชั่วโมง ก่อนที่จะมีการเริ่มเคลื่อนไหวอีกครั้ง',
        ],
      },
      {
        title: 'การประคบเย็น',
        desc: [
          'การประคบเย็น เพื่อลดการมีเลือดออกบริเวณเนื้อเยื่อ ลดบวม และอาการปวด โดยทั่วไปควรประคบเย็นครั้งละ 10-20 นาที หยุดประคบ 5 นาที วันละ 2 – 3 ครั้ง ทําเช่นนี้ไปเรื่อยๆ จนกระทั่งไม่บวม อุปกรณ์ประคบเย็น ได้แก่ ถุงเย็น (ice pack) ซึ่งจะคงความเย็นประมาณ 45-60 นาที และต้องมีผ้าห่อไว้ไม่ให้ถุงเย็นสัมผัสโดยตรงกับผิวหนัง หากไม่มีถุงเย็นหรือบริ เวณของการบาดเจ็บกว้างเกินขนาดของถุงเย็น สามารถใช้ถุงใส่น้ําแข็งหรือผ้าชุบน้ําเย็น นอกจากนี้ยังมีการพ่นด้วยสเปรย์เย็น (cooling spray) อาจใช้ลดปวดเฉพาะที่ได้ชั่วคราว สามารถใช้ได้กับบริเวณที่เนื้อเยื่อใต้ผิวหนังไม่หนา เช่น คาง สันหมัด ข้อเท้า',
        ],
      },
      {
        title: 'พันผ้ายืด',
        desc: [
          'พันผ้ายืด เพื่อกดไม่ให้มีเลือดออกในเนื้อเยื่อมาก การพันผ้ายืดควรพันให้กระชับส่วนที่บาดเจ็บ และควรใช้ผ้าสําลีผืนใหญ่รองไว้ให้หนาๆ ก่อนพันด้วยผ้ายืด ควรพันผ้ายืดคลุมเหนือและใต้ต่อส่วนที่บาดเจ็บ ซึ่งมักใช้ร่วมกับการประคบเย็น',
        ],
      },
      {
        title: 'ยกส่วนของร่างกาย',
        desc: [
          'ยกส่วนของร่างกายที่ได้รับบาดเจ็บให้สูงกว่าระดับหัวใจ เพื่อให้เลือดไหลกลับสู่หัวใจได้สะดวก ช่วยลดการกดของน้ํานอกเซลล์ที่หลั่งออกมาสู่เนื้อเยื่อบริเวณนั้นทําให้ลดการบวมลงได้ โดยการนอนวางขาหรือเท้าบนหมอน หรือนั่งโดยวางเท้าบนเก้าอี้  หากบาดเจ็บรุนแรงควรยกสูงไว้ประมาณ 24-48 ชั่วโมง',
        ],
      },
    ],
  },

  feetCause_6: {
    content: [
      {
        title: 'คืออะไร',
        desc: [
          'คือภาวะที่มีอุ้งเท้าด้านในเพียงเล็กน้อยหรือไม่มีเลย อาจพบส้นเท้าเอียงออก ไม่ถือว่าเป็นโรค พ่อแม่มักกังวล ให้ติดตามดูพบว่าโตขึ้นถึง 4 ขวบ อุ้งเท้าจะสูงขึ้น อายุ 7-8 ขวบจะปกติได้ หากโตขึ้นไม่ทุเลา เป็นพันธุกรรม จะปวดอุ้งเท้า ปวดส้นเท้า อาการมากขึ้นเมื่อยืนลงน้ำหนัก',
        ],
      },
      {
        title: 'การรักษา',
        desc: [
          'เท้าแช่น้ำอุ่น นวดเท้า เพื่อลดอาการปวด',
          'เลือกใช้รองเท้าที่เหมาะสม เสริมอุ้งเท้า โครงแข็งแรงและกระชับรัดส้นเท้า',
        ],
      },
    ],
  },

  feetCause_7: {
    content: [
      {
        title: 'อาการ',
        desc: [
          'ปวดหลังส้นเท้า มักปวดมากในตอนเช้าและเมื่อเดินไกลหรือขึ้นลงบันได',
          'มักเกิดจากการกระโดด การเล่นกีฬาหนักๆ ขึ้นลงบันไดมากๆ',
          'ตรวจพบเอ็นร้อยหวายบวมแดง',
        ],
      },
      {
        title: 'การรักษา',
        desc: [
          'หยุดพักประคบเย็น พันผ้ายืด ยกสูง (อาจให้ยาลดการอักเสบ)',
          'ใช้รองเท้าส้นสูงเล็กน้อย เพื่อลดแรงกด ปรับยืดเอ็นร้อยหวาย',
          'บริหารเพิ่มความแรงกล้ามเนื้อ',
        ],
      },
    ],
  },

  feetSalfCare: {
    content: [
      {
        title: 'ใส่รองเท้าเหมาะสมกับกิจกรรมและถูกสุขลักษณะ',
        desc: [
          'ไม่คับหรือหลวมเกินไป',
          'ไม่มีส่วนของรองเท้ากดหรือเสียดสีกับเท้า',
        ],
      },
      {
        title: 'บริหารเท้าและข้อเท้า',
        desc: [
          'กระดกข้อเท้าขึ้นและลงสลับกันช้าๆ',
          'หมุนข้อเท้าเข้าและออกช้าๆ',
          'ใช้นิ้วเท้าจิกผ้าที่วางบนพื้นเพื่อบริหารกล้ามเนื้อเล็กๆในเท้า',
          'นั่งยกขาขึ้น เหยียดเข่าตึง กระดกข้อเท้าขึ้นค้างไว้ นับ 1-6 ในใจ',
        ],
      },
      {
        desc: [
          'ล้างเท้าด้วยสบู่อ่อนๆและเช็ดให้แห้งโดยเฉพาะซอกนิ้วเท้า',
          'ตัดเล็บให้ถูกต้อง ตามแนวขอบเล็บเท่านั้น',
          'ใส่ถุงเท้านอน หากอากาศเย็น',
        ],
      },
    ],
  },
};
