export const DATA_ELBOW = {
  selfcheckQuestions: [
    { id: 0, name: 'ระยะเวลาเริ่มเกิดอาการ' },
    { id: 1, name: 'ระดับความปวด' },
    { id: 2, name: 'ปวด ชา ร้าวไปตำแหน่งอื่นไหม' },
    { id: 3, name: 'บวมแดงร้อนที่ศอก มีไข้' },
    { id: 4, name: 'ปวดกลางคืน น้ำหนักลด เบื่ออาหาร' },
    { id: 5, name: 'โรคประจำตัว' },
    { id: 6, name: 'แพ้ยา แพ้อาหาร' },
    { id: 7, name: 'อาชีพ ปวดสัมพันธ์กับการใช้งาน' },
    { id: 8, name: 'ประวัติอุบัติเหตุ หรือ ศอกเคลื่อน' },
    { id: 9, name: 'กีฬาที่เล่นเป็นประจำ' },
  ],

  tips: [
    {
      id: 0,
      title: 'กายภาพบำบัด',
      content: [
        '1.) ประคบเย็น ลดการอักเสบ โดยการใช้ถุงน้ำเเข็งห่อผ้าขนหนู / แผ่นเจลเย็น 10-15 นาที วันละ 3-5 ครั้ง',
        '2.) ประคบร้อน ลดปวด ลดการตึงตัวของกลางเนื้อ โดยการใช้ผ้าชุบน้ำอุ่น กระเป๋าน้ำร้อน 10-15 นาที ใช้หลังอาการอักเสบหายดี',
      ]
    },
    {
      id: 1,
      title: 'การฟื้นฟู ออกกำลัง',
      content: [
        '1.) การยึดเหยียดกล้ามเนื้อ โดยการกระดกข้อมือขึ้นลงขณะที่ทำข้อศอกควรเหยียดตรง ในการทำแต่ละครั้งให้ค้างไว้ 20-30 วินาที ทำซ้ำ 5-10 ครั้ง ทำอย่างน้อยวันละ 2 ครั้ง',
        '2.) การเพิ่มความแข็งแรงของกล้ามเนื้อ กระดกข้อมือขึ้นลงโดยนั่งบนเก้าอีถือดรัมเบลหนักขนาด 5 กิโลกรัมไว้ในมือวางแขนบนขาหรือบนโต๊ะกระดกข้อมือขึ้นลงช้าๆ บริหารมือโดยกำลูกบอลยางหรือลูกเทนนิสไว้ในมือแล้วพยายามบีบค้างไว้ 25 วินาที',
      ]

    },
    {
      id: 2,
      content: ['พักการใช้งาน หลีกเลี่ยงยกของหนัก ลดท่าทางที่ต้องงอศอก',]
    },
    {
      id: 3,
      content: ['การใส่อุปกรณ์พยุง เช่น Counterforce bracing จะช่วยลดและกระจายแรงที่กระทบข้อศอกได้',
      ]
    },
  ],

  causes: [
    {
      id: 0,
      name: 'ปวดด้านหน้าข้อศอก (Anterior)',
      source: require('../images/anterior.jpg'),
      option: 'elbow-anterior',
    },
    {
      id: 1,
      name: 'ปวดด้านหลังข้อศอก (Posterior)',
      source: require('../images/lateral.jpg'),
      option: 'elbow-posterior',
    },
    {
      id: 2,
      name: 'ปวดด้านข้างส่วนนอกข้อศอก (Lateral)',
      source: require('../images/medial.jpg'),
      option: 'elbow-lateral',
    },
    {
      id: 3,
      name: 'ปวดด้านข้างส่วนในข้อศอก (Medial)',
      source: require('../images/posterior.jpg'),
      option: 'elbow-medial',
    },
  ],

  /** NOTE Elbow anterior */

  distal: {
    content: [
      {
        title: 'คืออะไร',
        content: ['กล้ามเนื้อไบเซพเป็นกล้ามเนื้อที่วางตัวอยู่บริเวณกระดูกต้นแขน มีส่วนปลายเอ็นกล้ามเนื้อไปเกาะด้านหน้าของกระดูกปลายแขนส่วนต้น หน้าที่งอศอกและการหมุนของปลายแขนโดยมีข้อศอกเป็นจุดหมุน']
      },
      {
        title: 'สาเหตุ',
        content: ['พบได้บ่อยจากการใช้งานมากเกินไปในท่างอข้อศอก เช่น ยกน้ำหนัก dumbbell ที่หนักมากเกินไปในท่า dumbbell curl']
      },
      {
        title: 'อาการ',
        content: [
          'มีเสียงดังป๊อบที่บริเวณด้านหน้าข้อศอก',
          'มีอาการปวดรุนแรงทันทีโดยอาการปวดจะลดลงรวดเร็วเมื่อเอ็นกล้ามเนื้อขาดเพิ่มขึ้นเนื่องจากแรงตึงกล้ามเนื้อลดลง',
          'บวม ช้ำมากขึ้นที่บริเวณด้านหน้าของข้อศอก หรือ ด้านหน้าต้นแขน',
          'การทํางานกล้ามเนื้ออ่อนเเรงลง เช่น ท่างอศอก, หมุนปลายแขน',
        ]
      }
    ],
  },

  pronator: {
    content: [
      {
        title: 'คืออะไร',
        content: ['คือ ภาวะที่มีการกดเส้นประสาททมีเดียนที่ด้านหน้าบริเวณข้อศอก']
      },
      {
        title: 'สาเหตุ',
        content: ['มีหลากหลายเช่น จากปุ่มกระดูก เยื่อผังผืด เส้นเอ็น กล้ามเนื้อ ไปกดเบียดเส้นประสาท']
      },
      {
        title: 'อาการ',
        content: [
          'ปวดบริเวณศอกด้านหน้า',
          'ชาและปวดไฟฟ้าซ็อตร้าวไปนิ้วมือโป้ง ชี้ กลาง ครึ่งหนึ่งของนิ้วนางได้ รวมไปถึงชาที่ฝ่ามือ',
          'เป็นนานๆมีการอ่อนแรงและการฝ่อลีบของกล้ามเนื้อมือได้',
        ]
      }
    ],
  },

  /** NOTE Elbow posterior */

  olecranon: {
    content: [
      {
        title: 'คืออะไร',
        content: ['ถุงน้ำบริเวณปลายกระดูกข้อศอกเรียกว่า olecranon bursa ซึ่งอยู่ระหว่างผิวหนังและกระดูกข้อศอก ช่วยลดแรงกระเเทก ช่วยในการเคลื่อนไหวข้อศอก']
      },
      {
        title: 'สาเหตุ',
        content: ['มักจะเกิดจากบาดเจ็บ หรือมีแรงกดตรงบริเวณข้อศอกอยู่เป็นเวลานานๆ หรือ เกิดจากติดเชื้อบริเวณข้อศอก']
      },
      {
        title: 'อาการ',
        content: ['ปวดบวม แดงร้อน บริเวณ olecranon บางรายจะมีไข้ร่วมด้วย ข้อศอกฝืดเวลาใช้งาน']
      }
    ],
    treatment: 'elbow-posterior-olecranon-treatment',
  },

  olecranonTreatment: {
    content: [
      {
        title: 'การดูแลเบื้องต้น',
        desc: [
          'ให้จํากัดหรือหยุดพักการใช้งานบริเวณที่มีอาการ',
          'ใช้หมอนหนุนรองเพื่อช่วยลดแรงกดทับบริเวณศอกโดยเฉพาะเวลานอน',
          'ประคบเย็นเพื่อช่วยลดอาการปวดหรือบวมในช่วงแรกที่อักเสบ',
          'รับประทายาแก้ปวดที่หาซื้อได้ทั่วไปอย่างยาไอบูโพรเฟน Ibuprofen หรือยานาพรอกเซน Naproxen ตามที่แพทย์กําหนด',
        ]
      },
      {
        title: 'พบแพทย์หากอาการไม่ดีขึ้น',
        desc: [
          'ยาปฏิชีวนะ กรณีที่เกิดการติดเชื้อของถุงน้ำบริเวณข้อศอก',
          'การฉีดยาสเตียรอยด์ กรณีรับประทานยาแล้วอาการยังไม่ดีขึ้นหรือมีอาการปวดรุนแรง',
          'การทํากายภาพบําบัดหรือออกกําลังกายเพิ่มความแข็งแรงของกล้ามเนื้อในบริเวณที่มีอาการ',
          'การผ่าตัด เพื่อระบายของเหลวภายในถุงน้ำออกเมื่อเกิดการอักเสบไม่หาย การรักษาอื่นไม่ดีขึ้น',
        ],
      }
    ]


  },

  triceps: {
    content: [
      {
        title: 'คืออะไร',
        content: ['กล้ามเนื้อไตรเซปเป็นกล้ามเนื้อมัดใหญ่อยู่ด้านหลังของต้นแขนมีจุดเกาะเส้นเอ็นที่ข้อศอกช่วยทําหน้าที่เหยียดปลายแขนหรือข้อศอก']
      },
      {
        title: 'สาเหตุ',
        content: ['เกิดจากการใช้งานมากเกินไปในท่าเหยียดข้อศอก เช่น วิดพื้น หรือ การการเล่นกีฬาที่มีการขว้าง']
      },
      {
        title: 'อาการ',
        content: [
          'มีอาการปวด บวมที่เอ็นกล้ามเนื้อ',
          'กล้ามเนื้อไตรเซปบริเวณจุดเกาะที่ กระดูกข้อศอก olecranon process มีอาการมากขึ้นเวลาเหยียดข้อศอกแรงๆ'
        ]
      }
    ],
  },

  /** NOTE Elbow lateral */

  tennis: {
    content: [
      {
        title: 'คืออะไร',
        content: ['เป็นการอักเสบของเอ็นกล้ามเนื้อที่ใช้ในการกระดกข้อมือขึ้นโดยกล้ามเนื้อกลุ่มนี้จะมีจุดเกาะต้นอยู่ที่บริเวณปุ่มกระดูกทางด้านนอกของข้อศอก']
      },
      {
        title: 'สาเหตุ',
        content: ['มักเกิดจากการใช้งานซ้ำๆมากเกินไป จนทําให้เกิดการบาดเจ็บหรือฉีกขาดของเอ็นกล้ามเนื้อบริเวณศอก เช่น นักกีฬาเทนนิส แบดมินตัน ช่างซ่อมที่ต้องใช้เครื่องมือประเภท คีม หรือไขควง เป็นต้น ส่วนใหญ่มักเกิดในช่วงอายุ 30-50 ปี']
      },
      {
        title: 'อาการ',
        content: [
          'ในรายที่พึ่งเป็นอาจพบอาการบวม แดง ร้อนที่บริเวณข้อศอก',
          'มีจุดกดเจ็บที่บริเวณเอ็นกล้ามเนื้อที่เกาะอยู่บริเวณปุ่มกระดูกด้านนอกของข้อศอก มักจะเจ็บเมื่อขยับข้อมือ',
          'ในรายที่มีการอักเสบเรื้อรัง อาจมีอาการอ่อนแรงของกล้ามเนื้อบริเวณข้อศอกร่วมด้วย'
        ]
      }
    ],
    treatment: 'elbow-lateral-tennis-treatment',
  },

  tennisTreatment: {
    content: [
      {
        title: 'การดูแลเบื้องต้น',
        desc: [
          'พักการใช้งานแขนข้างที่มีอาการ หลีกเลี่ยงกิจกรรมที่กระตุ้นให้เกิดอาการ',
          'มีจุดกดเจ็บที่บริเวณเอ็นกล้ามเนื้อที่เกาะอยู่บริเวณปุ่มกระดูกด้านนอกของข้อศอก มักจะเจ็บเมื่อขยับข้อมือประคบเย็นบริเวณที่มีอาการปวดประมาณ 15 - 20 นาที จะช่วยบรรเทาอาการปวดและบวมได้',
          'เวลามีอาการใช้ยาต้านการอักเสบชนิดที่ไม่ใช่สเตียรอยด์ อย่างยาไอบูโพรเฟน Ibuprofen หรือยานาพรอกเซน Naproxen ตามที่แพทย์กําหนด',
          'นักกีฬา ก่อนเล่นกีฬานั้น แนะนําให้มีการยืดกล้ามเนื้อก่อนเล่นกีฬา เพื่อเตรียมพร้อมกล้ามเนื้อ',
          'การใช้อุปกรณ์พยุงข้อศอก (Elbow support) เพื่อจํากัดการเคลื่อนไหวของข้อศอก',
        ],
      },
      {
        title: 'พบแพทย์หากอาการไม่ดีขึ้น',
        desc: [
          'Steroid injection ฉีดสเตียรอยด์เข้าข้อโดยตรง เพื่อลดการบวมการอักเสบที่รุนเเรง การฉีดรักษาขึ้นกับดุลพินิจแพทย์',
          'Platelet Rich Plasma (PRP) คือการสกัดเอาเกล็ดเลือด โปรตีน ฮอร์โมน growth factor และเซลล์จากกระแสเลือด แล้วฉีดกลับเข้าไปยังส่วนที่ได้รับการบาดเจ็บหรือมีการอักเสบ ซึ่งอาจจะช่วยในการสมานแผลและซ่อมแซมเนื้อเยื่อส่วนที่บาดเจ็บ',
          'กายภาพบําบัด เช่น Shockwave therapy เป็นการส่งผ่านคลื่นกระแทกเข้าไปยังบริเวณที่มีอาการบาดเจ็บ เพื่อกระตุ้นให้ร่างกายเกิดกระบวนการซ่อมแซมและสร้างเนื้อเยื่อใหม่ขึ้นมา',
        ],
      }
    ],
    extra:
      'การผ่าตัดอาจพิจารณาทํา หากรักษาด้วยวิธีการอื่นๆแล้วอาการไม่ดีขึ้นภายใน 6 - 12 เดือน',
    extraKey: 'elbow-lateral-tennis-treatment-extra',
  },

  tennisExtra: {
    content: [
      {
        title: 'Open surgery ผ่าเปิด',
        desc: [
          'การผ่าตัดเอาเนื้อเยื่อที่เป็นโรคภายในเอ็น หรือ เอ็นที่เสื่อมสภาพออกทิ้งไป, ขูดกระดูกที่ขลุขละออก พร้อมกับเย็บเอ็นให้กลับเข้าที่เดิม',
          'หลังการผ่าตัด ผู้ป่วยต้องใส่เฝือกชั่วคราวประมาณ 1 สัปดาห์ และมีการฟื้นฟูสมรรถภาพร่างกายอย่างน้อย 2 เดือน เพื่อช่วยให้เอ็นและกล้ามเนื้อทํางานได้เป็นปกติ',
        ],
      },
      {
        title: 'Arthroscopic surgery  ผ่าส่องกล้อง',
        desc: [
          'มีแผลที่เล็กกว่า',
          'อาการปวดหลังผ่าตัดที่น้อยกว่า',
          'ลดระยะเวลาการนอนโรงพยาบาล',
          'สามารถทํากายภาพหลังผ่าตัดทําได้ไวกว่าการผ่าตัดแบบเปิด',
          'สามารถมองเห็นพยาธิสภาพชัดเจน ครอบคลุม',
          'หลังการผ่าตัด ผู้ป่วยต้องใส่เฝือกชั่วคราวประมาณ 1 สัปดาห์ และมีการฟื้นฟูสมรรถภาพร่างกายอย่างน้อย 2 เดือน เพื่อช่วยให้เอ็นและกล้ามเนื้อทํางานได้เป็นปกติ',
        ],
      }
    ],
  },

  /** NOTE Elbow medial */

  golfer: {
    content: [
      {
        title: 'คืออะไร',
        content: ['การอักเสบของกลุ่มเอ็นกล้ามเนื้อด้านในข้อศอก หรือ กลุ่มกล้ามเนื้อที่ใช้งอข้อมือลง']
      },
      {
        title: 'สาเหตุ',
        content: ['การใช้งานซ้ำๆ ที่มากเกินไป หรือ การสะบัดอย่างแรง ทําให้เกิดการบาดเจ็บของเอ็นกล้ามเนื้อที่เกาะกับกระดูก ถ้ารุนแรงมากอาจมีการฉีกขาดของเอ็นกล้ามเนื้อได้']
      },
      {
        title: 'อาการ',
        content: [
          'หากเพิ่งเริ่มเป็นอาจพบอาการบวม แดง ร้อน บริเวณข้อศอกปวดบริเวณปุ่มข้อศอกด้านในซึ่งอาจปวดมากขึ้นเมื่อมีการเคลื่อนไหวข้อมือ',
          'เมื่อคลําดูอาจพบจุดกดเจ็บบริเวณเอ็นกล้ามเนื้อข้อศอกด้านใน',
          'อาการปวดจะเพิ่มมากขึ้น เมื่อต้องออกแรงเกร็งกล้ามเนื้อรอบๆข้อศอก',
          'หากเป็นมานานหรือเรื้อรังอาจพบอาการอ่อนแรงหรือฝ่อลีบของกล้ามเนื้อบริเวณข้อศอก',
        ]
      }
    ],
    treatment: 'elbow-medial-golfer-treatment',
  },

  golferTreatment: {
    content: [
      {
        title: 'การดูแลเบื้องต้น',
        desc: [
          'พักการใช้งานแขนข้างที่มีอาการหลีกเลี่ยงกิจกรรมที่กระตุ้นให้เกิดอาการ',
          'ประคบเย็นบริเวณที่มีอาการปวดประมาณ 15 - 20 นาที จะช่วยบรรเทาอาการปวดและบวมได้',
          'เวลามีอาการใช้ยาต้านการอักเสบชนิดที่ไม่ใช่สเตียรอยด์ อย่างยาไอบูโพรเฟน Ibuprofen หรือยานาพรอกเซน Naproxen ตามที่แพทย์กําหนด',
          'นักกีฬา ก่อนเล่นกีฬานั้น แนะนําให้มีการยืดกล้ามเนื้อก่อนเล่นกีฬา เพื่อเตรียมพร้อมกล้ามเนื้อ',
        ],
      },
      {
        title: 'พบแพทย์หากอาการไม่ดีขึ้น',
        desc: [
          'Steroid injection ฉีดสเตียรอยด์เข้าข้อโดยตรง เพื่อลดการบวมการอักเสบที่รุนเเรง การฉีดรักษาขึ้นกับดุลพินิจแพทย์',
          'Platelet Rich Plasma (PRP) คือการสกัดเอาเกล็ดเลือด โปรตีน ฮอร์โมน growth factor และเซลล์จากกระแสเลือด แล้วฉีดกลับเข้าไปยังส่วนที่ได้รับการบาดเจ็บหรือมีการอักเสบ ซึ่งอาจจะช่วยในการสมานแผลและซ่อมแซมเนื้อเยื่อส่วนที่บาดเจ็บ',
          'กายภาพบําบัด เช่น Shockwave therapy เป็นการส่งผ่านคลื่นกระแทกเข้าไปยังบริเวณที่มีอาการบาดเจ็บ เพื่อกระตุ้นให้ร่างกายเกิดกระบวนการซ่อมแซมและสร้างเนื้อเยื่อใหม่ขึ้นมา',
          'การผ่าตัดอาจพิจารณาทํา หากรักษาด้วยวิธีการอื่นๆแล้วอาการไม่ดีขึ้นภายใน 6 - 12 เดือน',
        ],
      }
    ],
  },

  cubital: {
    content: [
      {
        title: 'คืออะไร',
        content: ['โรคที่เกิดจากการกดทับของเส้นประสาทอัลน่าซึ่งเป็นเส้นประสาทที่พาดผ่านบริเวณข้อศอกไปเลี้ยงกล้ามเนื้อและรับความรู้สึกถึงบริเวณฝ่ามือ']
      },
      {
        title: 'สาเหตุ',
        content: ['ผังผืดที่รัดเส้นประสาทหนาตัวขึ้นจากการทํางานงอศอกบ่อยๆ หรือนานๆ หรืออยู่ในท่าทางที่ทําให้เส้นประสาทเส้นนี้ถูกทับได้มาก ซึ่งคือท่างอศอก ในชีวิตประจําวันก็อาจจะเป็นการถือโทรศัพท์แนบหู ยกไอโฟน ไอแพด นานๆ เป็นต้น']
      },
      {
        title: 'อาการ',
        content: [
          'อาการชา ด้านในของมือ นิ้วก้อย เป็นอาการเริ่มต้นของภาวะนี้ อาการต่อมาจะเริ่ม มีอาการปวดมากขึ้น',
          'ปวดข้อศอกบริเวณด้านข้างส่วนใน อาการปวดไฟฟ้าซ็อตจะร้าวนิ้วก้อยและนิ้วนาง หากปล่อยไว้นานจะเกิดการอ่อนแรงของกล้ามเนื้อมือ'
        ]
      }
    ],
    treatment: 'elbow-medial-cubital-treatment',
  },

  cubitalTreatment: {
    content: [
      {
        title: 'การดูแลเบื้องต้น',
        desc: [
          'ลีกเลี่ยงกิจกรรมที่ต้องงอศอกเป็นเวลานาน',
          'เวลามีอาการใช้ยาต้านการอักเสบชนิดที่ไม่ใช่สเตียรอยด์ อย่างยาไอบูโพรเฟนหรือยานาพรอกเซนตามที่แพทย์กําหนด',
          'การใช้อุปกรณ์พยุงข้อศอก Bracing or splinting ในท่าศอกตรง',
          'Nerve gliding exercises การออกกําลังเส้นเอ็นตามการทํางานของเส้นประสาทอัลน่า ช่วยลดอาการได้โดยลดการยึดติดกดทับที่เกิดขึ้น',
        ]
      },
      {
        title: 'พบแพทย์หากอาการไม่ดีขึ้น',
        desc: [
          '**เมื่อการรักษาเบื้องต้นไม่บรรเทา / การกดทับเส้นประสาทรุนแรง / กล้ามเนื้อเนื้ออ่อนแรงมาก',
          'การผ่าตัดเปิดเส้นประสาท (Open decompression of ulnar nerve)',
          'การผ่าตัดโดยใช้กล้อง(Endoscope decompression of ulnar nerve) ซึ่งมีข้อดีกว่าการผ่าตัดเปิด คือแผลเล็ก ระหว่างที่ผ่าตัดเห็นเส้นประสาทตลอด',
        ],
      }
    ],
  },
};