const text = `โรงพยาบาลวชิรพยาบาลเป็นผู้ให้บริการแอพพลิเคชั่น vajira@home ซึ่งการให้บริการดังกล่าวอยู่ภายใต้ข้อกาหนดและเงื่อนไขการใช้งาน โดยการเข้าใช้บริการแอปพลิเคชั่นนี้ให้ถือว่าผู้ใช้บริการได้ยืนยันว่าเข้าใจและ ยอมรับข้อกำหนดและเงื่อนไข จึงขอให้ผู้ใช้บริการอ่านข้อความดังต่อไปนี้ด้วยความเข้าใจ เพราะมีความสำคัญและมีผลต่อสิทธิทางกฎหมายของผู้ใช้บริการ โรงพยาบาลวชิรพยาบาลอนุญาตให้ผู้ใช้บริการใช้งานแอปพลิเคชั่น vajira@home ภายใต้ข้อกาหนดและเงื่อนไข ดังต่อไปนี้\n

1. คำนิยาม\n

“โรงพยาบาล” หมายความว่า โรงพยาบาลวชิรพยาบาล คณะแพทยศาสตร์วชิรพยาบาล มหาวิทยาลัย นวมินทราธิราช\n

“ข้อมูลส่วนบุคคล” หมายความว่า ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้บุคคล และ/หรือ ข้อมูลใด ๆ ของผู้ใช้บริการที่ให้ไว้แก่โรงพยาบาล ไม่ว่าโดยวิธีการใดๆ\n

“ผู้ใช้บริการ” หมายความถึง ผู้ทำคำขอสมัครใช้บริการ และตกลงยินยอมใช้แอปพลิเคชั่นตามวิธีการที่โรงพยาบาลกำหนด\n

“ชื่อผู้ใช้และรหัสผ่าน” หมายความถึง เลขบัตรประจาตัวประชาชน หรือ เลข HN , รหัสผ่าน Password, รหัส OTP – One Time Password รวมถึงรหัสอื่นใดที่เกี่ยวข้องกับการเข้าใช้บริการแอปพลิเคชั่น ไม่ว่าจะเรียก ด้วยชื่อใดๆ และไม่ว่าจะเป็นที่โรงพยาบาลเป็นผู้กาหนดให้ หรือที่ผู้ขอใช้บริการเป็นผู้กำหนดเองก็ตาม\n\n

2. การให้บริการ/วัตถุประสงค์\n

โรงพยาบาลมีวัตถุประสงค์ในใช้แอปพลิเคชั่น vajira@home เพื่อประโยชน์ในการในการดูแลรักษา สุขภาพผ่านระบบอิเล็คทรอนิกส์ ซึ่งในการบริการรูปแบบดังกล่าวมีความจำเป็นต้องเก็บรวบรวม หรือใช้ข้อมูลส่วน บุคคลของผู้ใช้บริการตลอดระยะเวลาที่ยังใช้แอปพลิเคชั่นอยู่ ตามวัตถุประสงค์ในการให้บริการของโรงพยาบาล หรือตามที่กฎหมายกำหนด และโรงพยาบาลอาจส่ง โอน และ/หรือ เปิดเผยข้อมูลส่วนบุคคลเพื่อการให้บริการ ทางด้านสาธารณสุขแก่เครือข่ายของโรงพยาบาล ทั้งนี้โรงพยาบาลจะไม่กระทำการใดๆ นอกเหนือจากการให้บริการที่กำหนดไว้ เว้นแต่จะได้แจ้งวัตถุประสงค์ใหม่ให้แก่ผู้ใช้บริการทราบและได้รับความยินยอมจาก ผู้ใช้บริการ หรือเป็นการปฏิบัติตามพระราชบัญญัติข้อมูลส่วนบุคคล พ.ศ. 2562 หรือกฎหมายอื่นที่เกี่ยวข้อง\n

2.1 แอพลิเคชั่น vajira@home ครอบคลุมการให้บริการ ดังต่อไปนี้\n

(1) การลงทะเบียนผ่านทาง Google form , QR Code หรือผ่านทางแอปพลิเคชั่น ที่จะพัฒนาและ E-Refer เพื่อส่งต่อผู้ป่วย\n

(2) การโทรศัพท์ติดต่อคนไข้หรือญาติ ผ่านทางวีดีโอคอล สอบถามอาการเพื่อตรวจรักษาพยาบาล\n

(3) ระบบเครือข่ายเชื่อมโยงการทำงานเพื่อพัฒนาระบบบริการปฐมภูมิ ในรูปแบบ Primary Care Trust ทั้งหมด ประกอบด้วย 68 ศูนย์บริการสาธารณสุข สำนักอนามัย กรุงเทพมหานคร และ 5 คลินิก ชุมชนอบอุ่น\n

(4) แนะนำร้านยาคุณภาพใกล้บ้าน\n

(5) การแจ้งเตือนการนัด/ติดต่อนัดหมาย\n

(6) การแจ้งเตือนการเข้าห้องตรวจ\n

(7) ระบบตรวจและบันทึกค่าสัญญาชีพเบื้องต้น อุณหภูมิ ความดันโลหิต ค่าน้ำาตาลปลายนิ้ว \n

(8) ระบบแจ้งเตือนการกิน/ฉีดยาประจำวันพร้อมบันทึกรายงานผล\n

(9) ระบบปรึกษาแพทย์ เมื่อมีอาการผิดปกติ/ระดับน้ำตาล-ความดันโลหิต สูง-ต่ำรุนแรง ผ่านระบบ Chatbot ด้วย AI ที่มีข้อมูลทางวิชาการทางการแพทย์เพียงพอต่อการให้คำปรึกษาเบื้องต้น \n

(10) ระบบส่งยาทางไปรษณีย์\n

(11) ระบบระบุตำแหน่งผู้ป่วยด้วย GPS Google map\n

(12) ระบบส่งต่อฉุกเฉิน Emergency Medical service\n

(13) ระบบบริหารข้อมูลทางการแพทย์ Database Management\n\n

2.2 การเก็บรวบรวมข้อมูลผ่านบริการ vajira@home เพื่อวัตถุประสงค์ต่อไปนี้ \n

(1) เพื่อความสะดวกในการติดต่อและให้คำแนะนำแก่ผู้ใช้บริการ\n

(2) เพื่อประโยชน์ในการดูแลรักษาสุขภาพของผู้ใช้บริการ\n

(3) จัดเก็บข้อมูลที่เป็นประโยชน์ในการรักษาพยาบาล\n

(4) ลดระยะเวลา ค่าใช้จ่าย และความเสี่ยงอื่นใดที่อาจเกิดขึ้น ในการมารับบริการที่โรงพยาบาล \n

(5) วิเคราะห์การใช้บริการและข้อมูลผู้ใช้บริการ เพื่อปรับปรุงการบริการต่างๆให้เหมาะสม\n

(6) เพื่อป้องกันกิจกรรมที่ไม่เหมาะสมหรือผิดกฎหมาย\n

(7) เพื่อวัตถุประสงค์อื่นใด ตามที่ได้รับความยินยอมจากผู้ใช้บริการ\n

2.3 การเก็บรวบรวมข้อมูลส่วนบุคคลนอกเหนือจากการให้บริการ vajira@home จะต้องได้รับความยินยอมเป็นลายลักษณ์อักษรหรือระบบอิเล็กทรอนิกส์ทจากผู้ใช้บริการตามที่โรงพยาบาลกำหนด\n\n

3. การใช้งานแอพพลิเคชั่น\n

(1) ในการเข้าใช้บริการอิเล็กทรอนิกส์ ผู้ใช้บริการต้องใส่ชื่อผู้ใช้และรหัสผ่านให้ถูกต้อง พร้อมปฏิบัติตามขั้นตอน วิธีการ และเงื่อนไขการใช้บริการ ที่โรงพยาบาลกำหนดอย่างถูกต้องครบถ้วนทุกครั้ง\n

(2) ผู้ใช้บริการจะต้องรักษาชื่อผู้ใช้และรหัสผ่านไว้เป็นความลับ และไม่เปิดเผยหรือกระทำการใดๆ ที่อาจทำให้ผู้อื่นทราบชื่อผู้ใช้และรหัสผ่านดังกล่าว\n

(3) ผู้ใช้บริการต้องเก็บรักษาเครื่องมือเพื่อการทำรายการไว้เป็นอย่างดีในที่ปลอดภัย และผู้ใช้บริการต้องไม่ทำให้เครื่องมือเพื่อการทำรายการดังกล่าวตกอยู่ภายใต้การครอบครองของบุคคลอื่น\n

(4) ผู้ใช้บริการสามารถเปลี่ยนแปลงรหัสผ่าน Password และ/หรือรหัสที่เกี่ยวข้องกับการเข้าใช้บริการแอปพลิเคชั่นเมื่อใดก็ได้โดยดำเนินการตามวิธีการและเงื่อนไขที่โรงพยาบาลกำหนด\n\n

4. แนวทางในการดำเนินการคุ้มครองข้อมูลส่วนบุคคล\n

โรงพยาบาลจะกำหนดมาตรการต่างๆ รวมถึงมาตรการด้านการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลที่สอดคล้องกับกฎหมาย ระเบียบ หลักเกณฑ์ และแนวปฏิบัติด้านการคุ้มครองข้อมูลส่วนบุคคลให้แก่ บุคลากรของโรงพยาบาล และบุคคลอื่นที่เกี่ยวข้อง รวมถึงสนับสนุนและส่งเสริมให้บุคลากรมีความรู้และตระหนัก ถึงหน้าที่และความรับผิดชอบในการเก็บรวบรวม การจัดเก็บรักษา การใช้ และการเปิดเผยข้อมูลส่วนบุคคลของเจ้าของข้อมูล โดยบุคลากรของโรงพยาบาลต้องปฏิบัติตามนโยบาย และแนวปฏิบัติการคุ้มครองข้อมูลส่วนบุคคล ตามที่โรงพยาบาลกำหนดไว้ เพื่อให้โรงพยาบาลสามารถปฏิบัติตามนโยบายและกฎหมายคุ้มครองข้อมูลส่วนบุคคล ได้อย่างถูกต้องและมีประสิทธิภาพ\n\n

5. สิทธิของเจ้าของข้อมูลส่วนบุคคล\n

ผู้ใช้บริการมีสิทธิตามพระราชบัญญัติข้อมูลส่วนบุคคล พ.ศ. 2562 ดังต่อไปนี้\n

5.1 สิทธิในการเพิกถอนความยินยอม ทั้งนี้การถอนความยินยอมย่อมไม่ส่งผลกระทบต่อการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลที่ได้ให้ความยินยอมไว้แล้ว\n

5.2 สิทธิในการเข้าถึงข้อมูลส่วนบุคคลของผู้ใช้บริการ และขอให้ทำสำเนาข้อมูลดังกล่าวแก่ผู้ใช้บริการ ที่อยู่ในความรับผิดชอบของโรงพยาบาล หรือขอให้เปิดเผยการได้มาซึ่งข้อมูลส่วนบุคคลที่ผู้ใช้บริการไม่ได้ให้ความยินยอม\n

5.3 สิทธิในการแก้ไขข้อมูลส่วนบุคคลให้ถูกต้อง\n

5.4 สิทธิในการลบข้อมูลส่วนบุคคล\n

5.5 สิทธิในการระงับการใช้ข้อมูลส่วนบุคคล\n

5.6 สิทธิในการให้โอนย้ายข้อมูลส่วนบุคคล\n

5.7 สิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคล\n\n

6. การส่งหรือโอนข้อมูลส่วนบุคคลไปต่างยังประเทศ\n

โรงพยาบาลอาจมีความจำเป็นในการเปิดเผยข้อมูลส่วนบุคคลให้แก่บุคคลธรรมดาหรือนิติบุคคลอื่นทั้งใน และต่างประเทศ ที่เป็นผู้ประมวลผลข้อมูลส่วนบุคคล หรือเป็นผู้ควบคุมข้อมูลส่วนบุคคล ที่มี่อานาจหน้าที่ตัดสินใจ เกี่ยวกับการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล การส่งหรือโอนข้อมูลส่วนบุคคลไปยังต่างประเทศ โรงพยาบาลจะดำเนินการเพื่อให้มั่นใจว่าประเทศปลายทางหรือองค์การระหว่างประเทศที่รับข้อมูลส่วนบุคคล ดังกล่าวมีมาตรฐานการคุ้มครองข้อมูลส่วนบุคคลที่เพียงพอ เว้นแต่เป็นกรณีตามที่กฎหมายว่าด้วยการคุ้มครอง ข้อมูลส่วนบุคคลกำหนด\n\n

7. การทบทวนและเปลี่ยนแปลงนโยบายคุ้มครองข้อมูลส่วนบุคคล\n

โรงพยาบาลอาจทำการปรับปรุงหรือแก้ไขนโยบายเป็นครั้งคราว เพื่อให้สอดคล้องกับข้อกำหนดตามกฎหมาย การดำเนินงานของโรงพยาบาล การเปลี่ยนแปลงของการให้บริการ ตามประกาศนโยบายข้อมูลส่วนบุคคลของมหาวิทยาลัยนวมินทราธิราช หรือตามข้อเสนอแนะและความคิดเห็นจากผู้ใช้บริการ\n\n

8. ช่องทางการติดต่อ\n

หากผู้ใช้บริการต้องการติดต่อเพ่ือขอใช้สิทธิของข้อมูลส่วนบุคคล หรือหากมีข้อสงสัย หรือข้อเรียกร้อง ใด ๆ ผู้ใช้บริการสามารถติดต่อโรงพยาบาลได้ตามช่องทาง ต่อไปน้ี\n

โรงพยาบาลวชิรพยาบาล คณะแพทยศาสตร์วชิรพยาบาล มหาวิทยาลัยนวมินทราธิราช \n

ที่อยู่ 681 ถนนสามเสน แขวงวชิรพยาบาล เขตดุสิต กรุงเทพฯ 10300\n`;

export default text;
